
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1340",
    "已准待撥件數": "9",
    "已准待撥": "1750",
    "已准待對保件數": "8",
    "已准待對保金額": "1650",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "100"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "4",
    "已進件待核准金額": "900",
    "已准待撥件數": "10",
    "已准待撥": "1460",
    "已准待對保件數": "8",
    "已准待對保金額": "1260",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "500",
    "已准待撥件數": "10",
    "已准待撥": "1180",
    "已准待對保件數": "6",
    "已准待對保金額": "770",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "410"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "4",
    "已准待撥": "780",
    "已准待對保件數": "1",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "580"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "1",
    "已進件待核准金額": "450",
    "已准待撥件數": "9",
    "已准待撥": "1120",
    "已准待對保件數": "6",
    "已准待對保金額": "690",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "430"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "2",
    "已進件待核准金額": "430",
    "已准待撥件數": "8",
    "已准待撥": "1110",
    "已准待對保件數": "7",
    "已准待對保金額": "860",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "3",
    "已進件待核准金額": "970",
    "已准待撥件數": "3",
    "已准待撥": "460",
    "已准待對保件數": "2",
    "已准待對保金額": "260",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "800",
    "已准待撥件數": "7",
    "已准待撥": "880",
    "已准待對保件數": "5",
    "已准待對保金額": "630",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "9",
    "已准待撥": "1330",
    "已准待對保件數": "5",
    "已准待對保金額": "1050",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "280"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1500",
    "已准待撥件數": "7",
    "已准待撥": "1230",
    "已准待對保件數": "5",
    "已准待對保金額": "830",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "總和",
    "已進件待核准": "29",
    "已進件待核准金額": "7490",
    "已准待撥件數": "76",
    "已准待撥": "11300",
    "已准待對保件數": "53",
    "已准待對保金額": "8200",
    "已對保待撥件數的SUM": "23",
    "已對保待撥金額的SUM": "3100"
  }
];
const historyData = [
  {
    "timestamp": "2026-05-13T07:00:21.108Z",
    "A": 51,
    "A_amount": 7675,
    "B": 33,
    "B_amount": 4730
  },
  {
    "timestamp": "2026-05-14T01:01:02.647Z",
    "A": 50,
    "A_amount": 7595,
    "B": 37,
    "B_amount": 5190
  },
  {
    "timestamp": "2026-05-14T07:01:14.728Z",
    "A": 58,
    "A_amount": 8715,
    "B": 31,
    "B_amount": 4330
  },
  {
    "timestamp": "2026-05-15T01:01:19.989Z",
    "A": 54,
    "A_amount": 8185,
    "B": 36,
    "B_amount": 5160
  },
  {
    "timestamp": "2026-05-15T07:01:26.765Z",
    "A": 59,
    "A_amount": 8715,
    "B": 32,
    "B_amount": 4440
  },
  {
    "timestamp": "2026-05-16T01:01:32.523Z",
    "A": 64,
    "A_amount": 9635,
    "B": 36,
    "B_amount": 4790
  },
  {
    "timestamp": "2026-05-16T07:01:38.166Z",
    "A": 64,
    "A_amount": 9635,
    "B": 36,
    "B_amount": 4790
  },
  {
    "timestamp": "2026-05-17T01:01:54.560Z",
    "A": 64,
    "A_amount": 9635,
    "B": 36,
    "B_amount": 4790
  },
  {
    "timestamp": "2026-05-17T07:02:12.684Z",
    "A": 64,
    "A_amount": 9635,
    "B": 36,
    "B_amount": 4790
  },
  {
    "timestamp": "2026-05-18T01:02:19.041Z",
    "A": 63,
    "A_amount": 9435,
    "B": 37,
    "B_amount": 4990
  },
  {
    "timestamp": "2026-05-18T07:02:23.690Z",
    "A": 62,
    "A_amount": 9295,
    "B": 34,
    "B_amount": 4810
  },
  {
    "timestamp": "2026-05-19T01:02:29.945Z",
    "A": 41,
    "A_amount": 6120,
    "B": 55,
    "B_amount": 7190
  },
  {
    "timestamp": "2026-05-19T07:02:37.483Z",
    "A": 52,
    "A_amount": 7490,
    "B": 47,
    "B_amount": 6330
  },
  {
    "timestamp": "2026-05-20T01:02:45.193Z",
    "A": 43,
    "A_amount": 6310,
    "B": 57,
    "B_amount": 7780
  },
  {
    "timestamp": "2026-05-20T07:02:52.368Z",
    "A": 46,
    "A_amount": 6920,
    "B": 52,
    "B_amount": 6760
  },
  {
    "timestamp": "2026-05-21T01:03:00.967Z",
    "A": 42,
    "A_amount": 6610,
    "B": 58,
    "B_amount": 7390
  },
  {
    "timestamp": "2026-05-21T07:39:16.624Z",
    "A": 37,
    "A_amount": 5660,
    "B": 43,
    "B_amount": 6380
  },
  {
    "timestamp": "2026-05-22T01:05:52.460Z",
    "A": 36,
    "A_amount": 5520,
    "B": 47,
    "B_amount": 6980
  },
  {
    "timestamp": "2026-05-22T07:05:58.936Z",
    "A": 43,
    "A_amount": 6420,
    "B": 29,
    "B_amount": 4500
  },
  {
    "timestamp": "2026-05-23T01:06:15.477Z",
    "A": 42,
    "A_amount": 6150,
    "B": 32,
    "B_amount": 4660
  },
  {
    "timestamp": "2026-05-23T07:06:32.368Z",
    "A": 42,
    "A_amount": 6150,
    "B": 32,
    "B_amount": 4660
  },
  {
    "timestamp": "2026-05-24T01:06:37.964Z",
    "A": 42,
    "A_amount": 6150,
    "B": 32,
    "B_amount": 4660
  },
  {
    "timestamp": "2026-05-24T07:06:42.772Z",
    "A": 42,
    "A_amount": 6150,
    "B": 32,
    "B_amount": 4660
  },
  {
    "timestamp": "2026-05-25T01:06:49.002Z",
    "A": 41,
    "A_amount": 6070,
    "B": 33,
    "B_amount": 4740
  },
  {
    "timestamp": "2026-05-25T07:00:07.546Z",
    "A": 42,
    "A_amount": 6690,
    "B": 31,
    "B_amount": 4430
  },
  {
    "timestamp": "2026-05-26T01:00:13.218Z",
    "A": 38,
    "A_amount": 5850,
    "B": 37,
    "B_amount": 5490
  },
  {
    "timestamp": "2026-05-26T07:00:19.126Z",
    "A": 42,
    "A_amount": 8940,
    "B": 27,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-05-27T01:00:26.391Z",
    "A": 41,
    "A_amount": 6590,
    "B": 31,
    "B_amount": 4300
  },
  {
    "timestamp": "2026-05-28T02:24:06.345Z",
    "A": 50,
    "A_amount": 7740,
    "B": 29,
    "B_amount": 3800
  },
  {
    "timestamp": "2026-05-28T07:00:20.212Z",
    "A": 53,
    "A_amount": 8200,
    "B": 23,
    "B_amount": 3100
  }
];
