
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "10",
    "已進件待核准金額": "1708",
    "已准待撥件數": "12",
    "已准待撥": "1990",
    "已准待對保件數": "11",
    "已准待對保金額": "1810",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "180"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "9",
    "已進件待核准金額": "2090",
    "已准待撥件數": "7",
    "已准待撥": "970",
    "已准待對保件數": "3",
    "已准待對保金額": "460",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "510"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "430",
    "已准待撥件數": "10",
    "已准待撥": "1130",
    "已准待對保件數": "6",
    "已准待對保金額": "580",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "550"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "700",
    "已准待撥件數": "12",
    "已准待撥": "1970",
    "已准待對保件數": "8",
    "已准待對保金額": "1400",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "570"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "5",
    "已進件待核准金額": "1650",
    "已准待撥件數": "10",
    "已准待撥": "1270",
    "已准待對保件數": "6",
    "已准待對保金額": "800",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "470"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "200",
    "已准待撥件數": "10",
    "已准待撥": "1230",
    "已准待對保件數": "5",
    "已准待對保金額": "730",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "380",
    "已准待撥件數": "11",
    "已准待撥": "1660",
    "已准待對保件數": "10",
    "已准待對保金額": "1610",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "50"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "180",
    "已准待對保件數": "1",
    "已准待對保金額": "180",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "7",
    "已進件待核准金額": "1630",
    "已准待撥件數": "3",
    "已准待撥": "220",
    "已准待對保件數": "1",
    "已准待對保金額": "50",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "170"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "3",
    "已准待撥": "430",
    "已准待對保件數": "2",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "110"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1300",
    "已准待撥件數": "6",
    "已准待撥": "860",
    "已准待對保件數": "4",
    "已准待對保金額": "460",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "總和",
    "已進件待核准": "45",
    "已進件待核准金額": "10388",
    "已准待撥件數": "85",
    "已准待撥": "11910",
    "已准待對保件數": "57",
    "已准待對保金額": "8400",
    "已對保待撥件數的SUM": "28",
    "已對保待撥金額的SUM": "3510"
  }
];
const historyData = [
  {
    "timestamp": "2026-07-02T07:04:35.900Z",
    "A": 38,
    "A_amount": 5580,
    "B": 19,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-07-06T07:00:08.964Z",
    "A": 43,
    "A_amount": 6720,
    "B": 26,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-07-07T01:00:18.419Z",
    "A": 41,
    "A_amount": 6560,
    "B": 31,
    "B_amount": 4420
  },
  {
    "timestamp": "2026-07-07T07:00:25.385Z",
    "A": 42,
    "A_amount": 6750,
    "B": 21,
    "B_amount": 2985
  },
  {
    "timestamp": "2026-07-08T01:00:32.575Z",
    "A": 42,
    "A_amount": 6540,
    "B": 25,
    "B_amount": 3575
  },
  {
    "timestamp": "2026-07-08T07:00:40.297Z",
    "A": 48,
    "A_amount": 7350,
    "B": 19,
    "B_amount": 2805
  },
  {
    "timestamp": "2026-07-09T01:00:48.853Z",
    "A": 49,
    "A_amount": 7360,
    "B": 24,
    "B_amount": 3575
  },
  {
    "timestamp": "2026-07-09T07:00:57.254Z",
    "A": 56,
    "A_amount": 8020,
    "B": 17,
    "B_amount": 2630
  },
  {
    "timestamp": "2026-07-10T01:01:06.009Z",
    "A": 54,
    "A_amount": 7550,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-07-10T07:01:13.532Z",
    "A": 54,
    "A_amount": 7550,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-07-11T01:01:34.241Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-11T07:01:52.154Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-12T01:02:13.842Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-12T07:02:18.882Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-13T01:02:28.116Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-13T07:02:34.229Z",
    "A": 53,
    "A_amount": 7780,
    "B": 25,
    "B_amount": 3630
  },
  {
    "timestamp": "2026-07-14T01:02:42.692Z",
    "A": 49,
    "A_amount": 7110,
    "B": 34,
    "B_amount": 5090
  },
  {
    "timestamp": "2026-07-14T07:02:48.578Z",
    "A": 56,
    "A_amount": 7680,
    "B": 27,
    "B_amount": 3890
  },
  {
    "timestamp": "2026-07-15T01:03:15.815Z",
    "A": 36,
    "A_amount": 5110,
    "B": 28,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-07-16T07:00:35.151Z",
    "A": 40,
    "A_amount": 5990,
    "B": 24,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-07-17T01:00:43.396Z",
    "A": 34,
    "A_amount": 5470,
    "B": 33,
    "B_amount": 4080
  },
  {
    "timestamp": "2026-07-17T07:00:50.907Z",
    "A": 44,
    "A_amount": 6810,
    "B": 25,
    "B_amount": 2910
  },
  {
    "timestamp": "2026-07-18T01:01:09.315Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-18T07:01:16.353Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-19T01:01:24.121Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-19T07:01:43.957Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-20T01:00:08.578Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-20T07:00:21.067Z",
    "A": 55,
    "A_amount": 7860,
    "B": 26,
    "B_amount": 3170
  },
  {
    "timestamp": "2026-07-21T01:00:31.716Z",
    "A": 49,
    "A_amount": 7320,
    "B": 33,
    "B_amount": 4020
  },
  {
    "timestamp": "2026-07-21T07:03:43.891Z",
    "A": 57,
    "A_amount": 8400,
    "B": 28,
    "B_amount": 3510
  }
];
