
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "13",
    "已進件待核准金額": "2670",
    "已准待撥件數": "9",
    "已准待撥": "1110",
    "已准待對保件數": "6",
    "已准待對保金額": "810",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1390",
    "已准待撥件數": "5",
    "已准待撥": "850",
    "已准待對保件數": "2",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "530"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "230",
    "已准待撥件數": "4",
    "已准待撥": "800",
    "已准待對保件數": "3",
    "已准待對保金額": "650",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "5",
    "已進件待核准金額": "950",
    "已准待撥件數": "4",
    "已准待撥": "500",
    "已准待對保件數": "2",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "5",
    "已進件待核准金額": "1720",
    "已准待撥件數": "5",
    "已准待撥": "820",
    "已准待對保件數": "3",
    "已准待對保金額": "490",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "4",
    "已准待撥": "930",
    "已准待對保件數": "4",
    "已准待對保金額": "930",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "11",
    "已准待撥": "1250",
    "已准待對保件數": "5",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "950"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "850",
    "已准待撥件數": "3",
    "已准待撥": "470",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "320"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "510",
    "已准待撥件數": "6",
    "已准待撥": "730",
    "已准待對保件數": "3",
    "已准待對保金額": "440",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "290"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1700",
    "已准待撥件數": "10",
    "已准待撥": "1430",
    "已准待對保件數": "5",
    "已准待對保金額": "760",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "670"
  },
  {
    "經辦": "總和",
    "已進件待核准": "43",
    "已進件待核准金額": "10250",
    "已准待撥件數": "61",
    "已准待撥": "8890",
    "已准待對保件數": "34",
    "已准待對保金額": "5150",
    "已對保待撥件數的SUM": "27",
    "已對保待撥金額的SUM": "3740"
  }
];
const historyData = [
  {
    "timestamp": "2026-09-19T01:03:11.570Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-19T07:03:39.961Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-20T01:04:22.556Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-20T07:05:03.504Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-21T01:05:37.350Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-21T07:02:34.560Z",
    "A": 41,
    "A_amount": 6460,
    "B": 31,
    "B_amount": 3180
  },
  {
    "timestamp": "2026-09-22T01:01:13.030Z",
    "A": 39,
    "A_amount": 6080,
    "B": 35,
    "B_amount": 3880
  },
  {
    "timestamp": "2026-09-22T07:01:45.242Z",
    "A": 40,
    "A_amount": 5890,
    "B": 27,
    "B_amount": 3290
  },
  {
    "timestamp": "2026-09-23T01:00:31.577Z",
    "A": 30,
    "A_amount": 4750,
    "B": 35,
    "B_amount": 4340
  },
  {
    "timestamp": "2026-09-23T07:01:10.642Z",
    "A": 30,
    "A_amount": 4680,
    "B": 26,
    "B_amount": 3840
  },
  {
    "timestamp": "2026-09-24T01:01:44.564Z",
    "A": 29,
    "A_amount": 4540,
    "B": 28,
    "B_amount": 4060
  },
  {
    "timestamp": "2026-09-24T07:02:14.345Z",
    "A": 30,
    "A_amount": 4850,
    "B": 25,
    "B_amount": 3570
  },
  {
    "timestamp": "2026-09-25T01:02:55.320Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-25T07:03:12.913Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-26T01:03:43.252Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-26T07:04:00.036Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-27T01:04:40.044Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-27T07:05:20.741Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-28T01:05:48.966Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-28T07:06:30.819Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-29T01:07:02.241Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-29T07:00:43.897Z",
    "A": 34,
    "A_amount": 5470,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-09-30T01:01:16.421Z",
    "A": 36,
    "A_amount": 5690,
    "B": 26,
    "B_amount": 3790
  },
  {
    "timestamp": "2026-09-30T07:01:51.501Z",
    "A": 42,
    "A_amount": 6820,
    "B": 9,
    "B_amount": 1300
  },
  {
    "timestamp": "2026-10-01T01:02:22.160Z",
    "A": 46,
    "A_amount": 7430,
    "B": 11,
    "B_amount": 1600
  },
  {
    "timestamp": "2026-10-01T07:02:51.363Z",
    "A": 47,
    "A_amount": 7450,
    "B": 13,
    "B_amount": 1890
  },
  {
    "timestamp": "2026-10-02T01:03:22.892Z",
    "A": 55,
    "A_amount": 8580,
    "B": 13,
    "B_amount": 1890
  },
  {
    "timestamp": "2026-10-02T07:17:20.168Z",
    "A": 34,
    "A_amount": 5010,
    "B": 17,
    "B_amount": 2310
  },
  {
    "timestamp": "2026-10-05T02:12:29.676Z",
    "A": 30,
    "A_amount": 4540,
    "B": 23,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-10-05T07:10:30.242Z",
    "A": 34,
    "A_amount": 5150,
    "B": 27,
    "B_amount": 3740
  }
];
