
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1490",
    "已准待撥件數": "8",
    "已准待撥": "1040",
    "已准待對保件數": "5",
    "已准待對保金額": "730",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "310"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "7",
    "已進件待核准金額": "1590",
    "已准待撥件數": "3",
    "已准待撥": "420",
    "已准待對保件數": "3",
    "已准待對保金額": "420",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "12",
    "已准待撥": "1710",
    "已准待對保件數": "7",
    "已准待對保金額": "1030",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "680"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "5",
    "已准待撥": "570",
    "已准待對保件數": "3",
    "已准待對保金額": "460",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "110"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "750",
    "已准待撥件數": "7",
    "已准待撥": "810",
    "已准待對保件數": "6",
    "已准待對保金額": "680",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "130"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "4",
    "已准待撥": "520",
    "已准待對保件數": "3",
    "已准待對保金額": "470",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "50"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "8",
    "已准待撥": "1490",
    "已准待對保件數": "6",
    "已准待對保金額": "1110",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "300",
    "已准待對保件數": "1",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "5",
    "已進件待核准金額": "1350",
    "已准待撥件數": "8",
    "已准待撥": "1060",
    "已准待對保件數": "4",
    "已准待對保金額": "410",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "5",
    "已准待撥": "680",
    "已准待對保件數": "3",
    "已准待對保金額": "460",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "220"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1200",
    "已准待撥件數": "7",
    "已准待撥": "1025",
    "已准待對保件數": "5",
    "已准待對保金額": "820",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "205"
  },
  {
    "經辦": "總和",
    "已進件待核准": "29",
    "已進件待核准金額": "7610",
    "已准待撥件數": "68",
    "已准待撥": "9625",
    "已准待對保件數": "46",
    "已准待對保金額": "6890",
    "已對保待撥件數的SUM": "22",
    "已對保待撥金額的SUM": "2735"
  }
];
const historyData = [
  {
    "timestamp": "2026-07-18T07:01:16.353Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-19T01:01:24.121Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-19T07:01:43.957Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-20T01:00:08.578Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-20T07:00:21.067Z",
    "A": 55,
    "A_amount": 7860,
    "B": 26,
    "B_amount": 3170
  },
  {
    "timestamp": "2026-07-21T01:00:31.716Z",
    "A": 49,
    "A_amount": 7320,
    "B": 33,
    "B_amount": 4020
  },
  {
    "timestamp": "2026-07-21T07:03:43.891Z",
    "A": 57,
    "A_amount": 8400,
    "B": 28,
    "B_amount": 3510
  },
  {
    "timestamp": "2026-07-22T01:03:53.529Z",
    "A": 49,
    "A_amount": 7170,
    "B": 39,
    "B_amount": 5070
  },
  {
    "timestamp": "2026-07-22T07:04:01.098Z",
    "A": 59,
    "A_amount": 8380,
    "B": 29,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-07-23T01:04:11.015Z",
    "A": 56,
    "A_amount": 7970,
    "B": 34,
    "B_amount": 4520
  },
  {
    "timestamp": "2026-07-23T07:04:18.627Z",
    "A": 60,
    "A_amount": 8730,
    "B": 26,
    "B_amount": 3760
  },
  {
    "timestamp": "2026-07-24T01:04:25.683Z",
    "A": 55,
    "A_amount": 8150,
    "B": 35,
    "B_amount": 5110
  },
  {
    "timestamp": "2026-07-24T07:04:32.199Z",
    "A": 58,
    "A_amount": 8650,
    "B": 26,
    "B_amount": 3690
  },
  {
    "timestamp": "2026-07-25T01:04:41.050Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-25T07:04:58.877Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-26T01:05:09.353Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-26T07:05:26.720Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-27T01:05:36.535Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-27T07:05:42.336Z",
    "A": 54,
    "A_amount": 7870,
    "B": 26,
    "B_amount": 3620
  },
  {
    "timestamp": "2026-07-28T01:05:49.604Z",
    "A": 57,
    "A_amount": 8390,
    "B": 33,
    "B_amount": 4600
  },
  {
    "timestamp": "2026-07-28T07:05:55.402Z",
    "A": 61,
    "A_amount": 8610,
    "B": 35,
    "B_amount": 5120
  },
  {
    "timestamp": "2026-07-29T01:06:06.524Z",
    "A": 33,
    "A_amount": 5260,
    "B": 39,
    "B_amount": 5540
  },
  {
    "timestamp": "2026-07-30T07:03:40.227Z",
    "A": 43,
    "A_amount": 6420,
    "B": 30,
    "B_amount": 4290
  },
  {
    "timestamp": "2026-07-31T01:03:48.538Z",
    "A": 49,
    "A_amount": 6930,
    "B": 30,
    "B_amount": 4290
  },
  {
    "timestamp": "2026-07-31T07:03:55.137Z",
    "A": 45,
    "A_amount": 6750,
    "B": 21,
    "B_amount": 2605
  },
  {
    "timestamp": "2026-08-01T01:04:13.801Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-01T07:04:32.401Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-02T01:04:51.170Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-02T07:05:11.391Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-03T01:05:19.433Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  }
];
