
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1270",
    "已准待撥件數": "11",
    "已准待撥": "1890",
    "已准待對保件數": "6",
    "已准待對保金額": "1110",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "780"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "960",
    "已准待撥件數": "12",
    "已准待撥": "1790",
    "已准待對保件數": "4",
    "已准待對保金額": "400",
    "已對保待撥件數的SUM": "8",
    "已對保待撥金額的SUM": "1390"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "310",
    "已准待撥件數": "7",
    "已准待撥": "880",
    "已准待對保件數": "1",
    "已准待對保金額": "100",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "780"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "6",
    "已准待撥": "850",
    "已准待對保件數": "2",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "3",
    "已進件待核准金額": "680",
    "已准待撥件數": "9",
    "已准待撥": "1380",
    "已准待對保件數": "6",
    "已准待對保金額": "930",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "250",
    "已准待撥件數": "9",
    "已准待撥": "1500",
    "已准待對保件數": "5",
    "已准待對保金額": "790",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "710"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "530",
    "已准待撥件數": "3",
    "已准待撥": "550",
    "已准待對保件數": "3",
    "已准待對保金額": "550",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "150",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "10",
    "已准待撥": "1140",
    "已准待對保件數": "6",
    "已准待對保金額": "810",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "3",
    "已准待撥": "430",
    "已准待對保件數": "1",
    "已准待對保金額": "80",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1500",
    "已准待撥件數": "8",
    "已准待撥": "1485",
    "已准待對保件數": "5",
    "已准待對保金額": "935",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "550"
  },
  {
    "經辦": "總和",
    "已進件待核准": "30",
    "已進件待核准金額": "6750",
    "已准待撥件數": "79",
    "已准待撥": "12045",
    "已准待對保件數": "40",
    "已准待對保金額": "6055",
    "已對保待撥件數的SUM": "39",
    "已對保待撥金額的SUM": "5990"
  }
];
const historyData = [
  {
    "timestamp": "2026-05-25T01:06:49.002Z",
    "A": 41,
    "A_amount": 6070,
    "B": 33,
    "B_amount": 4740
  },
  {
    "timestamp": "2026-05-25T07:00:07.546Z",
    "A": 42,
    "A_amount": 6690,
    "B": 31,
    "B_amount": 4430
  },
  {
    "timestamp": "2026-05-26T01:00:13.218Z",
    "A": 38,
    "A_amount": 5850,
    "B": 37,
    "B_amount": 5490
  },
  {
    "timestamp": "2026-05-26T07:00:19.126Z",
    "A": 42,
    "A_amount": 8940,
    "B": 27,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-05-27T01:00:26.391Z",
    "A": 41,
    "A_amount": 6590,
    "B": 31,
    "B_amount": 4300
  },
  {
    "timestamp": "2026-05-28T02:24:06.345Z",
    "A": 50,
    "A_amount": 7740,
    "B": 29,
    "B_amount": 3800
  },
  {
    "timestamp": "2026-05-28T07:00:20.212Z",
    "A": 53,
    "A_amount": 8200,
    "B": 23,
    "B_amount": 3100
  },
  {
    "timestamp": "2026-05-29T01:00:27.114Z",
    "A": 59,
    "A_amount": 9150,
    "B": 21,
    "B_amount": 2970
  },
  {
    "timestamp": "2026-05-29T07:00:34.196Z",
    "A": 46,
    "A_amount": 6950,
    "B": 20,
    "B_amount": 2940
  },
  {
    "timestamp": "2026-05-30T01:00:52.248Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-30T07:01:09.288Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-31T01:01:15.578Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-31T07:01:34.645Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-06-01T01:01:41.742Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-06-01T07:01:47.558Z",
    "A": 50,
    "A_amount": 7495,
    "B": 26,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-06-02T01:01:52.556Z",
    "A": 43,
    "A_amount": 6385,
    "B": 34,
    "B_amount": 5320
  },
  {
    "timestamp": "2026-06-02T07:01:59.106Z",
    "A": 51,
    "A_amount": 7485,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-06-03T01:02:06.925Z",
    "A": 52,
    "A_amount": 7895,
    "B": 34,
    "B_amount": 4570
  },
  {
    "timestamp": "2026-06-03T07:02:14.011Z",
    "A": 56,
    "A_amount": 8565,
    "B": 27,
    "B_amount": 3720
  },
  {
    "timestamp": "2026-06-04T01:02:21.904Z",
    "A": 53,
    "A_amount": 8095,
    "B": 32,
    "B_amount": 4590
  },
  {
    "timestamp": "2026-06-04T07:02:28.586Z",
    "A": 56,
    "A_amount": 8375,
    "B": 29,
    "B_amount": 4220
  },
  {
    "timestamp": "2026-06-05T01:02:33.572Z",
    "A": 53,
    "A_amount": 7865,
    "B": 38,
    "B_amount": 5530
  },
  {
    "timestamp": "2026-06-05T07:02:39.562Z",
    "A": 60,
    "A_amount": 8715,
    "B": 30,
    "B_amount": 4840
  },
  {
    "timestamp": "2026-06-06T01:02:59.598Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-06T07:03:16.998Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-07T01:03:34.423Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-07T07:03:53.252Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-08T01:04:00.713Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-08T07:04:06.699Z",
    "A": 53,
    "A_amount": 7945,
    "B": 33,
    "B_amount": 4850
  },
  {
    "timestamp": "2026-06-09T01:04:13.861Z",
    "A": 40,
    "A_amount": 6055,
    "B": 39,
    "B_amount": 5990
  }
];
