
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "11",
    "已進件待核准金額": "1928",
    "已准待撥件數": "10",
    "已准待撥": "1470",
    "已准待對保件數": "7",
    "已准待對保金額": "1060",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "410"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "8",
    "已進件待核准金額": "1590",
    "已准待撥件數": "11",
    "已准待撥": "1410",
    "已准待對保件數": "7",
    "已准待對保金額": "640",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "770"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "4",
    "已進件待核准金額": "470",
    "已准待撥件數": "5",
    "已准待撥": "780",
    "已准待對保件數": "2",
    "已准待對保金額": "360",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "420"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "800",
    "已准待撥件數": "13",
    "已准待撥": "2450",
    "已准待對保件數": "8",
    "已准待對保金額": "1680",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "770"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "750",
    "已准待撥件數": "14",
    "已准待撥": "1890",
    "已准待對保件數": "12",
    "已准待對保金額": "1720",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "170"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "4",
    "已進件待核准金額": "1060",
    "已准待撥件數": "3",
    "已准待撥": "410",
    "已准待對保件數": "1",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "210"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "4",
    "已進件待核准金額": "950",
    "已准待撥件數": "9",
    "已准待撥": "1090",
    "已准待對保件數": "7",
    "已准待對保金額": "840",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "7",
    "已進件待核准金額": "1530",
    "已准待撥件數": "5",
    "已准待撥": "530",
    "已准待對保件數": "3",
    "已准待對保金額": "280",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "450",
    "已准待撥件數": "5",
    "已准待撥": "700",
    "已准待對保件數": "2",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "6",
    "已進件待核准金額": "1500",
    "已准待撥件數": "2",
    "已准待撥": "350",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "總和",
    "已進件待核准": "51",
    "已進件待核准金額": "11028",
    "已准待撥件數": "77",
    "已准待撥": "11080",
    "已准待對保件數": "49",
    "已准待對保金額": "7100",
    "已對保待撥件數的SUM": "28",
    "已對保待撥金額的SUM": "3980"
  }
];
const historyData = [
  {
    "timestamp": "2026-06-23T01:02:02.586Z",
    "A": 54,
    "A_amount": 8370,
    "B": 45,
    "B_amount": 6240
  },
  {
    "timestamp": "2026-06-23T07:02:10.683Z",
    "A": 61,
    "A_amount": 9060,
    "B": 36,
    "B_amount": 4720
  },
  {
    "timestamp": "2026-06-24T01:02:18.367Z",
    "A": 57,
    "A_amount": 8590,
    "B": 45,
    "B_amount": 5990
  },
  {
    "timestamp": "2026-06-24T07:02:26.895Z",
    "A": 56,
    "A_amount": 8455,
    "B": 37,
    "B_amount": 4840
  },
  {
    "timestamp": "2026-06-25T01:01:59.572Z",
    "A": 48,
    "A_amount": 6945,
    "B": 34,
    "B_amount": 4190
  },
  {
    "timestamp": "2026-06-25T07:02:09.394Z",
    "A": 54,
    "A_amount": 7745,
    "B": 26,
    "B_amount": 3400
  },
  {
    "timestamp": "2026-06-26T01:02:16.675Z",
    "A": 42,
    "A_amount": 6155,
    "B": 40,
    "B_amount": 5270
  },
  {
    "timestamp": "2026-06-26T07:02:23.303Z",
    "A": 43,
    "A_amount": 6305,
    "B": 25,
    "B_amount": 3300
  },
  {
    "timestamp": "2026-06-27T01:02:41.687Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-27T07:03:00.413Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-28T01:03:20.322Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-28T07:03:38.357Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-29T01:03:45.314Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-29T07:03:51.353Z",
    "A": 35,
    "A_amount": 4945,
    "B": 25,
    "B_amount": 3670
  },
  {
    "timestamp": "2026-06-30T01:03:59.162Z",
    "A": 39,
    "A_amount": 5305,
    "B": 23,
    "B_amount": 3270
  },
  {
    "timestamp": "2026-06-30T07:04:05.541Z",
    "A": 38,
    "A_amount": 5365,
    "B": 17,
    "B_amount": 2290
  },
  {
    "timestamp": "2026-07-01T01:04:14.589Z",
    "A": 33,
    "A_amount": 4920,
    "B": 24,
    "B_amount": 3005
  },
  {
    "timestamp": "2026-07-01T07:04:20.561Z",
    "A": 36,
    "A_amount": 5370,
    "B": 22,
    "B_amount": 2850
  },
  {
    "timestamp": "2026-07-02T01:04:30.778Z",
    "A": 32,
    "A_amount": 4760,
    "B": 28,
    "B_amount": 3610
  },
  {
    "timestamp": "2026-07-02T07:04:35.900Z",
    "A": 38,
    "A_amount": 5580,
    "B": 19,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-07-06T07:00:08.964Z",
    "A": 43,
    "A_amount": 6720,
    "B": 26,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-07-07T01:00:18.419Z",
    "A": 41,
    "A_amount": 6560,
    "B": 31,
    "B_amount": 4420
  },
  {
    "timestamp": "2026-07-07T07:00:25.385Z",
    "A": 42,
    "A_amount": 6750,
    "B": 21,
    "B_amount": 2985
  },
  {
    "timestamp": "2026-07-08T01:00:32.575Z",
    "A": 42,
    "A_amount": 6540,
    "B": 25,
    "B_amount": 3575
  },
  {
    "timestamp": "2026-07-08T07:00:40.297Z",
    "A": 48,
    "A_amount": 7350,
    "B": 19,
    "B_amount": 2805
  },
  {
    "timestamp": "2026-07-09T01:00:48.853Z",
    "A": 49,
    "A_amount": 7360,
    "B": 24,
    "B_amount": 3575
  },
  {
    "timestamp": "2026-07-09T07:00:57.254Z",
    "A": 56,
    "A_amount": 8020,
    "B": 17,
    "B_amount": 2630
  },
  {
    "timestamp": "2026-07-10T01:01:06.009Z",
    "A": 54,
    "A_amount": 7550,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-07-10T07:01:13.532Z",
    "A": 54,
    "A_amount": 7550,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-07-11T01:01:34.241Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  }
];
