
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "18",
    "已進件待核准金額": "3790",
    "已准待撥件數": "9",
    "已准待撥": "1310",
    "已准待對保件數": "6",
    "已准待對保金額": "960",
    "已對保待撥件數": "3",
    "已對保待撥金額": "350"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1390",
    "已准待撥件數": "7",
    "已准待撥": "810",
    "已准待對保件數": "5",
    "已准待對保金額": "580",
    "已對保待撥件數": "2",
    "已對保待撥金額": "230"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "4",
    "已進件待核准金額": "550",
    "已准待撥件數": "10",
    "已准待撥": "1050",
    "已准待對保件數": "2",
    "已准待對保金額": "130",
    "已對保待撥件數": "8",
    "已對保待撥金額": "920"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "900",
    "已准待撥件數": "6",
    "已准待撥": "780",
    "已准待對保件數": "6",
    "已准待對保金額": "780",
    "已對保待撥件數": "0",
    "已對保待撥金額": "0"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "6",
    "已進件待核准金額": "1820",
    "已准待撥件數": "2",
    "已准待撥": "150",
    "已准待對保件數": "2",
    "已准待對保金額": "150",
    "已對保待撥件數": "0",
    "已對保待撥金額": "0"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "350",
    "已准待撥件數": "11",
    "已准待撥": "1310",
    "已准待對保件數": "6",
    "已准待對保金額": "740",
    "已對保待撥件數": "4",
    "已對保待撥金額": "620"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "310",
    "已准待撥件數": "8",
    "已准待撥": "1080",
    "已准待對保件數": "5",
    "已准待對保金額": "640",
    "已對保待撥件數": "3",
    "已對保待撥金額": "440"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數": "0",
    "已對保待撥金額": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "5",
    "已進件待核准金額": "1030",
    "已准待撥件數": "1",
    "已准待撥": "130",
    "已准待對保件數": "1",
    "已准待對保金額": "130",
    "已對保待撥件數": "0",
    "已對保待撥金額": "0"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "9",
    "已准待撥": "1230",
    "已准待對保件數": "5",
    "已准待對保金額": "780",
    "已對保待撥件數": "4",
    "已對保待撥金額": "450"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "9",
    "已進件待核准金額": "2860",
    "已准待撥件數": "11",
    "已准待撥": "1350",
    "已准待對保件數": "8",
    "已准待對保金額": "1170",
    "已對保待撥件數": "3",
    "已對保待撥金額": "180"
  },
  {
    "經辦": "總和",
    "已進件待核准": "55",
    "已進件待核准金額": "13300",
    "已准待撥件數": "74",
    "已准待撥": "9200",
    "已准待對保件數": "46",
    "已准待對保金額": "6060",
    "已對保待撥件數": "27",
    "已對保待撥金額": "3190"
  }
];
const historyData = [
  {
    "timestamp": "2026-10-17T07:03:59.432Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-18T01:04:41.833Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-18T07:05:23.422Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-19T01:05:59.835Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-19T07:06:32.633Z",
    "A": 33,
    "A_amount": 4565,
    "B": 17,
    "B_amount": 2495
  },
  {
    "timestamp": "2026-10-20T01:07:07.029Z",
    "A": 33,
    "A_amount": 4465,
    "B": 17,
    "B_amount": 2555
  },
  {
    "timestamp": "2026-10-20T09:35:34.978Z",
    "A": 40,
    "A_amount": 5870,
    "B": 32,
    "B_amount": 4540
  },
  {
    "timestamp": "2026-10-20T09:36:37.652Z",
    "A": 40,
    "A_amount": 5870,
    "B": 32,
    "B_amount": 4540
  },
  {
    "timestamp": "2026-10-21T01:08:07.326Z",
    "A": 29,
    "A_amount": 3940,
    "B": 37,
    "B_amount": 5420
  },
  {
    "timestamp": "2026-10-21T07:08:12.170Z",
    "A": 34,
    "A_amount": 4740,
    "B": 29,
    "B_amount": 4390
  },
  {
    "timestamp": "2026-10-22T01:08:45.418Z",
    "A": 29,
    "A_amount": 4190,
    "B": 38,
    "B_amount": 5470
  },
  {
    "timestamp": "2026-10-22T07:09:16.391Z",
    "A": 32,
    "A_amount": 4870,
    "B": 26,
    "B_amount": 3550
  },
  {
    "timestamp": "2026-10-23T01:09:54.873Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-23T07:10:02.378Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-24T01:10:44.097Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-24T07:10:59.705Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-25T01:11:42.306Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-25T07:11:47.538Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-26T01:12:30.177Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-26T07:12:47.550Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-27T01:13:24.410Z",
    "A": 31,
    "A_amount": 4450,
    "B": 33,
    "B_amount": 4680
  },
  {
    "timestamp": "2026-10-27T07:13:29.678Z",
    "A": 31,
    "A_amount": 4330,
    "B": 31,
    "B_amount": 4140
  },
  {
    "timestamp": "2026-10-28T01:01:31.355Z",
    "A": 29,
    "A_amount": 4070,
    "B": 37,
    "B_amount": 5120
  },
  {
    "timestamp": "2026-10-28T07:01:37.234Z",
    "A": 33,
    "A_amount": 4810,
    "B": 32,
    "B_amount": 4370
  },
  {
    "timestamp": "2026-10-29T01:02:12.277Z",
    "A": 34,
    "A_amount": 4700,
    "B": 36,
    "B_amount": 5230
  },
  {
    "timestamp": "2026-10-29T07:02:18.133Z",
    "A": 33,
    "A_amount": 4370,
    "B": 38,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-10-30T01:00:56.368Z",
    "A": 37,
    "A_amount": 4620,
    "B": 45,
    "B_amount": 6170
  },
  {
    "timestamp": "2026-10-30T07:01:36.498Z",
    "A": 43,
    "A_amount": 5680,
    "B": 27,
    "B_amount": 3190
  },
  {
    "timestamp": "2026-10-31T01:02:01.017Z",
    "A": 46,
    "A_amount": 6060,
    "B": 27,
    "B_amount": 3190
  },
  {
    "timestamp": "2026-10-31T07:02:24.279Z",
    "A": 46,
    "A_amount": 6060,
    "B": 27,
    "B_amount": 3190
  }
];
