
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1490",
    "已准待撥件數": "14",
    "已准待撥": "1730",
    "已准待對保件數": "7",
    "已准待對保金額": "1000",
    "已對保待撥件數的SUM": "7",
    "已對保待撥金額的SUM": "730"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1490",
    "已准待撥件數": "5",
    "已准待撥": "800",
    "已准待對保件數": "2",
    "已准待對保金額": "340",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "460"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "13",
    "已准待撥": "1230",
    "已准待對保件數": "7",
    "已准待對保金額": "530",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "700"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "8",
    "已准待撥": "1330",
    "已准待對保件數": "3",
    "已准待對保金額": "630",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "700"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1010",
    "已准待撥件數": "7",
    "已准待撥": "1120",
    "已准待對保件數": "4",
    "已准待對保金額": "600",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "520"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "5",
    "已准待撥": "680",
    "已准待對保件數": "2",
    "已准待對保金額": "230",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "10",
    "已准待撥": "1360",
    "已准待對保件數": "5",
    "已准待對保金額": "710",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "7",
    "已准待撥": "950",
    "已准待對保件數": "4",
    "已准待對保金額": "450",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "4",
    "已進件待核准金額": "800",
    "已准待撥件數": "7",
    "已准待撥": "940",
    "已准待對保件數": "4",
    "已准待對保金額": "540",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1400",
    "已准待撥件數": "8",
    "已准待撥": "920",
    "已准待對保件數": "6",
    "已准待對保金額": "780",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "140"
  },
  {
    "經辦": "總和",
    "已進件待核准": "32",
    "已進件待核准金額": "7770",
    "已准待撥件數": "84",
    "已准待撥": "11060",
    "已准待對保件數": "44",
    "已准待對保金額": "5810",
    "已對保待撥件數的SUM": "40",
    "已對保待撥金額的SUM": "5250"
  }
];
const historyData = [
  {
    "timestamp": "2026-08-06T07:00:48.309Z",
    "A": 48,
    "A_amount": 7110,
    "B": 25,
    "B_amount": 3040
  },
  {
    "timestamp": "2026-08-07T01:00:57.742Z",
    "A": 47,
    "A_amount": 6810,
    "B": 25,
    "B_amount": 3040
  },
  {
    "timestamp": "2026-08-07T07:01:05.310Z",
    "A": 44,
    "A_amount": 6370,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-08T01:01:54.376Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-08T07:02:40.296Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-09T01:03:28.949Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-09T07:03:46.354Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-10T01:04:23.251Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-10T07:04:28.642Z",
    "A": 48,
    "A_amount": 7250,
    "B": 22,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-11T01:05:08.620Z",
    "A": 50,
    "A_amount": 7430,
    "B": 22,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-11T07:05:13.800Z",
    "A": 52,
    "A_amount": 7310,
    "B": 17,
    "B_amount": 2390
  },
  {
    "timestamp": "2026-08-12T01:05:57.181Z",
    "A": 51,
    "A_amount": 7120,
    "B": 17,
    "B_amount": 2390
  },
  {
    "timestamp": "2026-08-12T07:06:03.060Z",
    "A": 35,
    "A_amount": 4410,
    "B": 16,
    "B_amount": 2400
  },
  {
    "timestamp": "2026-08-13T01:06:51.050Z",
    "A": 38,
    "A_amount": 4890,
    "B": 18,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-13T07:00:32.209Z",
    "A": 37,
    "A_amount": 4600,
    "B": 18,
    "B_amount": 2500
  },
  {
    "timestamp": "2026-08-14T01:01:06.236Z",
    "A": 44,
    "A_amount": 5450,
    "B": 19,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-14T07:01:41.332Z",
    "A": 49,
    "A_amount": 6070,
    "B": 15,
    "B_amount": 1930
  },
  {
    "timestamp": "2026-08-15T01:02:17.053Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-15T07:03:01.926Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-16T01:03:49.194Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-16T07:04:23.157Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-17T01:04:58.039Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-20T01:04:46.655Z",
    "A": 56,
    "A_amount": 7240,
    "B": 18,
    "B_amount": 2160
  },
  {
    "timestamp": "2026-08-20T07:33:44.020Z",
    "A": 52,
    "A_amount": 6900,
    "B": 21,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-08-21T01:04:24.430Z",
    "A": 55,
    "A_amount": 7620,
    "B": 21,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-08-21T07:00:34.789Z",
    "A": 50,
    "A_amount": 6450,
    "B": 29,
    "B_amount": 3950
  },
  {
    "timestamp": "2026-08-22T01:01:21.819Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-08-22T07:02:06.771Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-08-23T01:02:42.805Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-08-23T07:03:26.485Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  }
];
