
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "10",
    "已進件待核准金額": "2160",
    "已准待撥件數": "7",
    "已准待撥": "900",
    "已准待對保件數": "4",
    "已准待對保金額": "370",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "530"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "7",
    "已進件待核准金額": "1510",
    "已准待撥件數": "4",
    "已准待撥": "550",
    "已准待對保件數": "3",
    "已准待對保金額": "400",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "5",
    "已准待撥": "850",
    "已准待對保件數": "2",
    "已准待對保金額": "520",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "14",
    "已准待撥": "2230",
    "已准待對保件數": "8",
    "已准待對保金額": "1470",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "760"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1750",
    "已准待撥件數": "3",
    "已准待撥": "380",
    "已准待對保件數": "1",
    "已准待對保金額": "100",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "280"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "5",
    "已准待撥": "500",
    "已准待對保件數": "2",
    "已准待對保金額": "120",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "3",
    "已進件待核准金額": "930",
    "已准待撥件數": "4",
    "已准待撥": "670",
    "已准待對保件數": "4",
    "已准待對保金額": "670",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "6",
    "已准待撥": "650",
    "已准待對保件數": "4",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "400",
    "已准待撥件數": "5",
    "已准待撥": "750",
    "已准待對保件數": "4",
    "已准待對保金額": "450",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1200",
    "已准待撥件數": "6",
    "已准待撥": "550",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "550"
  },
  {
    "經辦": "總和",
    "已進件待核准": "36",
    "已進件待核准金額": "9300",
    "已准待撥件數": "59",
    "已准待撥": "8030",
    "已准待對保件數": "32",
    "已准待對保金額": "4600",
    "已對保待撥件數的SUM": "27",
    "已對保待撥金額的SUM": "3430"
  }
];
const historyData = [
  {
    "timestamp": "2026-08-28T01:09:01.651Z",
    "A": 25,
    "A_amount": 3810,
    "B": 31,
    "B_amount": 4480
  },
  {
    "timestamp": "2026-08-28T07:00:44.869Z",
    "A": 25,
    "A_amount": 3840,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-29T01:02:05.838Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-29T07:02:55.537Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-30T01:03:43.594Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-30T07:04:20.940Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-31T01:04:55.875Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-31T07:05:31.019Z",
    "A": 25,
    "A_amount": 4280,
    "B": 13,
    "B_amount": 2140
  },
  {
    "timestamp": "2026-09-01T01:06:10.977Z",
    "A": 27,
    "A_amount": 4410,
    "B": 13,
    "B_amount": 2140
  },
  {
    "timestamp": "2026-09-01T07:06:47.569Z",
    "A": 28,
    "A_amount": 4390,
    "B": 17,
    "B_amount": 2560
  },
  {
    "timestamp": "2026-09-02T01:07:29.331Z",
    "A": 28,
    "A_amount": 4570,
    "B": 20,
    "B_amount": 3060
  },
  {
    "timestamp": "2026-09-02T07:08:05.649Z",
    "A": 32,
    "A_amount": 5270,
    "B": 20,
    "B_amount": 3010
  },
  {
    "timestamp": "2026-09-03T01:08:37.492Z",
    "A": 28,
    "A_amount": 4570,
    "B": 28,
    "B_amount": 4140
  },
  {
    "timestamp": "2026-09-03T07:09:10.461Z",
    "A": 32,
    "A_amount": 5170,
    "B": 23,
    "B_amount": 3650
  },
  {
    "timestamp": "2026-09-04T01:09:40.441Z",
    "A": 32,
    "A_amount": 5450,
    "B": 28,
    "B_amount": 4200
  },
  {
    "timestamp": "2026-09-04T07:10:10.236Z",
    "A": 33,
    "A_amount": 5580,
    "B": 21,
    "B_amount": 3160
  },
  {
    "timestamp": "2026-09-05T01:10:49.316Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-05T07:11:29.245Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-06T01:11:58.737Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-06T07:12:36.819Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-07T01:13:07.172Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-07T07:13:40.564Z",
    "A": 37,
    "A_amount": 6310,
    "B": 19,
    "B_amount": 2370
  },
  {
    "timestamp": "2026-09-08T01:14:13.619Z",
    "A": 36,
    "A_amount": 6000,
    "B": 23,
    "B_amount": 3070
  },
  {
    "timestamp": "2026-09-08T07:14:42.624Z",
    "A": 37,
    "A_amount": 5790,
    "B": 25,
    "B_amount": 3350
  },
  {
    "timestamp": "2026-09-09T01:15:15.387Z",
    "A": 37,
    "A_amount": 5910,
    "B": 28,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-09-09T07:02:45.319Z",
    "A": 40,
    "A_amount": 6230,
    "B": 23,
    "B_amount": 3060
  },
  {
    "timestamp": "2026-09-10T01:03:54.764Z",
    "A": 36,
    "A_amount": 6140,
    "B": 28,
    "B_amount": 3490
  },
  {
    "timestamp": "2026-09-10T07:04:28.723Z",
    "A": 23,
    "A_amount": 3410,
    "B": 28,
    "B_amount": 3540
  },
  {
    "timestamp": "2026-09-11T01:00:27.863Z",
    "A": 25,
    "A_amount": 3640,
    "B": 33,
    "B_amount": 4320
  },
  {
    "timestamp": "2026-09-11T07:00:54.826Z",
    "A": 32,
    "A_amount": 4600,
    "B": 27,
    "B_amount": 3430
  }
];
