
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "17",
    "已進件待核准金額": "3740",
    "已准待撥件數": "6",
    "已准待撥": "630",
    "已准待對保件數": "4",
    "已准待對保金額": "490",
    "已對保待撥件數": "2",
    "已對保待撥金額": "140"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1390",
    "已准待撥件數": "11",
    "已准待撥": "1660",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數": "8",
    "已對保待撥金額": "1160"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "10",
    "已准待撥": "1260",
    "已准待對保件數": "2",
    "已准待對保金額": "400",
    "已對保待撥件數": "8",
    "已對保待撥金額": "860"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "900",
    "已准待撥件數": "3",
    "已准待撥": "380",
    "已准待對保件數": "1",
    "已准待對保金額": "100",
    "已對保待撥件數": "2",
    "已對保待撥金額": "280"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "6",
    "已進件待核准金額": "2150",
    "已准待撥件數": "4",
    "已准待撥": "580",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數": "4",
    "已對保待撥金額": "580"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "8",
    "已准待撥": "1530",
    "已准待對保件數": "6",
    "已准待對保金額": "1000",
    "已對保待撥件數": "2",
    "已對保待撥金額": "530"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "3",
    "已進件待核准金額": "810",
    "已准待撥件數": "5",
    "已准待撥": "570",
    "已准待對保件數": "3",
    "已准待對保金額": "320",
    "已對保待撥件數": "2",
    "已對保待撥金額": "250"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數": "0",
    "已對保待撥金額": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "5",
    "已進件待核准金額": "900",
    "已准待撥件數": "5",
    "已准待撥": "610",
    "已准待對保件數": "3",
    "已准待對保金額": "310",
    "已對保待撥件數": "2",
    "已對保待撥金額": "300"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "5",
    "已准待撥": "610",
    "已准待對保件數": "2",
    "已准待對保金額": "260",
    "已對保待撥件數": "3",
    "已對保待撥金額": "350"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1310",
    "已准待撥件數": "10",
    "已准待撥": "1830",
    "已准待對保件數": "5",
    "已准待對保金額": "810",
    "已對保待撥件數": "5",
    "已對保待撥金額": "1020"
  },
  {
    "經辦": "總和",
    "已進件待核准": "47",
    "已進件待核准金額": "11900",
    "已准待撥件數": "67",
    "已准待撥": "9660",
    "已准待對保件數": "29",
    "已准待對保金額": "4190",
    "已對保待撥件數": "38",
    "已對保待撥金額": "5470"
  }
];
const historyData = [
  {
    "timestamp": "2026-10-07T07:05:27.278Z",
    "A": 44,
    "A_amount": 6080,
    "B": 22,
    "B_amount": 2840
  },
  {
    "timestamp": "2026-10-08T01:05:58.318Z",
    "A": 36,
    "A_amount": 4690,
    "B": 31,
    "B_amount": 4080
  },
  {
    "timestamp": "2026-10-08T07:06:28.249Z",
    "A": 41,
    "A_amount": 5680,
    "B": 29,
    "B_amount": 3970
  },
  {
    "timestamp": "2026-10-09T01:07:08.071Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-09T07:07:47.858Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-10T01:08:15.231Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-10T07:08:43.751Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-11T01:09:22.972Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-11T07:02:06.421Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-12T01:02:35.533Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-12T07:03:05.742Z",
    "A": 42,
    "A_amount": 5830,
    "B": 27,
    "B_amount": 3720
  },
  {
    "timestamp": "2026-10-13T01:03:35.852Z",
    "A": 35,
    "A_amount": 4970,
    "B": 36,
    "B_amount": 4740
  },
  {
    "timestamp": "2026-10-13T07:03:40.686Z",
    "A": 41,
    "A_amount": 5830,
    "B": 31,
    "B_amount": 3990
  },
  {
    "timestamp": "2026-10-14T01:04:09.686Z",
    "A": 43,
    "A_amount": 6350,
    "B": 36,
    "B_amount": 4380
  },
  {
    "timestamp": "2026-10-15T01:01:05.455Z",
    "A": 39,
    "A_amount": 5690,
    "B": 37,
    "B_amount": 4635
  },
  {
    "timestamp": "2026-10-15T07:01:37.717Z",
    "A": 36,
    "A_amount": 5240,
    "B": 29,
    "B_amount": 3625
  },
  {
    "timestamp": "2026-10-16T01:02:07.159Z",
    "A": 35,
    "A_amount": 5040,
    "B": 30,
    "B_amount": 3825
  },
  {
    "timestamp": "2026-10-16T07:02:36.560Z",
    "A": 36,
    "A_amount": 5120,
    "B": 18,
    "B_amount": 2335
  },
  {
    "timestamp": "2026-10-17T01:03:18.569Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-17T07:03:59.432Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-18T01:04:41.833Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-18T07:05:23.422Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-19T01:05:59.835Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-19T07:06:32.633Z",
    "A": 33,
    "A_amount": 4565,
    "B": 17,
    "B_amount": 2495
  },
  {
    "timestamp": "2026-10-20T01:07:07.029Z",
    "A": 33,
    "A_amount": 4465,
    "B": 17,
    "B_amount": 2555
  },
  {
    "timestamp": "2026-10-20T09:35:34.978Z",
    "A": 40,
    "A_amount": 5870,
    "B": 32,
    "B_amount": 4540
  },
  {
    "timestamp": "2026-10-20T09:36:37.652Z",
    "A": 40,
    "A_amount": 5870,
    "B": 32,
    "B_amount": 4540
  },
  {
    "timestamp": "2026-10-21T01:08:07.326Z",
    "A": 29,
    "A_amount": 3940,
    "B": 37,
    "B_amount": 5420
  },
  {
    "timestamp": "2026-10-21T07:08:12.170Z",
    "A": 34,
    "A_amount": 4740,
    "B": 29,
    "B_amount": 4390
  },
  {
    "timestamp": "2026-10-22T01:08:45.418Z",
    "A": 29,
    "A_amount": 4190,
    "B": 38,
    "B_amount": 5470
  }
];
