
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "8",
    "已進件待核准金額": "1540",
    "已准待撥件數": "11",
    "已准待撥": "1700",
    "已准待對保件數": "9",
    "已准待對保金額": "1430",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "270"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "7",
    "已進件待核准金額": "1550",
    "已准待撥件數": "5",
    "已准待撥": "710",
    "已准待對保件數": "2",
    "已准待對保金額": "340",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "370"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "130",
    "已准待撥件數": "9",
    "已准待撥": "1120",
    "已准待對保件數": "6",
    "已准待對保金額": "670",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "5",
    "已准待撥": "850",
    "已准待對保件數": "5",
    "已准待對保金額": "850",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "750",
    "已准待撥件數": "7",
    "已准待撥": "900",
    "已准待對保件數": "6",
    "已准待對保金額": "830",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "70"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "4",
    "已准待撥": "480",
    "已准待對保件數": "2",
    "已准待對保金額": "230",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "3",
    "已進件待核准金額": "660",
    "已准待撥件數": "7",
    "已准待撥": "1160",
    "已准待對保件數": "7",
    "已准待對保金額": "1160",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "7",
    "已准待撥": "880",
    "已准待對保件數": "5",
    "已准待對保金額": "480",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "550",
    "已准待撥件數": "6",
    "已准待撥": "880",
    "已准待對保件數": "3",
    "已准待對保金額": "420",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "460"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1230",
    "已准待撥件數": "8",
    "已准待撥": "1020",
    "已准待對保件數": "7",
    "已准待對保金額": "900",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "120"
  },
  {
    "經辦": "總和",
    "已進件待核准": "33",
    "已進件待核准金額": "7660",
    "已准待撥件數": "69",
    "已准待撥": "9700",
    "已准待對保件數": "52",
    "已准待對保金額": "7310",
    "已對保待撥件數的SUM": "17",
    "已對保待撥金額的SUM": "2390"
  }
];
const historyData = [
  {
    "timestamp": "2026-07-27T01:05:36.535Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-27T07:05:42.336Z",
    "A": 54,
    "A_amount": 7870,
    "B": 26,
    "B_amount": 3620
  },
  {
    "timestamp": "2026-07-28T01:05:49.604Z",
    "A": 57,
    "A_amount": 8390,
    "B": 33,
    "B_amount": 4600
  },
  {
    "timestamp": "2026-07-28T07:05:55.402Z",
    "A": 61,
    "A_amount": 8610,
    "B": 35,
    "B_amount": 5120
  },
  {
    "timestamp": "2026-07-29T01:06:06.524Z",
    "A": 33,
    "A_amount": 5260,
    "B": 39,
    "B_amount": 5540
  },
  {
    "timestamp": "2026-07-30T07:03:40.227Z",
    "A": 43,
    "A_amount": 6420,
    "B": 30,
    "B_amount": 4290
  },
  {
    "timestamp": "2026-07-31T01:03:48.538Z",
    "A": 49,
    "A_amount": 6930,
    "B": 30,
    "B_amount": 4290
  },
  {
    "timestamp": "2026-07-31T07:03:55.137Z",
    "A": 45,
    "A_amount": 6750,
    "B": 21,
    "B_amount": 2605
  },
  {
    "timestamp": "2026-08-01T01:04:13.801Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-01T07:04:32.401Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-02T01:04:51.170Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-02T07:05:11.391Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-03T01:05:19.433Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-03T07:01:42.298Z",
    "A": 45,
    "A_amount": 6780,
    "B": 23,
    "B_amount": 2945
  },
  {
    "timestamp": "2026-08-04T01:00:05.712Z",
    "A": 44,
    "A_amount": 6390,
    "B": 31,
    "B_amount": 4065
  },
  {
    "timestamp": "2026-08-04T07:00:15.862Z",
    "A": 43,
    "A_amount": 6410,
    "B": 29,
    "B_amount": 3830
  },
  {
    "timestamp": "2026-08-05T01:00:23.014Z",
    "A": 40,
    "A_amount": 6220,
    "B": 36,
    "B_amount": 4630
  },
  {
    "timestamp": "2026-08-05T07:00:30.751Z",
    "A": 42,
    "A_amount": 6600,
    "B": 31,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-08-06T01:00:38.848Z",
    "A": 47,
    "A_amount": 6960,
    "B": 31,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-08-06T07:00:48.309Z",
    "A": 48,
    "A_amount": 7110,
    "B": 25,
    "B_amount": 3040
  },
  {
    "timestamp": "2026-08-07T01:00:57.742Z",
    "A": 47,
    "A_amount": 6810,
    "B": 25,
    "B_amount": 3040
  },
  {
    "timestamp": "2026-08-07T07:01:05.310Z",
    "A": 44,
    "A_amount": 6370,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-08T01:01:54.376Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-08T07:02:40.296Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-09T01:03:28.949Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-09T07:03:46.354Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-10T01:04:23.251Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-10T07:04:28.642Z",
    "A": 48,
    "A_amount": 7250,
    "B": 22,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-11T01:05:08.620Z",
    "A": 50,
    "A_amount": 7430,
    "B": 22,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-11T07:05:13.800Z",
    "A": 52,
    "A_amount": 7310,
    "B": 17,
    "B_amount": 2390
  }
];
