
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1180",
    "已准待撥件數": "3",
    "已准待撥": "470",
    "已准待對保件數": "3",
    "已准待對保金額": "470",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1150",
    "已准待撥件數": "16",
    "已准待撥": "2260",
    "已准待對保件數": "12",
    "已准待對保金額": "1420",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "840"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "420",
    "已准待撥件數": "4",
    "已准待撥": "430",
    "已准待對保件數": "2",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "130"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "6",
    "已准待撥": "780",
    "已准待對保件數": "5",
    "已准待對保金額": "600",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "180"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "3",
    "已進件待核准金額": "500",
    "已准待撥件數": "10",
    "已准待撥": "1160",
    "已准待對保件數": "6",
    "已准待對保金額": "630",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "530"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "5",
    "已准待撥": "860",
    "已准待對保件數": "4",
    "已准待對保金額": "660",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "8",
    "已准待撥": "1350",
    "已准待對保件數": "5",
    "已准待對保金額": "890",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "460"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "1050",
    "已准待撥件數": "8",
    "已准待撥": "1140",
    "已准待對保件數": "6",
    "已准待對保金額": "990",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "6",
    "已准待撥": "540",
    "已准待對保件數": "2",
    "已准待對保金額": "180",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "360"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1050",
    "已准待撥件數": "12",
    "已准待撥": "1260",
    "已准待對保件數": "7",
    "已准待對保金額": "710",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "550"
  },
  {
    "經辦": "總和",
    "已進件待核准": "28",
    "已進件待核准金額": "6180",
    "已准待撥件數": "78",
    "已准待撥": "10250",
    "已准待對保件數": "52",
    "已准待對保金額": "6850",
    "已對保待撥件數的SUM": "26",
    "已對保待撥金額的SUM": "3400"
  }
];
const historyData = [
  {
    "timestamp": "2026-03-16T01:02:23.407Z",
    "A": 43,
    "A_amount": 6300,
    "B": 38,
    "B_amount": 5275
  },
  {
    "timestamp": "2026-03-16T07:02:28.318Z",
    "A": 40,
    "A_amount": 6140,
    "B": 35,
    "B_amount": 4425
  },
  {
    "timestamp": "2026-03-17T01:02:33.429Z",
    "A": 39,
    "A_amount": 5990,
    "B": 40,
    "B_amount": 4955
  },
  {
    "timestamp": "2026-03-17T07:02:38.680Z",
    "A": 45,
    "A_amount": 6770,
    "B": 35,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-03-18T01:03:31.874Z",
    "A": 48,
    "A_amount": 7270,
    "B": 38,
    "B_amount": 4410
  },
  {
    "timestamp": "2026-03-19T07:11:01.086Z",
    "A": 47,
    "A_amount": 7310,
    "B": 34,
    "B_amount": 4170
  },
  {
    "timestamp": "2026-03-20T07:04:50.936Z",
    "A": 57,
    "A_amount": 8560,
    "B": 30,
    "B_amount": 3880
  },
  {
    "timestamp": "2026-03-23T01:01:47.111Z",
    "A": 54,
    "A_amount": 8070,
    "B": 38,
    "B_amount": 5220
  },
  {
    "timestamp": "2026-03-23T07:01:53.709Z",
    "A": 36,
    "A_amount": 5390,
    "B": 41,
    "B_amount": 5760
  },
  {
    "timestamp": "2026-03-24T01:01:58.668Z",
    "A": 39,
    "A_amount": 5830,
    "B": 43,
    "B_amount": 6140
  },
  {
    "timestamp": "2026-03-24T07:02:04.452Z",
    "A": 39,
    "A_amount": 5850,
    "B": 36,
    "B_amount": 5460
  },
  {
    "timestamp": "2026-03-25T01:02:09.742Z",
    "A": 35,
    "A_amount": 5190,
    "B": 41,
    "B_amount": 6220
  },
  {
    "timestamp": "2026-03-25T07:02:16.791Z",
    "A": 42,
    "A_amount": 5970,
    "B": 32,
    "B_amount": 4920
  },
  {
    "timestamp": "2026-03-26T01:02:22.547Z",
    "A": 43,
    "A_amount": 5690,
    "B": 35,
    "B_amount": 5530
  },
  {
    "timestamp": "2026-03-26T07:02:29.168Z",
    "A": 49,
    "A_amount": 5930,
    "B": 28,
    "B_amount": 4320
  },
  {
    "timestamp": "2026-03-27T01:02:34.661Z",
    "A": 49,
    "A_amount": 6100,
    "B": 33,
    "B_amount": 4750
  },
  {
    "timestamp": "2026-03-27T07:02:41.362Z",
    "A": 51,
    "A_amount": 6300,
    "B": 27,
    "B_amount": 3660
  },
  {
    "timestamp": "2026-03-28T01:02:57.726Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-28T07:03:15.932Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-29T01:03:33.290Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-29T07:03:38.175Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-30T01:03:43.789Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-30T07:03:50.906Z",
    "A": 58,
    "A_amount": 7510,
    "B": 25,
    "B_amount": 2965
  },
  {
    "timestamp": "2026-03-31T01:03:57.295Z",
    "A": 56,
    "A_amount": 7420,
    "B": 31,
    "B_amount": 3785
  },
  {
    "timestamp": "2026-03-31T07:04:02.703Z",
    "A": 66,
    "A_amount": 8850,
    "B": 16,
    "B_amount": 1705
  },
  {
    "timestamp": "2026-04-01T07:00:27.528Z",
    "A": 49,
    "A_amount": 7200,
    "B": 22,
    "B_amount": 2655
  },
  {
    "timestamp": "2026-04-02T01:00:33.203Z",
    "A": 46,
    "A_amount": 6670,
    "B": 28,
    "B_amount": 3825
  },
  {
    "timestamp": "2026-04-02T07:00:38.406Z",
    "A": 47,
    "A_amount": 6660,
    "B": 25,
    "B_amount": 3990
  },
  {
    "timestamp": "2026-04-07T01:08:48.932Z",
    "A": 46,
    "A_amount": 6420,
    "B": 31,
    "B_amount": 5080
  },
  {
    "timestamp": "2026-04-13T04:07:43.193Z",
    "A": 52,
    "A_amount": 6850,
    "B": 26,
    "B_amount": 3400
  }
];
