
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "13",
    "已進件待核准金額": "2970",
    "已准待撥件數": "8",
    "已准待撥": "1440",
    "已准待對保件數": "4",
    "已准待對保金額": "850",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "590"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1490",
    "已准待撥件數": "6",
    "已准待撥": "720",
    "已准待對保件數": "4",
    "已准待對保金額": "550",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "170"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "4",
    "已准待撥": "680",
    "已准待對保件數": "4",
    "已准待對保金額": "680",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "900",
    "已准待撥件數": "5",
    "已准待撥": "890",
    "已准待對保件數": "1",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "690"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1250",
    "已准待撥件數": "3",
    "已准待撥": "320",
    "已准待對保件數": "2",
    "已准待對保金額": "170",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "6",
    "已准待撥": "960",
    "已准待對保件數": "2",
    "已准待對保金額": "110",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "850"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "6",
    "已准待撥": "1100",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "600"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "4",
    "已准待撥": "500",
    "已准待對保件數": "4",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "500",
    "已准待撥件數": "7",
    "已准待撥": "1580",
    "已准待對保件數": "6",
    "已准待對保金額": "1430",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1650",
    "已准待撥件數": "6",
    "已准待撥": "630",
    "已准待對保件數": "2",
    "已准待對保金額": "180",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "總和",
    "已進件待核准": "38",
    "已進件待核准金額": "9740",
    "已准待撥件數": "55",
    "已准待撥": "8820",
    "已准待對保件數": "32",
    "已准待對保金額": "5170",
    "已對保待撥件數的SUM": "23",
    "已對保待撥金額的SUM": "3650"
  }
];
const historyData = [
  {
    "timestamp": "2026-08-20T01:04:46.655Z",
    "A": 56,
    "A_amount": 7240,
    "B": 18,
    "B_amount": 2160
  },
  {
    "timestamp": "2026-08-20T07:33:44.020Z",
    "A": 52,
    "A_amount": 6900,
    "B": 21,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-08-21T01:04:24.430Z",
    "A": 55,
    "A_amount": 7620,
    "B": 21,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-08-21T07:00:34.789Z",
    "A": 50,
    "A_amount": 6450,
    "B": 29,
    "B_amount": 3950
  },
  {
    "timestamp": "2026-08-22T01:01:21.819Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-08-22T07:02:06.771Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-08-23T01:02:42.805Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-08-23T07:03:26.485Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-08-24T01:04:00.606Z",
    "A": 44,
    "A_amount": 5810,
    "B": 40,
    "B_amount": 5250
  },
  {
    "timestamp": "2026-08-24T07:04:38.930Z",
    "A": 47,
    "A_amount": 5960,
    "B": 34,
    "B_amount": 4800
  },
  {
    "timestamp": "2026-08-25T01:05:17.687Z",
    "A": 52,
    "A_amount": 6240,
    "B": 34,
    "B_amount": 4800
  },
  {
    "timestamp": "2026-08-25T07:05:51.677Z",
    "A": 59,
    "A_amount": 7240,
    "B": 25,
    "B_amount": 3630
  },
  {
    "timestamp": "2026-08-26T01:06:25.994Z",
    "A": 25,
    "A_amount": 3370,
    "B": 32,
    "B_amount": 4200
  },
  {
    "timestamp": "2026-08-26T07:07:03.439Z",
    "A": 24,
    "A_amount": 3310,
    "B": 27,
    "B_amount": 3490
  },
  {
    "timestamp": "2026-08-27T01:07:43.242Z",
    "A": 14,
    "A_amount": 2180,
    "B": 40,
    "B_amount": 5420
  },
  {
    "timestamp": "2026-08-27T07:08:22.565Z",
    "A": 20,
    "A_amount": 3080,
    "B": 32,
    "B_amount": 4540
  },
  {
    "timestamp": "2026-08-28T01:09:01.651Z",
    "A": 25,
    "A_amount": 3810,
    "B": 31,
    "B_amount": 4480
  },
  {
    "timestamp": "2026-08-28T07:00:44.869Z",
    "A": 25,
    "A_amount": 3840,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-29T01:02:05.838Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-29T07:02:55.537Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-30T01:03:43.594Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-30T07:04:20.940Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-31T01:04:55.875Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-31T07:05:31.019Z",
    "A": 25,
    "A_amount": 4280,
    "B": 13,
    "B_amount": 2140
  },
  {
    "timestamp": "2026-09-01T01:06:10.977Z",
    "A": 27,
    "A_amount": 4410,
    "B": 13,
    "B_amount": 2140
  },
  {
    "timestamp": "2026-09-01T07:06:47.569Z",
    "A": 28,
    "A_amount": 4390,
    "B": 17,
    "B_amount": 2560
  },
  {
    "timestamp": "2026-09-02T01:07:29.331Z",
    "A": 28,
    "A_amount": 4570,
    "B": 20,
    "B_amount": 3060
  },
  {
    "timestamp": "2026-09-02T07:08:05.649Z",
    "A": 32,
    "A_amount": 5270,
    "B": 20,
    "B_amount": 3010
  },
  {
    "timestamp": "2026-09-03T01:08:37.492Z",
    "A": 28,
    "A_amount": 4570,
    "B": 28,
    "B_amount": 4140
  },
  {
    "timestamp": "2026-09-03T07:09:10.461Z",
    "A": 32,
    "A_amount": 5170,
    "B": 23,
    "B_amount": 3650
  }
];
