
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "5",
    "已進件待核准金額": "970",
    "已准待撥件數": "9",
    "已准待撥": "1340",
    "已准待對保件數": "3",
    "已准待對保金額": "480",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "860"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "4",
    "已進件待核准金額": "900",
    "已准待撥件數": "8",
    "已准待撥": "890",
    "已准待對保件數": "4",
    "已准待對保金額": "360",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "530"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "280",
    "已准待撥件數": "9",
    "已准待撥": "1020",
    "已准待對保件數": "2",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "7",
    "已對保待撥金額的SUM": "720"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "450",
    "已准待撥件數": "6",
    "已准待撥": "730",
    "已准待對保件數": "3",
    "已准待對保金額": "280",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "11",
    "已准待撥": "1220",
    "已准待對保件數": "8",
    "已准待對保金額": "750",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "470"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "5",
    "已准待撥": "890",
    "已准待對保件數": "3",
    "已准待對保金額": "560",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "8",
    "已准待撥": "1320",
    "已准待對保件數": "6",
    "已准待對保金額": "820",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "80",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "80"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "1050",
    "已准待撥件數": "7",
    "已准待撥": "1000",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "7",
    "已對保待撥金額的SUM": "1000"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "4",
    "已進件待核准金額": "800",
    "已准待撥件數": "5",
    "已准待撥": "440",
    "已准待對保件數": "3",
    "已准待對保金額": "280",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "160"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "2",
    "已進件待核准金額": "900",
    "已准待撥件數": "10",
    "已准待撥": "1250",
    "已准待對保件數": "7",
    "已准待對保金額": "950",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "總和",
    "已進件待核准": "24",
    "已進件待核准金額": "5580",
    "已准待撥件數": "79",
    "已准待撥": "10180",
    "已准待對保件數": "39",
    "已准待對保金額": "4780",
    "已對保待撥件數的SUM": "40",
    "已對保待撥金額的SUM": "5400"
  }
];
const historyData = [
  {
    "timestamp": "2026-03-23T07:01:53.709Z",
    "A": 36,
    "A_amount": 5390,
    "B": 41,
    "B_amount": 5760
  },
  {
    "timestamp": "2026-03-24T01:01:58.668Z",
    "A": 39,
    "A_amount": 5830,
    "B": 43,
    "B_amount": 6140
  },
  {
    "timestamp": "2026-03-24T07:02:04.452Z",
    "A": 39,
    "A_amount": 5850,
    "B": 36,
    "B_amount": 5460
  },
  {
    "timestamp": "2026-03-25T01:02:09.742Z",
    "A": 35,
    "A_amount": 5190,
    "B": 41,
    "B_amount": 6220
  },
  {
    "timestamp": "2026-03-25T07:02:16.791Z",
    "A": 42,
    "A_amount": 5970,
    "B": 32,
    "B_amount": 4920
  },
  {
    "timestamp": "2026-03-26T01:02:22.547Z",
    "A": 43,
    "A_amount": 5690,
    "B": 35,
    "B_amount": 5530
  },
  {
    "timestamp": "2026-03-26T07:02:29.168Z",
    "A": 49,
    "A_amount": 5930,
    "B": 28,
    "B_amount": 4320
  },
  {
    "timestamp": "2026-03-27T01:02:34.661Z",
    "A": 49,
    "A_amount": 6100,
    "B": 33,
    "B_amount": 4750
  },
  {
    "timestamp": "2026-03-27T07:02:41.362Z",
    "A": 51,
    "A_amount": 6300,
    "B": 27,
    "B_amount": 3660
  },
  {
    "timestamp": "2026-03-28T01:02:57.726Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-28T07:03:15.932Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-29T01:03:33.290Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-29T07:03:38.175Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-30T01:03:43.789Z",
    "A": 52,
    "A_amount": 6430,
    "B": 29,
    "B_amount": 3795
  },
  {
    "timestamp": "2026-03-30T07:03:50.906Z",
    "A": 58,
    "A_amount": 7510,
    "B": 25,
    "B_amount": 2965
  },
  {
    "timestamp": "2026-03-31T01:03:57.295Z",
    "A": 56,
    "A_amount": 7420,
    "B": 31,
    "B_amount": 3785
  },
  {
    "timestamp": "2026-03-31T07:04:02.703Z",
    "A": 66,
    "A_amount": 8850,
    "B": 16,
    "B_amount": 1705
  },
  {
    "timestamp": "2026-04-01T07:00:27.528Z",
    "A": 49,
    "A_amount": 7200,
    "B": 22,
    "B_amount": 2655
  },
  {
    "timestamp": "2026-04-02T01:00:33.203Z",
    "A": 46,
    "A_amount": 6670,
    "B": 28,
    "B_amount": 3825
  },
  {
    "timestamp": "2026-04-02T07:00:38.406Z",
    "A": 47,
    "A_amount": 6660,
    "B": 25,
    "B_amount": 3990
  },
  {
    "timestamp": "2026-04-07T01:08:48.932Z",
    "A": 46,
    "A_amount": 6420,
    "B": 31,
    "B_amount": 5080
  },
  {
    "timestamp": "2026-04-13T04:07:43.193Z",
    "A": 52,
    "A_amount": 6850,
    "B": 26,
    "B_amount": 3400
  },
  {
    "timestamp": "2026-04-13T04:09:38.669Z",
    "A": 52,
    "A_amount": 6850,
    "B": 26,
    "B_amount": 3400
  },
  {
    "timestamp": "2026-04-13T07:03:13.444Z",
    "A": 53,
    "A_amount": 7170,
    "B": 27,
    "B_amount": 3470
  },
  {
    "timestamp": "2026-04-14T01:03:18.910Z",
    "A": 57,
    "A_amount": 7650,
    "B": 30,
    "B_amount": 3900
  },
  {
    "timestamp": "2026-04-14T07:02:08.874Z",
    "A": 59,
    "A_amount": 7860,
    "B": 31,
    "B_amount": 3555
  },
  {
    "timestamp": "2026-04-15T09:15:53.645Z",
    "A": 44,
    "A_amount": 5350,
    "B": 37,
    "B_amount": 4615
  },
  {
    "timestamp": "2026-04-15T09:16:22.483Z",
    "A": 44,
    "A_amount": 5350,
    "B": 37,
    "B_amount": 4615
  },
  {
    "timestamp": "2026-04-16T03:10:17.898Z",
    "A": 42,
    "A_amount": 5250,
    "B": 39,
    "B_amount": 4935
  },
  {
    "timestamp": "2026-04-17T02:00:39.437Z",
    "A": 39,
    "A_amount": 4780,
    "B": 40,
    "B_amount": 5400
  }
];
