
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "17",
    "已進件待核准金額": "3650",
    "已准待撥件數": "7",
    "已准待撥": "880",
    "已准待對保件數": "4",
    "已准待對保金額": "660",
    "已對保待撥件數": "3",
    "已對保待撥金額": "220"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1390",
    "已准待撥件數": "7",
    "已准待撥": "1120",
    "已准待對保件數": "2",
    "已准待對保金額": "270",
    "已對保待撥件數": "5",
    "已對保待撥金額": "850"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "10",
    "已准待撥": "1210",
    "已准待對保件數": "4",
    "已准待對保金額": "570",
    "已對保待撥件數": "6",
    "已對保待撥金額": "640"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "3",
    "已准待撥": "380",
    "已准待對保件數": "1",
    "已准待對保金額": "100",
    "已對保待撥件數": "2",
    "已對保待撥金額": "280"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1550",
    "已准待撥件數": "3",
    "已准待撥": "380",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數": "3",
    "已對保待撥金額": "380"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "8",
    "已准待撥": "1300",
    "已准待對保件數": "6",
    "已准待對保金額": "850",
    "已對保待撥件數": "2",
    "已對保待撥金額": "450"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "3",
    "已進件待核准金額": "810",
    "已准待撥件數": "7",
    "已准待撥": "930",
    "已准待對保件數": "4",
    "已准待對保金額": "560",
    "已對保待撥件數": "3",
    "已對保待撥金額": "370"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數": "0",
    "已對保待撥金額": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "830",
    "已准待撥件數": "5",
    "已准待撥": "610",
    "已准待對保件數": "2",
    "已准待對保金額": "190",
    "已對保待撥件數": "3",
    "已對保待撥金額": "420"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "5",
    "已准待撥": "690",
    "已准待對保件數": "3",
    "已准待對保金額": "440",
    "已對保待撥件數": "2",
    "已對保待撥金額": "250"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "6",
    "已進件待核准金額": "1500",
    "已准待撥件數": "9",
    "已准待撥": "1630",
    "已准待對保件數": "5",
    "已准待對保金額": "810",
    "已對保待撥件數": "4",
    "已對保待撥金額": "820"
  },
  {
    "經辦": "總和",
    "已進件待核准": "45",
    "已進件待核准金額": "10880",
    "已准待撥件數": "64",
    "已准待撥": "9130",
    "已准待對保件數": "31",
    "已准待對保金額": "4450",
    "已對保待撥件數": "33",
    "已對保待撥金額": "4680"
  }
];
const historyData = [
  {
    "timestamp": "2026-10-12T07:03:05.742Z",
    "A": 42,
    "A_amount": 5830,
    "B": 27,
    "B_amount": 3720
  },
  {
    "timestamp": "2026-10-13T01:03:35.852Z",
    "A": 35,
    "A_amount": 4970,
    "B": 36,
    "B_amount": 4740
  },
  {
    "timestamp": "2026-10-13T07:03:40.686Z",
    "A": 41,
    "A_amount": 5830,
    "B": 31,
    "B_amount": 3990
  },
  {
    "timestamp": "2026-10-14T01:04:09.686Z",
    "A": 43,
    "A_amount": 6350,
    "B": 36,
    "B_amount": 4380
  },
  {
    "timestamp": "2026-10-15T01:01:05.455Z",
    "A": 39,
    "A_amount": 5690,
    "B": 37,
    "B_amount": 4635
  },
  {
    "timestamp": "2026-10-15T07:01:37.717Z",
    "A": 36,
    "A_amount": 5240,
    "B": 29,
    "B_amount": 3625
  },
  {
    "timestamp": "2026-10-16T01:02:07.159Z",
    "A": 35,
    "A_amount": 5040,
    "B": 30,
    "B_amount": 3825
  },
  {
    "timestamp": "2026-10-16T07:02:36.560Z",
    "A": 36,
    "A_amount": 5120,
    "B": 18,
    "B_amount": 2335
  },
  {
    "timestamp": "2026-10-17T01:03:18.569Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-17T07:03:59.432Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-18T01:04:41.833Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-18T07:05:23.422Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-19T01:05:59.835Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  },
  {
    "timestamp": "2026-10-19T07:06:32.633Z",
    "A": 33,
    "A_amount": 4565,
    "B": 17,
    "B_amount": 2495
  },
  {
    "timestamp": "2026-10-20T01:07:07.029Z",
    "A": 33,
    "A_amount": 4465,
    "B": 17,
    "B_amount": 2555
  },
  {
    "timestamp": "2026-10-20T09:35:34.978Z",
    "A": 40,
    "A_amount": 5870,
    "B": 32,
    "B_amount": 4540
  },
  {
    "timestamp": "2026-10-20T09:36:37.652Z",
    "A": 40,
    "A_amount": 5870,
    "B": 32,
    "B_amount": 4540
  },
  {
    "timestamp": "2026-10-21T01:08:07.326Z",
    "A": 29,
    "A_amount": 3940,
    "B": 37,
    "B_amount": 5420
  },
  {
    "timestamp": "2026-10-21T07:08:12.170Z",
    "A": 34,
    "A_amount": 4740,
    "B": 29,
    "B_amount": 4390
  },
  {
    "timestamp": "2026-10-22T01:08:45.418Z",
    "A": 29,
    "A_amount": 4190,
    "B": 38,
    "B_amount": 5470
  },
  {
    "timestamp": "2026-10-22T07:09:16.391Z",
    "A": 32,
    "A_amount": 4870,
    "B": 26,
    "B_amount": 3550
  },
  {
    "timestamp": "2026-10-23T01:09:54.873Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-23T07:10:02.378Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-24T01:10:44.097Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-24T07:10:59.705Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-25T01:11:42.306Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-25T07:11:47.538Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-26T01:12:30.177Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-26T07:12:47.550Z",
    "A": 35,
    "A_amount": 5150,
    "B": 29,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-27T01:13:24.410Z",
    "A": 31,
    "A_amount": 4450,
    "B": 33,
    "B_amount": 4680
  }
];
