
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "11",
    "已進件待核准金額": "2360",
    "已准待撥件數": "5",
    "已准待撥": "650",
    "已准待對保件數": "3",
    "已准待對保金額": "370",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "280"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "9",
    "已進件待核准金額": "2120",
    "已准待撥件數": "9",
    "已准待撥": "1880",
    "已准待對保件數": "6",
    "已准待對保金額": "1230",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "400",
    "已准待撥件數": "7",
    "已准待撥": "1220",
    "已准待對保件數": "4",
    "已准待對保金額": "680",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "540"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "900",
    "已准待撥件數": "8",
    "已准待撥": "1450",
    "已准待對保件數": "5",
    "已准待對保金額": "920",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "530"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "6",
    "已進件待核准金額": "2550",
    "已准待撥件數": "5",
    "已准待撥": "650",
    "已准待對保件數": "2",
    "已准待對保金額": "350",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "4",
    "已准待撥": "370",
    "已准待對保件數": "2",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "170"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "380",
    "已准待撥件數": "5",
    "已准待撥": "810",
    "已准待對保件數": "3",
    "已准待對保金額": "650",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "160"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "5",
    "已准待撥": "760",
    "已准待對保件數": "1",
    "已准待對保金額": "80",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "680"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "3",
    "已准待撥": "270",
    "已准待對保件數": "2",
    "已准待對保金額": "210",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "60"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "6",
    "已進件待核准金額": "1880",
    "已准待撥件數": "4",
    "已准待撥": "360",
    "已准待對保件數": "2",
    "已准待對保金額": "160",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "總和",
    "已進件待核准": "43",
    "已進件待核准金額": "11540",
    "已准待撥件數": "55",
    "已准待撥": "8420",
    "已准待對保件數": "30",
    "已准待對保金額": "4850",
    "已對保待撥件數的SUM": "25",
    "已對保待撥金額的SUM": "3570"
  }
];
const historyData = [
  {
    "timestamp": "2026-09-05T07:11:29.245Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-06T01:11:58.737Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-06T07:12:36.819Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-07T01:13:07.172Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-07T07:13:40.564Z",
    "A": 37,
    "A_amount": 6310,
    "B": 19,
    "B_amount": 2370
  },
  {
    "timestamp": "2026-09-08T01:14:13.619Z",
    "A": 36,
    "A_amount": 6000,
    "B": 23,
    "B_amount": 3070
  },
  {
    "timestamp": "2026-09-08T07:14:42.624Z",
    "A": 37,
    "A_amount": 5790,
    "B": 25,
    "B_amount": 3350
  },
  {
    "timestamp": "2026-09-09T01:15:15.387Z",
    "A": 37,
    "A_amount": 5910,
    "B": 28,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-09-09T07:02:45.319Z",
    "A": 40,
    "A_amount": 6230,
    "B": 23,
    "B_amount": 3060
  },
  {
    "timestamp": "2026-09-10T01:03:54.764Z",
    "A": 36,
    "A_amount": 6140,
    "B": 28,
    "B_amount": 3490
  },
  {
    "timestamp": "2026-09-10T07:04:28.723Z",
    "A": 23,
    "A_amount": 3410,
    "B": 28,
    "B_amount": 3540
  },
  {
    "timestamp": "2026-09-11T01:00:27.863Z",
    "A": 25,
    "A_amount": 3640,
    "B": 33,
    "B_amount": 4320
  },
  {
    "timestamp": "2026-09-11T07:00:54.826Z",
    "A": 32,
    "A_amount": 4600,
    "B": 27,
    "B_amount": 3430
  },
  {
    "timestamp": "2026-09-16T07:00:29.601Z",
    "A": 35,
    "A_amount": 4910,
    "B": 27,
    "B_amount": 3560
  },
  {
    "timestamp": "2026-09-17T01:01:02.343Z",
    "A": 32,
    "A_amount": 4550,
    "B": 32,
    "B_amount": 3960
  },
  {
    "timestamp": "2026-09-17T07:01:35.920Z",
    "A": 36,
    "A_amount": 5390,
    "B": 25,
    "B_amount": 2850
  },
  {
    "timestamp": "2026-09-18T01:02:10.494Z",
    "A": 38,
    "A_amount": 5630,
    "B": 28,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-09-18T07:02:41.825Z",
    "A": 44,
    "A_amount": 6390,
    "B": 23,
    "B_amount": 2420
  },
  {
    "timestamp": "2026-09-19T01:03:11.570Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-19T07:03:39.961Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-20T01:04:22.556Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-20T07:05:03.504Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-21T01:05:37.350Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-21T07:02:34.560Z",
    "A": 41,
    "A_amount": 6460,
    "B": 31,
    "B_amount": 3180
  },
  {
    "timestamp": "2026-09-22T01:01:13.030Z",
    "A": 39,
    "A_amount": 6080,
    "B": 35,
    "B_amount": 3880
  },
  {
    "timestamp": "2026-09-22T07:01:45.242Z",
    "A": 40,
    "A_amount": 5890,
    "B": 27,
    "B_amount": 3290
  },
  {
    "timestamp": "2026-09-23T01:00:31.577Z",
    "A": 30,
    "A_amount": 4750,
    "B": 35,
    "B_amount": 4340
  },
  {
    "timestamp": "2026-09-23T07:01:10.642Z",
    "A": 30,
    "A_amount": 4680,
    "B": 26,
    "B_amount": 3840
  },
  {
    "timestamp": "2026-09-24T01:01:44.564Z",
    "A": 29,
    "A_amount": 4540,
    "B": 28,
    "B_amount": 4060
  },
  {
    "timestamp": "2026-09-24T07:02:14.345Z",
    "A": 30,
    "A_amount": 4850,
    "B": 25,
    "B_amount": 3570
  }
];
