
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "11",
    "已進件待核准金額": "1978",
    "已准待撥件數": "11",
    "已准待撥": "1990",
    "已准待對保件數": "7",
    "已准待對保金額": "1290",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "700"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "7",
    "已進件待核准金額": "1490",
    "已准待撥件數": "8",
    "已准待撥": "1090",
    "已准待對保件數": "2",
    "已准待對保金額": "380",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "710"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "4",
    "已進件待核准金額": "490",
    "已准待撥件數": "6",
    "已准待撥": "810",
    "已准待對保件數": "3",
    "已准待對保金額": "430",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "800",
    "已准待撥件數": "11",
    "已准待撥": "1560",
    "已准待對保件數": "7",
    "已准待對保金額": "1070",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "490"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "750",
    "已准待撥件數": "9",
    "已准待撥": "1120",
    "已准待對保件數": "7",
    "已准待對保金額": "1000",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "120"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "2",
    "已進件待核准金額": "400",
    "已准待撥件數": "7",
    "已准待撥": "890",
    "已准待對保件數": "4",
    "已准待對保金額": "530",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "360"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "8",
    "已准待撥": "1370",
    "已准待對保件數": "7",
    "已准待對保金額": "1320",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "50"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "6",
    "已進件待核准金額": "1380",
    "已准待撥件數": "4",
    "已准待撥": "320",
    "已准待對保件數": "1",
    "已准待對保金額": "50",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "270"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "4",
    "已准待撥": "580",
    "已准待對保件數": "2",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "260"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1300",
    "已准待撥件數": "5",
    "已准待撥": "710",
    "已准待對保件數": "3",
    "已准待對保金額": "310",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "總和",
    "已進件待核准": "42",
    "已進件待核准金額": "9418",
    "已准待撥件數": "73",
    "已准待撥": "10440",
    "已准待對保件數": "43",
    "已准待對保金額": "6700",
    "已對保待撥件數的SUM": "30",
    "已對保待撥金額的SUM": "3740"
  }
];
const historyData = [
  {
    "timestamp": "2026-06-30T07:04:05.541Z",
    "A": 38,
    "A_amount": 5365,
    "B": 17,
    "B_amount": 2290
  },
  {
    "timestamp": "2026-07-01T01:04:14.589Z",
    "A": 33,
    "A_amount": 4920,
    "B": 24,
    "B_amount": 3005
  },
  {
    "timestamp": "2026-07-01T07:04:20.561Z",
    "A": 36,
    "A_amount": 5370,
    "B": 22,
    "B_amount": 2850
  },
  {
    "timestamp": "2026-07-02T01:04:30.778Z",
    "A": 32,
    "A_amount": 4760,
    "B": 28,
    "B_amount": 3610
  },
  {
    "timestamp": "2026-07-02T07:04:35.900Z",
    "A": 38,
    "A_amount": 5580,
    "B": 19,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-07-06T07:00:08.964Z",
    "A": 43,
    "A_amount": 6720,
    "B": 26,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-07-07T01:00:18.419Z",
    "A": 41,
    "A_amount": 6560,
    "B": 31,
    "B_amount": 4420
  },
  {
    "timestamp": "2026-07-07T07:00:25.385Z",
    "A": 42,
    "A_amount": 6750,
    "B": 21,
    "B_amount": 2985
  },
  {
    "timestamp": "2026-07-08T01:00:32.575Z",
    "A": 42,
    "A_amount": 6540,
    "B": 25,
    "B_amount": 3575
  },
  {
    "timestamp": "2026-07-08T07:00:40.297Z",
    "A": 48,
    "A_amount": 7350,
    "B": 19,
    "B_amount": 2805
  },
  {
    "timestamp": "2026-07-09T01:00:48.853Z",
    "A": 49,
    "A_amount": 7360,
    "B": 24,
    "B_amount": 3575
  },
  {
    "timestamp": "2026-07-09T07:00:57.254Z",
    "A": 56,
    "A_amount": 8020,
    "B": 17,
    "B_amount": 2630
  },
  {
    "timestamp": "2026-07-10T01:01:06.009Z",
    "A": 54,
    "A_amount": 7550,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-07-10T07:01:13.532Z",
    "A": 54,
    "A_amount": 7550,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-07-11T01:01:34.241Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-11T07:01:52.154Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-12T01:02:13.842Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-12T07:02:18.882Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-13T01:02:28.116Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-13T07:02:34.229Z",
    "A": 53,
    "A_amount": 7780,
    "B": 25,
    "B_amount": 3630
  },
  {
    "timestamp": "2026-07-14T01:02:42.692Z",
    "A": 49,
    "A_amount": 7110,
    "B": 34,
    "B_amount": 5090
  },
  {
    "timestamp": "2026-07-14T07:02:48.578Z",
    "A": 56,
    "A_amount": 7680,
    "B": 27,
    "B_amount": 3890
  },
  {
    "timestamp": "2026-07-15T01:03:15.815Z",
    "A": 36,
    "A_amount": 5110,
    "B": 28,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-07-16T07:00:35.151Z",
    "A": 40,
    "A_amount": 5990,
    "B": 24,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-07-17T01:00:43.396Z",
    "A": 34,
    "A_amount": 5470,
    "B": 33,
    "B_amount": 4080
  },
  {
    "timestamp": "2026-07-17T07:00:50.907Z",
    "A": 44,
    "A_amount": 6810,
    "B": 25,
    "B_amount": 2910
  },
  {
    "timestamp": "2026-07-18T01:01:09.315Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-18T07:01:16.353Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-19T01:01:24.121Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-19T07:01:43.957Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  }
];
