
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1210",
    "已准待撥件數": "9",
    "已准待撥": "1740",
    "已准待對保件數": "4",
    "已准待對保金額": "780",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "970"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1200",
    "已准待撥件數": "14",
    "已准待撥": "1910",
    "已准待對保件數": "9",
    "已准待對保金額": "1190",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "800"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "320",
    "已准待撥件數": "5",
    "已准待撥": "500",
    "已准待對保件數": "2",
    "已准待對保金額": "270",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "8",
    "已准待撥": "1085",
    "已准待對保件數": "5",
    "已准待對保金額": "725",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "12",
    "已准待撥": "1370",
    "已准待對保件數": "7",
    "已准待對保金額": "820",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "500",
    "已准待撥件數": "11",
    "已准待撥": "1720",
    "已准待對保件數": "5",
    "已准待對保金額": "830",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "750"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "3",
    "已准待撥": "580",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "530"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "1",
    "已准待撥": "200",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "6",
    "已准待撥": "890",
    "已准待對保件數": "3",
    "已准待對保金額": "430",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "390"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "670",
    "已准待撥件數": "8",
    "已准待撥": "950",
    "已准待對保件數": "6",
    "已准待對保金額": "800",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "220"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "5",
    "已進件待核准金額": "1420",
    "已准待撥件數": "6",
    "已准待撥": "1020",
    "已准待對保件數": "5",
    "已准待對保金額": "750",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "總和",
    "已進件待核准": "31",
    "已進件待核准金額": "7000",
    "已准待撥件數": "83",
    "已准待撥": "11965",
    "已准待對保件數": "46",
    "已准待對保金額": "6595",
    "已對保待撥件數的SUM": "37",
    "已對保待撥金額的SUM": "5310"
  }
];
const historyData = [
  {
    "timestamp": "2026-04-26T07:03:05.613Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-27T01:03:11.767Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-27T07:03:17.915Z",
    "A": 50,
    "A_amount": 6230,
    "B": 46,
    "B_amount": 5285
  },
  {
    "timestamp": "2026-04-28T01:03:24.769Z",
    "A": 47,
    "A_amount": 5830,
    "B": 43,
    "B_amount": 4920
  },
  {
    "timestamp": "2026-04-28T07:03:30.540Z",
    "A": 50,
    "A_amount": 6360,
    "B": 31,
    "B_amount": 3390
  },
  {
    "timestamp": "2026-04-29T01:03:37.392Z",
    "A": 47,
    "A_amount": 5590,
    "B": 39,
    "B_amount": 4770
  },
  {
    "timestamp": "2026-04-29T07:03:43.775Z",
    "A": 49,
    "A_amount": 5980,
    "B": 28,
    "B_amount": 3590
  },
  {
    "timestamp": "2026-04-30T01:03:52.057Z",
    "A": 52,
    "A_amount": 6110,
    "B": 30,
    "B_amount": 3870
  },
  {
    "timestamp": "2026-04-30T07:03:57.617Z",
    "A": 58,
    "A_amount": 6870,
    "B": 18,
    "B_amount": 2450
  },
  {
    "timestamp": "2026-05-01T01:04:09.366Z",
    "A": 57,
    "A_amount": 6710,
    "B": 21,
    "B_amount": 2800
  },
  {
    "timestamp": "2026-05-01T07:04:15.628Z",
    "A": 57,
    "A_amount": 6710,
    "B": 21,
    "B_amount": 2800
  },
  {
    "timestamp": "2026-05-04T01:00:22.891Z",
    "A": 57,
    "A_amount": 6710,
    "B": 21,
    "B_amount": 2800
  },
  {
    "timestamp": "2026-05-04T07:00:28.605Z",
    "A": 57,
    "A_amount": 6590,
    "B": 26,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-05-05T01:00:35.557Z",
    "A": 57,
    "A_amount": 7090,
    "B": 33,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-05-05T07:00:41.422Z",
    "A": 55,
    "A_amount": 6830,
    "B": 32,
    "B_amount": 3900
  },
  {
    "timestamp": "2026-05-06T01:00:47.083Z",
    "A": null,
    "A_amount": null,
    "B": null,
    "B_amount": null
  },
  {
    "timestamp": "2026-05-06T07:00:52.154Z",
    "A": null,
    "A_amount": null,
    "B": null,
    "B_amount": null
  },
  {
    "timestamp": "2026-05-07T01:00:56.581Z",
    "A": null,
    "A_amount": null,
    "B": null,
    "B_amount": null
  },
  {
    "timestamp": "2026-05-07T07:01:01.623Z",
    "A": 48,
    "A_amount": 6890,
    "B": 32,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-05-08T01:01:06.653Z",
    "A": 42,
    "A_amount": 6130,
    "B": 41,
    "B_amount": 5020
  },
  {
    "timestamp": "2026-05-08T07:01:13.318Z",
    "A": 46,
    "A_amount": 6770,
    "B": 31,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-05-09T01:01:30.542Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-09T07:01:47.231Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-10T01:02:04.205Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-10T07:02:20.064Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-11T01:02:25.674Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-11T07:02:31.563Z",
    "A": 47,
    "A_amount": 6560,
    "B": 27,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-05-12T01:02:36.577Z",
    "A": 44,
    "A_amount": 6390,
    "B": 34,
    "B_amount": 4840
  },
  {
    "timestamp": "2026-05-12T07:02:42.655Z",
    "A": 48,
    "A_amount": 7055,
    "B": 32,
    "B_amount": 4550
  },
  {
    "timestamp": "2026-05-13T01:02:48.634Z",
    "A": 46,
    "A_amount": 6595,
    "B": 37,
    "B_amount": 5310
  }
];
