
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1490",
    "已准待撥件數": "14",
    "已准待撥": "1730",
    "已准待對保件數": "8",
    "已准待對保金額": "1050",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "680"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1490",
    "已准待撥件數": "5",
    "已准待撥": "770",
    "已准待對保件數": "4",
    "已准待對保金額": "670",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "100"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "13",
    "已准待撥": "1230",
    "已准待對保件數": "9",
    "已准待對保金額": "650",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "580"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "8",
    "已准待撥": "1270",
    "已准待對保件數": "6",
    "已准待對保金額": "1080",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "190"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1020",
    "已准待撥件數": "7",
    "已准待撥": "1120",
    "已准待對保件數": "5",
    "已准待對保金額": "700",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "420"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "5",
    "已准待撥": "680",
    "已准待對保件數": "2",
    "已准待對保金額": "230",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "9",
    "已准待撥": "1320",
    "已准待對保件數": "5",
    "已准待對保金額": "750",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "570"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "6",
    "已准待撥": "850",
    "已准待對保件數": "4",
    "已准待對保金額": "430",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "420"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "700",
    "已准待撥件數": "6",
    "已准待撥": "790",
    "已准待對保件數": "3",
    "已准待對保金額": "390",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "6",
    "已進件待核准金額": "1825",
    "已准待撥件數": "6",
    "已准待撥": "640",
    "已准待對保件數": "4",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "140"
  },
  {
    "經辦": "總和",
    "已進件待核准": "33",
    "已進件待核准金額": "8105",
    "已准待撥件數": "79",
    "已准待撥": "10400",
    "已准待對保件數": "50",
    "已准待對保金額": "6450",
    "已對保待撥件數的SUM": "29",
    "已對保待撥金額的SUM": "3950"
  }
];
const historyData = [
  {
    "timestamp": "2026-08-04T07:00:15.862Z",
    "A": 43,
    "A_amount": 6410,
    "B": 29,
    "B_amount": 3830
  },
  {
    "timestamp": "2026-08-05T01:00:23.014Z",
    "A": 40,
    "A_amount": 6220,
    "B": 36,
    "B_amount": 4630
  },
  {
    "timestamp": "2026-08-05T07:00:30.751Z",
    "A": 42,
    "A_amount": 6600,
    "B": 31,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-08-06T01:00:38.848Z",
    "A": 47,
    "A_amount": 6960,
    "B": 31,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-08-06T07:00:48.309Z",
    "A": 48,
    "A_amount": 7110,
    "B": 25,
    "B_amount": 3040
  },
  {
    "timestamp": "2026-08-07T01:00:57.742Z",
    "A": 47,
    "A_amount": 6810,
    "B": 25,
    "B_amount": 3040
  },
  {
    "timestamp": "2026-08-07T07:01:05.310Z",
    "A": 44,
    "A_amount": 6370,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-08T01:01:54.376Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-08T07:02:40.296Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-09T01:03:28.949Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-09T07:03:46.354Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-10T01:04:23.251Z",
    "A": 49,
    "A_amount": 7110,
    "B": 23,
    "B_amount": 2920
  },
  {
    "timestamp": "2026-08-10T07:04:28.642Z",
    "A": 48,
    "A_amount": 7250,
    "B": 22,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-11T01:05:08.620Z",
    "A": 50,
    "A_amount": 7430,
    "B": 22,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-11T07:05:13.800Z",
    "A": 52,
    "A_amount": 7310,
    "B": 17,
    "B_amount": 2390
  },
  {
    "timestamp": "2026-08-12T01:05:57.181Z",
    "A": 51,
    "A_amount": 7120,
    "B": 17,
    "B_amount": 2390
  },
  {
    "timestamp": "2026-08-12T07:06:03.060Z",
    "A": 35,
    "A_amount": 4410,
    "B": 16,
    "B_amount": 2400
  },
  {
    "timestamp": "2026-08-13T01:06:51.050Z",
    "A": 38,
    "A_amount": 4890,
    "B": 18,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-13T07:00:32.209Z",
    "A": 37,
    "A_amount": 4600,
    "B": 18,
    "B_amount": 2500
  },
  {
    "timestamp": "2026-08-14T01:01:06.236Z",
    "A": 44,
    "A_amount": 5450,
    "B": 19,
    "B_amount": 2610
  },
  {
    "timestamp": "2026-08-14T07:01:41.332Z",
    "A": 49,
    "A_amount": 6070,
    "B": 15,
    "B_amount": 1930
  },
  {
    "timestamp": "2026-08-15T01:02:17.053Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-15T07:03:01.926Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-16T01:03:49.194Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-16T07:04:23.157Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-17T01:04:58.039Z",
    "A": 42,
    "A_amount": 5020,
    "B": 23,
    "B_amount": 3030
  },
  {
    "timestamp": "2026-08-20T01:04:46.655Z",
    "A": 56,
    "A_amount": 7240,
    "B": 18,
    "B_amount": 2160
  },
  {
    "timestamp": "2026-08-20T07:33:44.020Z",
    "A": 52,
    "A_amount": 6900,
    "B": 21,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-08-21T01:04:24.430Z",
    "A": 55,
    "A_amount": 7620,
    "B": 21,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-08-21T07:00:34.789Z",
    "A": 50,
    "A_amount": 6450,
    "B": 29,
    "B_amount": 3950
  }
];
