
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "4",
    "已進件待核准金額": "670",
    "已准待撥件數": "8",
    "已准待撥": "1380",
    "已准待對保件數": "4",
    "已准待對保金額": "650",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "730"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1370",
    "已准待撥件數": "13",
    "已准待撥": "1570",
    "已准待對保件數": "5",
    "已准待對保金額": "630",
    "已對保待撥件數的SUM": "8",
    "已對保待撥金額的SUM": "940"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "300",
    "已准待撥件數": "8",
    "已准待撥": "910",
    "已准待對保件數": "5",
    "已准待對保金額": "600",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "310"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "850",
    "已准待撥件數": "8",
    "已准待撥": "1150",
    "已准待對保件數": "7",
    "已准待對保金額": "1100",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "50"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "1",
    "已進件待核准金額": "250",
    "已准待撥件數": "9",
    "已准待撥": "1540",
    "已准待對保件數": "6",
    "已准待對保金額": "1000",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "540"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "2",
    "已進件待核准金額": "400",
    "已准待撥件數": "3",
    "已准待撥": "450",
    "已准待對保件數": "2",
    "已准待對保金額": "350",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "100"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "530",
    "已准待撥件數": "2",
    "已准待撥": "300",
    "已准待對保件數": "2",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "4",
    "已准待撥": "650",
    "已准待對保件數": "1",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "430",
    "已准待撥件數": "5",
    "已准待撥": "620",
    "已准待對保件數": "3",
    "已准待對保金額": "250",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "370"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "1",
    "已進件待核准金額": "240",
    "已准待撥件數": "6",
    "已准待撥": "930",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "430"
  },
  {
    "經辦": "總和",
    "已進件待核准": "27",
    "已進件待核准金額": "5790",
    "已准待撥件數": "66",
    "已准待撥": "9500",
    "已准待對保件數": "38",
    "已准待對保金額": "5680",
    "已對保待撥件數的SUM": "28",
    "已對保待撥金額的SUM": "3820"
  }
];
const historyData = [
  {
    "timestamp": "2026-03-10T21:24:01.767Z",
    "A": 25,
    "A_amount": 500,
    "B": 20,
    "B_amount": 300
  },
  {
    "timestamp": "2026-03-11T01:21:24.190Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:27:16.958Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:34:41.003Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:36:27.109Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T02:06:29.182Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  }
];
