
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "13",
    "已進件待核准金額": "2910",
    "已准待撥件數": "10",
    "已准待撥": "1180",
    "已准待對保件數": "3",
    "已准待對保金額": "360",
    "已對保待撥件數的SUM": "7",
    "已對保待撥金額的SUM": "820"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "7",
    "已進件待核准金額": "1690",
    "已准待撥件數": "7",
    "已准待撥": "1000",
    "已准待對保件數": "3",
    "已准待對保金額": "420",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "580"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "250",
    "已准待撥件數": "6",
    "已准待撥": "880",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "7",
    "已准待撥": "760",
    "已准待對保件數": "4",
    "已准待對保金額": "330",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "430"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "5",
    "已進件待核准金額": "2050",
    "已准待撥件數": "5",
    "已准待撥": "730",
    "已准待對保件數": "3",
    "已准待對保金額": "370",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "360"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "6",
    "已准待撥": "1060",
    "已准待對保件數": "6",
    "已准待對保金額": "1060",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "3",
    "已進件待核准金額": "930",
    "已准待撥件數": "8",
    "已准待撥": "750",
    "已准待對保件數": "4",
    "已准待對保金額": "270",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "480"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "2",
    "已准待撥": "300",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "500",
    "已准待撥件數": "7",
    "已准待撥": "720",
    "已准待對保件數": "3",
    "已准待對保金額": "250",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "470"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "5",
    "已進件待核准金額": "1515",
    "已准待撥件數": "9",
    "已准待撥": "1390",
    "已准待對保件數": "6",
    "已准待對保金額": "980",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "410"
  },
  {
    "經辦": "總和",
    "已進件待核准": "43",
    "已進件待核准金額": "11195",
    "已准待撥件數": "67",
    "已准待撥": "8770",
    "已准待對保件數": "36",
    "已准待對保金額": "4690",
    "已對保待撥件數的SUM": "31",
    "已對保待撥金額的SUM": "4080"
  }
];
const historyData = [
  {
    "timestamp": "2026-09-21T07:02:34.560Z",
    "A": 41,
    "A_amount": 6460,
    "B": 31,
    "B_amount": 3180
  },
  {
    "timestamp": "2026-09-22T01:01:13.030Z",
    "A": 39,
    "A_amount": 6080,
    "B": 35,
    "B_amount": 3880
  },
  {
    "timestamp": "2026-09-22T07:01:45.242Z",
    "A": 40,
    "A_amount": 5890,
    "B": 27,
    "B_amount": 3290
  },
  {
    "timestamp": "2026-09-23T01:00:31.577Z",
    "A": 30,
    "A_amount": 4750,
    "B": 35,
    "B_amount": 4340
  },
  {
    "timestamp": "2026-09-23T07:01:10.642Z",
    "A": 30,
    "A_amount": 4680,
    "B": 26,
    "B_amount": 3840
  },
  {
    "timestamp": "2026-09-24T01:01:44.564Z",
    "A": 29,
    "A_amount": 4540,
    "B": 28,
    "B_amount": 4060
  },
  {
    "timestamp": "2026-09-24T07:02:14.345Z",
    "A": 30,
    "A_amount": 4850,
    "B": 25,
    "B_amount": 3570
  },
  {
    "timestamp": "2026-09-25T01:02:55.320Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-25T07:03:12.913Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-26T01:03:43.252Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-26T07:04:00.036Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-27T01:04:40.044Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-27T07:05:20.741Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-28T01:05:48.966Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-28T07:06:30.819Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-29T01:07:02.241Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-29T07:00:43.897Z",
    "A": 34,
    "A_amount": 5470,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-09-30T01:01:16.421Z",
    "A": 36,
    "A_amount": 5690,
    "B": 26,
    "B_amount": 3790
  },
  {
    "timestamp": "2026-09-30T07:01:51.501Z",
    "A": 42,
    "A_amount": 6820,
    "B": 9,
    "B_amount": 1300
  },
  {
    "timestamp": "2026-10-01T01:02:22.160Z",
    "A": 46,
    "A_amount": 7430,
    "B": 11,
    "B_amount": 1600
  },
  {
    "timestamp": "2026-10-01T07:02:51.363Z",
    "A": 47,
    "A_amount": 7450,
    "B": 13,
    "B_amount": 1890
  },
  {
    "timestamp": "2026-10-02T01:03:22.892Z",
    "A": 55,
    "A_amount": 8580,
    "B": 13,
    "B_amount": 1890
  },
  {
    "timestamp": "2026-10-02T07:17:20.168Z",
    "A": 34,
    "A_amount": 5010,
    "B": 17,
    "B_amount": 2310
  },
  {
    "timestamp": "2026-10-05T02:12:29.676Z",
    "A": 30,
    "A_amount": 4540,
    "B": 23,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-10-05T07:10:30.242Z",
    "A": 34,
    "A_amount": 5150,
    "B": 27,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-10-06T01:03:53.561Z",
    "A": 36,
    "A_amount": 5240,
    "B": 29,
    "B_amount": 4150
  },
  {
    "timestamp": "2026-10-06T07:04:25.168Z",
    "A": 38,
    "A_amount": 5400,
    "B": 25,
    "B_amount": 3510
  },
  {
    "timestamp": "2026-10-07T01:04:57.450Z",
    "A": 40,
    "A_amount": 5630,
    "B": 28,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-07T07:05:27.278Z",
    "A": 44,
    "A_amount": 6080,
    "B": 22,
    "B_amount": 2840
  },
  {
    "timestamp": "2026-10-08T01:05:58.318Z",
    "A": 36,
    "A_amount": 4690,
    "B": 31,
    "B_amount": 4080
  }
];
