
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "9",
    "已進件待核准金額": "1750",
    "已准待撥件數": "12",
    "已准待撥": "1900",
    "已准待對保件數": "9",
    "已准待對保金額": "1400",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "7",
    "已進件待核准金額": "1640",
    "已准待撥件數": "8",
    "已准待撥": "1130",
    "已准待對保件數": "3",
    "已准待對保金額": "410",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "720"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "400",
    "已准待撥件數": "12",
    "已准待撥": "1400",
    "已准待對保件數": "9",
    "已准待對保金額": "1000",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "700",
    "已准待撥件數": "9",
    "已准待撥": "1230",
    "已准待對保件數": "5",
    "已准待對保金額": "770",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "460"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1350",
    "已准待撥件數": "12",
    "已准待撥": "1580",
    "已准待對保件數": "10",
    "已准待對保金額": "1440",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "140"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "2",
    "已進件待核准金額": "450",
    "已准待撥件數": "6",
    "已准待撥": "910",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "410"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "11",
    "已准待撥": "1940",
    "已准待對保件數": "9",
    "已准待對保金額": "1660",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "280"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "180",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "180"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "5",
    "已進件待核准金額": "1350",
    "已准待撥件數": "5",
    "已准待撥": "750",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "700",
    "已准待撥件數": "6",
    "已准待撥": "900",
    "已准待對保件數": "3",
    "已准待對保金額": "400",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1200",
    "已准待撥件數": "8",
    "已准待撥": "1070",
    "已准待對保件數": "3",
    "已准待對保金額": "310",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "760"
  },
  {
    "經辦": "總和",
    "已進件待核准": "39",
    "已進件待核准金額": "9770",
    "已准待撥件數": "90",
    "已准待撥": "12990",
    "已准待對保件數": "57",
    "已准待對保金額": "8390",
    "已對保待撥件數的SUM": "33",
    "已對保待撥金額的SUM": "4600"
  }
];
const historyData = [
  {
    "timestamp": "2026-07-12T07:02:18.882Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-13T01:02:28.116Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-13T07:02:34.229Z",
    "A": 53,
    "A_amount": 7780,
    "B": 25,
    "B_amount": 3630
  },
  {
    "timestamp": "2026-07-14T01:02:42.692Z",
    "A": 49,
    "A_amount": 7110,
    "B": 34,
    "B_amount": 5090
  },
  {
    "timestamp": "2026-07-14T07:02:48.578Z",
    "A": 56,
    "A_amount": 7680,
    "B": 27,
    "B_amount": 3890
  },
  {
    "timestamp": "2026-07-15T01:03:15.815Z",
    "A": 36,
    "A_amount": 5110,
    "B": 28,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-07-16T07:00:35.151Z",
    "A": 40,
    "A_amount": 5990,
    "B": 24,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-07-17T01:00:43.396Z",
    "A": 34,
    "A_amount": 5470,
    "B": 33,
    "B_amount": 4080
  },
  {
    "timestamp": "2026-07-17T07:00:50.907Z",
    "A": 44,
    "A_amount": 6810,
    "B": 25,
    "B_amount": 2910
  },
  {
    "timestamp": "2026-07-18T01:01:09.315Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-18T07:01:16.353Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-19T01:01:24.121Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-19T07:01:43.957Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-20T01:00:08.578Z",
    "A": 43,
    "A_amount": 6700,
    "B": 30,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-07-20T07:00:21.067Z",
    "A": 55,
    "A_amount": 7860,
    "B": 26,
    "B_amount": 3170
  },
  {
    "timestamp": "2026-07-21T01:00:31.716Z",
    "A": 49,
    "A_amount": 7320,
    "B": 33,
    "B_amount": 4020
  },
  {
    "timestamp": "2026-07-21T07:03:43.891Z",
    "A": 57,
    "A_amount": 8400,
    "B": 28,
    "B_amount": 3510
  },
  {
    "timestamp": "2026-07-22T01:03:53.529Z",
    "A": 49,
    "A_amount": 7170,
    "B": 39,
    "B_amount": 5070
  },
  {
    "timestamp": "2026-07-22T07:04:01.098Z",
    "A": 59,
    "A_amount": 8380,
    "B": 29,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-07-23T01:04:11.015Z",
    "A": 56,
    "A_amount": 7970,
    "B": 34,
    "B_amount": 4520
  },
  {
    "timestamp": "2026-07-23T07:04:18.627Z",
    "A": 60,
    "A_amount": 8730,
    "B": 26,
    "B_amount": 3760
  },
  {
    "timestamp": "2026-07-24T01:04:25.683Z",
    "A": 55,
    "A_amount": 8150,
    "B": 35,
    "B_amount": 5110
  },
  {
    "timestamp": "2026-07-24T07:04:32.199Z",
    "A": 58,
    "A_amount": 8650,
    "B": 26,
    "B_amount": 3690
  },
  {
    "timestamp": "2026-07-25T01:04:41.050Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-25T07:04:58.877Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-26T01:05:09.353Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-26T07:05:26.720Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-27T01:05:36.535Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-27T07:05:42.336Z",
    "A": 54,
    "A_amount": 7870,
    "B": 26,
    "B_amount": 3620
  },
  {
    "timestamp": "2026-07-28T01:05:49.604Z",
    "A": 57,
    "A_amount": 8390,
    "B": 33,
    "B_amount": 4600
  }
];
