
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "13",
    "已進件待核准金額": "2890",
    "已准待撥件數": "8",
    "已准待撥": "1320",
    "已准待對保件數": "6",
    "已准待對保金額": "970",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1440",
    "已准待撥件數": "5",
    "已准待撥": "650",
    "已准待對保件數": "4",
    "已准待對保金額": "600",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "50"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "450",
    "已准待撥件數": "5",
    "已准待撥": "760",
    "已准待對保件數": "3",
    "已准待對保金額": "410",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "7",
    "已准待撥": "1130",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "630"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1550",
    "已准待撥件數": "4",
    "已准待撥": "420",
    "已准待對保件數": "1",
    "已准待對保金額": "120",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "5",
    "已准待撥": "400",
    "已准待對保件數": "3",
    "已准待對保金額": "340",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "60"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "6",
    "已准待撥": "1150",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "5",
    "已准待撥": "650",
    "已准待對保件數": "3",
    "已准待對保金額": "450",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "500",
    "已准待撥件數": "7",
    "已准待撥": "1580",
    "已准待對保件數": "5",
    "已准待對保金額": "1330",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "7",
    "已進件待核准金額": "2040",
    "已准待撥件數": "7",
    "已准待撥": "1010",
    "已准待對保件數": "5",
    "已准待對保金額": "780",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "230"
  },
  {
    "經辦": "總和",
    "已進件待核准": "42",
    "已進件待核准金額": "10350",
    "已准待撥件數": "59",
    "已准待撥": "9070",
    "已准待對保件數": "36",
    "已准待對保金額": "6000",
    "已對保待撥件數的SUM": "23",
    "已對保待撥金額的SUM": "3070"
  }
];
const historyData = [
  {
    "timestamp": "2026-08-24T07:04:38.930Z",
    "A": 47,
    "A_amount": 5960,
    "B": 34,
    "B_amount": 4800
  },
  {
    "timestamp": "2026-08-25T01:05:17.687Z",
    "A": 52,
    "A_amount": 6240,
    "B": 34,
    "B_amount": 4800
  },
  {
    "timestamp": "2026-08-25T07:05:51.677Z",
    "A": 59,
    "A_amount": 7240,
    "B": 25,
    "B_amount": 3630
  },
  {
    "timestamp": "2026-08-26T01:06:25.994Z",
    "A": 25,
    "A_amount": 3370,
    "B": 32,
    "B_amount": 4200
  },
  {
    "timestamp": "2026-08-26T07:07:03.439Z",
    "A": 24,
    "A_amount": 3310,
    "B": 27,
    "B_amount": 3490
  },
  {
    "timestamp": "2026-08-27T01:07:43.242Z",
    "A": 14,
    "A_amount": 2180,
    "B": 40,
    "B_amount": 5420
  },
  {
    "timestamp": "2026-08-27T07:08:22.565Z",
    "A": 20,
    "A_amount": 3080,
    "B": 32,
    "B_amount": 4540
  },
  {
    "timestamp": "2026-08-28T01:09:01.651Z",
    "A": 25,
    "A_amount": 3810,
    "B": 31,
    "B_amount": 4480
  },
  {
    "timestamp": "2026-08-28T07:00:44.869Z",
    "A": 25,
    "A_amount": 3840,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-29T01:02:05.838Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-29T07:02:55.537Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-30T01:03:43.594Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-30T07:04:20.940Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-31T01:04:55.875Z",
    "A": 27,
    "A_amount": 4160,
    "B": 27,
    "B_amount": 4210
  },
  {
    "timestamp": "2026-08-31T07:05:31.019Z",
    "A": 25,
    "A_amount": 4280,
    "B": 13,
    "B_amount": 2140
  },
  {
    "timestamp": "2026-09-01T01:06:10.977Z",
    "A": 27,
    "A_amount": 4410,
    "B": 13,
    "B_amount": 2140
  },
  {
    "timestamp": "2026-09-01T07:06:47.569Z",
    "A": 28,
    "A_amount": 4390,
    "B": 17,
    "B_amount": 2560
  },
  {
    "timestamp": "2026-09-02T01:07:29.331Z",
    "A": 28,
    "A_amount": 4570,
    "B": 20,
    "B_amount": 3060
  },
  {
    "timestamp": "2026-09-02T07:08:05.649Z",
    "A": 32,
    "A_amount": 5270,
    "B": 20,
    "B_amount": 3010
  },
  {
    "timestamp": "2026-09-03T01:08:37.492Z",
    "A": 28,
    "A_amount": 4570,
    "B": 28,
    "B_amount": 4140
  },
  {
    "timestamp": "2026-09-03T07:09:10.461Z",
    "A": 32,
    "A_amount": 5170,
    "B": 23,
    "B_amount": 3650
  },
  {
    "timestamp": "2026-09-04T01:09:40.441Z",
    "A": 32,
    "A_amount": 5450,
    "B": 28,
    "B_amount": 4200
  },
  {
    "timestamp": "2026-09-04T07:10:10.236Z",
    "A": 33,
    "A_amount": 5580,
    "B": 21,
    "B_amount": 3160
  },
  {
    "timestamp": "2026-09-05T01:10:49.316Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-05T07:11:29.245Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-06T01:11:58.737Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-06T07:12:36.819Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-07T01:13:07.172Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-07T07:13:40.564Z",
    "A": 37,
    "A_amount": 6310,
    "B": 19,
    "B_amount": 2370
  },
  {
    "timestamp": "2026-09-08T01:14:13.619Z",
    "A": 36,
    "A_amount": 6000,
    "B": 23,
    "B_amount": 3070
  }
];
