
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "12",
    "已進件待核准金額": "2660",
    "已准待撥件數": "8",
    "已准待撥": "1200",
    "已准待對保件數": "5",
    "已准待對保金額": "640",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "460"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1390",
    "已准待撥件數": "7",
    "已准待撥": "1560",
    "已准待對保件數": "4",
    "已准待對保金額": "590",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "470"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "8",
    "已准待撥": "1500",
    "已准待對保件數": "2",
    "已准待對保金額": "350",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "2",
    "已准待撥": "300",
    "已准待對保件數": "2",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1550",
    "已准待撥件數": "5",
    "已准待撥": "605",
    "已准待對保件數": "3",
    "已准待對保金額": "440",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "35"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "6",
    "已准待撥": "1680",
    "已准待對保件數": "6",
    "已准待對保金額": "1150",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "6",
    "已准待撥": "890",
    "已准待對保件數": "4",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "220"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "2",
    "已准待撥": "300",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "2",
    "已准待撥": "205",
    "已准待對保件數": "1",
    "已准待對保金額": "60",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "45"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1200",
    "已准待撥件數": "8",
    "已准待撥": "2070",
    "已准待對保件數": "7",
    "已准待對保金額": "1170",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "總和",
    "已進件待核准": "34",
    "已進件待核准金額": "8980",
    "已准待撥件數": "54",
    "已准待撥": "10310",
    "已准待對保件數": "35",
    "已准待對保金額": "5020",
    "已對保待撥件數的SUM": "18",
    "已對保待撥金額的SUM": "2280"
  }
];
const historyData = [
  {
    "timestamp": "2026-09-30T01:01:16.421Z",
    "A": 36,
    "A_amount": 5690,
    "B": 26,
    "B_amount": 3790
  },
  {
    "timestamp": "2026-09-30T07:01:51.501Z",
    "A": 42,
    "A_amount": 6820,
    "B": 9,
    "B_amount": 1300
  },
  {
    "timestamp": "2026-10-01T01:02:22.160Z",
    "A": 46,
    "A_amount": 7430,
    "B": 11,
    "B_amount": 1600
  },
  {
    "timestamp": "2026-10-01T07:02:51.363Z",
    "A": 47,
    "A_amount": 7450,
    "B": 13,
    "B_amount": 1890
  },
  {
    "timestamp": "2026-10-02T01:03:22.892Z",
    "A": 55,
    "A_amount": 8580,
    "B": 13,
    "B_amount": 1890
  },
  {
    "timestamp": "2026-10-02T07:17:20.168Z",
    "A": 34,
    "A_amount": 5010,
    "B": 17,
    "B_amount": 2310
  },
  {
    "timestamp": "2026-10-05T02:12:29.676Z",
    "A": 30,
    "A_amount": 4540,
    "B": 23,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-10-05T07:10:30.242Z",
    "A": 34,
    "A_amount": 5150,
    "B": 27,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-10-06T01:03:53.561Z",
    "A": 36,
    "A_amount": 5240,
    "B": 29,
    "B_amount": 4150
  },
  {
    "timestamp": "2026-10-06T07:04:25.168Z",
    "A": 38,
    "A_amount": 5400,
    "B": 25,
    "B_amount": 3510
  },
  {
    "timestamp": "2026-10-07T01:04:57.450Z",
    "A": 40,
    "A_amount": 5630,
    "B": 28,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-07T07:05:27.278Z",
    "A": 44,
    "A_amount": 6080,
    "B": 22,
    "B_amount": 2840
  },
  {
    "timestamp": "2026-10-08T01:05:58.318Z",
    "A": 36,
    "A_amount": 4690,
    "B": 31,
    "B_amount": 4080
  },
  {
    "timestamp": "2026-10-08T07:06:28.249Z",
    "A": 41,
    "A_amount": 5680,
    "B": 29,
    "B_amount": 3970
  },
  {
    "timestamp": "2026-10-09T01:07:08.071Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-09T07:07:47.858Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-10T01:08:15.231Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-10T07:08:43.751Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-11T01:09:22.972Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-11T07:02:06.421Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-12T01:02:35.533Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-12T07:03:05.742Z",
    "A": 42,
    "A_amount": 5830,
    "B": 27,
    "B_amount": 3720
  },
  {
    "timestamp": "2026-10-13T01:03:35.852Z",
    "A": 35,
    "A_amount": 4970,
    "B": 36,
    "B_amount": 4740
  },
  {
    "timestamp": "2026-10-13T07:03:40.686Z",
    "A": 41,
    "A_amount": 5830,
    "B": 31,
    "B_amount": 3990
  },
  {
    "timestamp": "2026-10-14T01:04:09.686Z",
    "A": 43,
    "A_amount": 6350,
    "B": 36,
    "B_amount": 4380
  },
  {
    "timestamp": "2026-10-15T01:01:05.455Z",
    "A": 39,
    "A_amount": 5690,
    "B": 37,
    "B_amount": 4635
  },
  {
    "timestamp": "2026-10-15T07:01:37.717Z",
    "A": 36,
    "A_amount": 5240,
    "B": 29,
    "B_amount": 3625
  },
  {
    "timestamp": "2026-10-16T01:02:07.159Z",
    "A": 35,
    "A_amount": 5040,
    "B": 30,
    "B_amount": 3825
  },
  {
    "timestamp": "2026-10-16T07:02:36.560Z",
    "A": 36,
    "A_amount": 5120,
    "B": 18,
    "B_amount": 2335
  },
  {
    "timestamp": "2026-10-17T01:03:18.569Z",
    "A": 35,
    "A_amount": 5020,
    "B": 18,
    "B_amount": 2280
  }
];
