
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "6",
    "已進件待核准金額": "1120",
    "已准待撥件數": "9",
    "已准待撥": "1370",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "870"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "4",
    "已進件待核准金額": "900",
    "已准待撥件數": "14",
    "已准待撥": "2350",
    "已准待對保件數": "10",
    "已准待對保金額": "1790",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "560"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "180",
    "已准待撥件數": "5",
    "已准待撥": "630",
    "已准待對保件數": "3",
    "已准待對保金額": "280",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "4",
    "已進件待核准金額": "700",
    "已准待撥件數": "8",
    "已准待撥": "1620",
    "已准待對保件數": "3",
    "已准待對保金額": "600",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "1020"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "1",
    "已進件待核准金額": "50",
    "已准待撥件數": "6",
    "已准待撥": "830",
    "已准待對保件數": "4",
    "已准待對保金額": "330",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "50",
    "已准待撥件數": "5",
    "已准待撥": "740",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "590"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "530",
    "已准待撥件數": "9",
    "已准待撥": "1420",
    "已准待對保件數": "5",
    "已准待對保金額": "900",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "520"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "100",
    "已准待對保件數": "1",
    "已准待對保金額": "100",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "5",
    "已准待撥": "680",
    "已准待對保件數": "2",
    "已准待對保金額": "360",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "320"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "430",
    "已准待撥件數": "4",
    "已准待撥": "300",
    "已准待對保件數": "1",
    "已准待對保金額": "80",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1050",
    "已准待撥件數": "10",
    "已准待撥": "1140",
    "已准待對保件數": "6",
    "已准待對保金額": "760",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "總和",
    "已進件待核准": "27",
    "已進件待核准金額": "5760",
    "已准待撥件數": "76",
    "已准待撥": "11180",
    "已准待對保件數": "39",
    "已准待對保金額": "5850",
    "已對保待撥件數的SUM": "36",
    "已對保待撥金額的SUM": "5460"
  }
];
const historyData = [
  {
    "timestamp": "2026-03-10T21:24:01.767Z",
    "A": 25,
    "A_amount": 500,
    "B": 20,
    "B_amount": 300
  },
  {
    "timestamp": "2026-03-11T01:21:24.190Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:27:16.958Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:34:41.003Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:36:27.109Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T02:06:29.182Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T07:44:48.084Z",
    "A": 39,
    "A_amount": 6215,
    "B": 28,
    "B_amount": 3930
  },
  {
    "timestamp": "2026-03-12T01:08:14.755Z",
    "A": 39,
    "A_amount": 6070,
    "B": 32,
    "B_amount": 4515
  },
  {
    "timestamp": "2026-03-12T07:08:19.451Z",
    "A": 40,
    "A_amount": 6060,
    "B": 32,
    "B_amount": 4505
  },
  {
    "timestamp": "2026-03-13T01:08:25.586Z",
    "A": 42,
    "A_amount": 6220,
    "B": 37,
    "B_amount": 4895
  },
  {
    "timestamp": "2026-03-13T07:08:33.405Z",
    "A": 49,
    "A_amount": 7390,
    "B": 30,
    "B_amount": 4065
  },
  {
    "timestamp": "2026-03-16T01:02:23.407Z",
    "A": 43,
    "A_amount": 6300,
    "B": 38,
    "B_amount": 5275
  },
  {
    "timestamp": "2026-03-16T07:02:28.318Z",
    "A": 40,
    "A_amount": 6140,
    "B": 35,
    "B_amount": 4425
  },
  {
    "timestamp": "2026-03-17T01:02:33.429Z",
    "A": 39,
    "A_amount": 5990,
    "B": 40,
    "B_amount": 4955
  },
  {
    "timestamp": "2026-03-17T07:02:38.680Z",
    "A": 45,
    "A_amount": 6770,
    "B": 35,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-03-18T01:03:31.874Z",
    "A": 48,
    "A_amount": 7270,
    "B": 38,
    "B_amount": 4410
  },
  {
    "timestamp": "2026-03-19T07:11:01.086Z",
    "A": 47,
    "A_amount": 7310,
    "B": 34,
    "B_amount": 4170
  },
  {
    "timestamp": "2026-03-20T07:04:50.936Z",
    "A": 57,
    "A_amount": 8560,
    "B": 30,
    "B_amount": 3880
  },
  {
    "timestamp": "2026-03-23T01:01:47.111Z",
    "A": 54,
    "A_amount": 8070,
    "B": 38,
    "B_amount": 5220
  },
  {
    "timestamp": "2026-03-23T07:01:53.709Z",
    "A": 36,
    "A_amount": 5390,
    "B": 41,
    "B_amount": 5760
  },
  {
    "timestamp": "2026-03-24T01:01:58.668Z",
    "A": 39,
    "A_amount": 5830,
    "B": 43,
    "B_amount": 6140
  },
  {
    "timestamp": "2026-03-24T07:02:04.452Z",
    "A": 39,
    "A_amount": 5850,
    "B": 36,
    "B_amount": 5460
  }
];
