
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "11",
    "已進件待核准金額": "2460",
    "已准待撥件數": "13",
    "已准待撥": "1410",
    "已准待對保件數": "6",
    "已准待對保金額": "810",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "900"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "8",
    "已進件待核准金額": "2090",
    "已准待撥件數": "6",
    "已准待撥": "780",
    "已准待對保件數": "4",
    "已准待對保金額": "600",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "180"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "550",
    "已准待撥件數": "7",
    "已准待撥": "860",
    "已准待對保件數": "3",
    "已准待對保金額": "620",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "240"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "11",
    "已准待撥": "1800",
    "已准待對保件數": "6",
    "已准待對保金額": "1170",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "630"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "7",
    "已進件待核准金額": "2450",
    "已准待撥件數": "6",
    "已准待撥": "720",
    "已准待對保件數": "5",
    "已准待對保金額": "620",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "100"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "2",
    "已准待撥": "140",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "140"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "7",
    "已准待撥": "1130",
    "已准待對保件數": "5",
    "已准待對保金額": "900",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "230"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "1150",
    "已准待撥件數": "6",
    "已准待撥": "920",
    "已准待對保件數": "2",
    "已准待對保金額": "420",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "350",
    "已准待撥件數": "6",
    "已准待撥": "340",
    "已准待對保件數": "2",
    "已准待對保金額": "110",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "230"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1350",
    "已准待撥件數": "7",
    "已准待撥": "630",
    "已准待對保件數": "1",
    "已准待對保金額": "100",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "530"
  },
  {
    "經辦": "總和",
    "已進件待核准": "43",
    "已進件待核准金額": "11380",
    "已准待撥件數": "71",
    "已准待撥": "8730",
    "已准待對保件數": "34",
    "已准待對保金額": "5350",
    "已對保待撥件數的SUM": "36",
    "已對保待撥金額的SUM": "3680"
  }
];
const historyData = [
  {
    "timestamp": "2026-09-02T01:07:29.331Z",
    "A": 28,
    "A_amount": 4570,
    "B": 20,
    "B_amount": 3060
  },
  {
    "timestamp": "2026-09-02T07:08:05.649Z",
    "A": 32,
    "A_amount": 5270,
    "B": 20,
    "B_amount": 3010
  },
  {
    "timestamp": "2026-09-03T01:08:37.492Z",
    "A": 28,
    "A_amount": 4570,
    "B": 28,
    "B_amount": 4140
  },
  {
    "timestamp": "2026-09-03T07:09:10.461Z",
    "A": 32,
    "A_amount": 5170,
    "B": 23,
    "B_amount": 3650
  },
  {
    "timestamp": "2026-09-04T01:09:40.441Z",
    "A": 32,
    "A_amount": 5450,
    "B": 28,
    "B_amount": 4200
  },
  {
    "timestamp": "2026-09-04T07:10:10.236Z",
    "A": 33,
    "A_amount": 5580,
    "B": 21,
    "B_amount": 3160
  },
  {
    "timestamp": "2026-09-05T01:10:49.316Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-05T07:11:29.245Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-06T01:11:58.737Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-06T07:12:36.819Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-07T01:13:07.172Z",
    "A": 33,
    "A_amount": 5930,
    "B": 24,
    "B_amount": 2990
  },
  {
    "timestamp": "2026-09-07T07:13:40.564Z",
    "A": 37,
    "A_amount": 6310,
    "B": 19,
    "B_amount": 2370
  },
  {
    "timestamp": "2026-09-08T01:14:13.619Z",
    "A": 36,
    "A_amount": 6000,
    "B": 23,
    "B_amount": 3070
  },
  {
    "timestamp": "2026-09-08T07:14:42.624Z",
    "A": 37,
    "A_amount": 5790,
    "B": 25,
    "B_amount": 3350
  },
  {
    "timestamp": "2026-09-09T01:15:15.387Z",
    "A": 37,
    "A_amount": 5910,
    "B": 28,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-09-09T07:02:45.319Z",
    "A": 40,
    "A_amount": 6230,
    "B": 23,
    "B_amount": 3060
  },
  {
    "timestamp": "2026-09-10T01:03:54.764Z",
    "A": 36,
    "A_amount": 6140,
    "B": 28,
    "B_amount": 3490
  },
  {
    "timestamp": "2026-09-10T07:04:28.723Z",
    "A": 23,
    "A_amount": 3410,
    "B": 28,
    "B_amount": 3540
  },
  {
    "timestamp": "2026-09-11T01:00:27.863Z",
    "A": 25,
    "A_amount": 3640,
    "B": 33,
    "B_amount": 4320
  },
  {
    "timestamp": "2026-09-11T07:00:54.826Z",
    "A": 32,
    "A_amount": 4600,
    "B": 27,
    "B_amount": 3430
  },
  {
    "timestamp": "2026-09-16T07:00:29.601Z",
    "A": 35,
    "A_amount": 4910,
    "B": 27,
    "B_amount": 3560
  },
  {
    "timestamp": "2026-09-17T01:01:02.343Z",
    "A": 32,
    "A_amount": 4550,
    "B": 32,
    "B_amount": 3960
  },
  {
    "timestamp": "2026-09-17T07:01:35.920Z",
    "A": 36,
    "A_amount": 5390,
    "B": 25,
    "B_amount": 2850
  },
  {
    "timestamp": "2026-09-18T01:02:10.494Z",
    "A": 38,
    "A_amount": 5630,
    "B": 28,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-09-18T07:02:41.825Z",
    "A": 44,
    "A_amount": 6390,
    "B": 23,
    "B_amount": 2420
  },
  {
    "timestamp": "2026-09-19T01:03:11.570Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-19T07:03:39.961Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-20T01:04:22.556Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-20T07:05:03.504Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-21T01:05:37.350Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  }
];
