
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "10",
    "已進件待核准金額": "1678",
    "已准待撥件數": "10",
    "已准待撥": "1460",
    "已准待對保件數": "7",
    "已准待對保金額": "1190",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "270"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "8",
    "已進件待核准金額": "1640",
    "已准待撥件數": "11",
    "已准待撥": "1280",
    "已准待對保件數": "7",
    "已准待對保金額": "590",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "690"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "410",
    "已准待撥件數": "6",
    "已准待撥": "840",
    "已准待對保件數": "3",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "520"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "780",
    "已准待撥件數": "13",
    "已准待撥": "2230",
    "已准待對保件數": "9",
    "已准待對保金額": "1730",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "750",
    "已准待撥件數": "13",
    "已准待撥": "1710",
    "已准待對保件數": "10",
    "已准待對保金額": "1320",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "390"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "2",
    "已進件待核准金額": "500",
    "已准待撥件數": "6",
    "已准待撥": "970",
    "已准待對保件數": "3",
    "已准待對保金額": "410",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "560"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "430",
    "已准待撥件數": "9",
    "已准待撥": "1460",
    "已准待對保件數": "7",
    "已准待對保金額": "1260",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "5",
    "已進件待核准金額": "1280",
    "已准待撥件數": "7",
    "已准待撥": "700",
    "已准待對保件數": "5",
    "已准待對保金額": "400",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "4",
    "已准待撥": "580",
    "已准待對保件數": "2",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "260"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1300",
    "已准待撥件數": "4",
    "已准待撥": "340",
    "已准待對保件數": "3",
    "已准待對保金額": "140",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "總和",
    "已進件待核准": "40",
    "已進件待核准金額": "9068",
    "已准待撥件數": "83",
    "已准待撥": "11570",
    "已准待對保件數": "56",
    "已准待對保金額": "7680",
    "已對保待撥件數的SUM": "27",
    "已對保待撥金額的SUM": "3890"
  }
];
const historyData = [
  {
    "timestamp": "2026-06-26T07:02:23.303Z",
    "A": 43,
    "A_amount": 6305,
    "B": 25,
    "B_amount": 3300
  },
  {
    "timestamp": "2026-06-27T01:02:41.687Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-27T07:03:00.413Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-28T01:03:20.322Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-28T07:03:38.357Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-29T01:03:45.314Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-29T07:03:51.353Z",
    "A": 35,
    "A_amount": 4945,
    "B": 25,
    "B_amount": 3670
  },
  {
    "timestamp": "2026-06-30T01:03:59.162Z",
    "A": 39,
    "A_amount": 5305,
    "B": 23,
    "B_amount": 3270
  },
  {
    "timestamp": "2026-06-30T07:04:05.541Z",
    "A": 38,
    "A_amount": 5365,
    "B": 17,
    "B_amount": 2290
  },
  {
    "timestamp": "2026-07-01T01:04:14.589Z",
    "A": 33,
    "A_amount": 4920,
    "B": 24,
    "B_amount": 3005
  },
  {
    "timestamp": "2026-07-01T07:04:20.561Z",
    "A": 36,
    "A_amount": 5370,
    "B": 22,
    "B_amount": 2850
  },
  {
    "timestamp": "2026-07-02T01:04:30.778Z",
    "A": 32,
    "A_amount": 4760,
    "B": 28,
    "B_amount": 3610
  },
  {
    "timestamp": "2026-07-02T07:04:35.900Z",
    "A": 38,
    "A_amount": 5580,
    "B": 19,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-07-06T07:00:08.964Z",
    "A": 43,
    "A_amount": 6720,
    "B": 26,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-07-07T01:00:18.419Z",
    "A": 41,
    "A_amount": 6560,
    "B": 31,
    "B_amount": 4420
  },
  {
    "timestamp": "2026-07-07T07:00:25.385Z",
    "A": 42,
    "A_amount": 6750,
    "B": 21,
    "B_amount": 2985
  },
  {
    "timestamp": "2026-07-08T01:00:32.575Z",
    "A": 42,
    "A_amount": 6540,
    "B": 25,
    "B_amount": 3575
  },
  {
    "timestamp": "2026-07-08T07:00:40.297Z",
    "A": 48,
    "A_amount": 7350,
    "B": 19,
    "B_amount": 2805
  },
  {
    "timestamp": "2026-07-09T01:00:48.853Z",
    "A": 49,
    "A_amount": 7360,
    "B": 24,
    "B_amount": 3575
  },
  {
    "timestamp": "2026-07-09T07:00:57.254Z",
    "A": 56,
    "A_amount": 8020,
    "B": 17,
    "B_amount": 2630
  },
  {
    "timestamp": "2026-07-10T01:01:06.009Z",
    "A": 54,
    "A_amount": 7550,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-07-10T07:01:13.532Z",
    "A": 54,
    "A_amount": 7550,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-07-11T01:01:34.241Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-11T07:01:52.154Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-12T01:02:13.842Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-12T07:02:18.882Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-13T01:02:28.116Z",
    "A": 49,
    "A_amount": 7100,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-07-13T07:02:34.229Z",
    "A": 53,
    "A_amount": 7780,
    "B": 25,
    "B_amount": 3630
  },
  {
    "timestamp": "2026-07-14T01:02:42.692Z",
    "A": 49,
    "A_amount": 7110,
    "B": 34,
    "B_amount": 5090
  },
  {
    "timestamp": "2026-07-14T07:02:48.578Z",
    "A": 56,
    "A_amount": 7680,
    "B": 27,
    "B_amount": 3890
  }
];
