
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "8",
    "已進件待核准金額": "1310",
    "已准待撥件數": "5",
    "已准待撥": "630",
    "已准待對保件數": "3",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1280",
    "已准待撥件數": "9",
    "已准待撥": "1100",
    "已准待對保件數": "8",
    "已准待對保金額": "950",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "430",
    "已准待撥件數": "11",
    "已准待撥": "1250",
    "已准待對保件數": "7",
    "已准待對保金額": "750",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "12",
    "已准待撥": "1510",
    "已准待對保件數": "9",
    "已准待對保金額": "1130",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "300",
    "已准待撥件數": "9",
    "已准待撥": "680",
    "已准待對保件數": "5",
    "已准待對保金額": "440",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "240"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "10",
    "已准待撥": "1370",
    "已准待對保件數": "7",
    "已准待對保金額": "890",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "480"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "310",
    "已准待撥件數": "6",
    "已准待撥": "870",
    "已准待對保件數": "4",
    "已准待對保金額": "420",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "200",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "1",
    "已准待撥": "70",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "70"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "7",
    "已准待撥": "760",
    "已准待對保件數": "7",
    "已准待對保金額": "760",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1500",
    "已准待撥件數": "7",
    "已准待撥": "1070",
    "已准待對保件數": "7",
    "已准待對保金額": "1070",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "總和",
    "已進件待核准": "30",
    "已進件待核准金額": "6480",
    "已准待撥件數": "78",
    "已准待撥": "9510",
    "已准待對保件數": "57",
    "已准待對保金額": "6710",
    "已對保待撥件數的SUM": "21",
    "已對保待撥金額的SUM": "2800"
  }
];
const historyData = [
  {
    "timestamp": "2026-04-17T02:00:39.437Z",
    "A": 39,
    "A_amount": 4780,
    "B": 40,
    "B_amount": 5400
  },
  {
    "timestamp": "2026-04-17T07:00:22.558Z",
    "A": 40,
    "A_amount": 4840,
    "B": 38,
    "B_amount": 5050
  },
  {
    "timestamp": "2026-04-18T01:00:41.234Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-18T07:00:57.667Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-19T01:01:02.400Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-19T07:01:07.652Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-20T01:01:14.550Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-20T07:01:19.496Z",
    "A": 47,
    "A_amount": 5870,
    "B": 30,
    "B_amount": 3640
  },
  {
    "timestamp": "2026-04-21T01:01:26.696Z",
    "A": 44,
    "A_amount": 5570,
    "B": 34,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-04-21T07:01:31.959Z",
    "A": 47,
    "A_amount": 6010,
    "B": 27,
    "B_amount": 3660
  },
  {
    "timestamp": "2026-04-22T01:01:37.865Z",
    "A": 43,
    "A_amount": 5230,
    "B": 35,
    "B_amount": 4695
  },
  {
    "timestamp": "2026-04-22T07:01:43.888Z",
    "A": 48,
    "A_amount": 5680,
    "B": 37,
    "B_amount": 4965
  },
  {
    "timestamp": "2026-04-23T01:01:48.843Z",
    "A": 48,
    "A_amount": 5920,
    "B": 38,
    "B_amount": 4985
  },
  {
    "timestamp": "2026-04-23T07:01:54.943Z",
    "A": 45,
    "A_amount": 5440,
    "B": 36,
    "B_amount": 4745
  },
  {
    "timestamp": "2026-04-24T01:02:01.525Z",
    "A": 43,
    "A_amount": 5250,
    "B": 43,
    "B_amount": 5485
  },
  {
    "timestamp": "2026-04-24T07:02:08.993Z",
    "A": 56,
    "A_amount": 6550,
    "B": 36,
    "B_amount": 4345
  },
  {
    "timestamp": "2026-04-25T01:02:26.018Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-25T07:02:31.439Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-26T01:02:47.688Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-26T07:03:05.613Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-27T01:03:11.767Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-27T07:03:17.915Z",
    "A": 50,
    "A_amount": 6230,
    "B": 46,
    "B_amount": 5285
  },
  {
    "timestamp": "2026-04-28T01:03:24.769Z",
    "A": 47,
    "A_amount": 5830,
    "B": 43,
    "B_amount": 4920
  },
  {
    "timestamp": "2026-04-28T07:03:30.540Z",
    "A": 50,
    "A_amount": 6360,
    "B": 31,
    "B_amount": 3390
  },
  {
    "timestamp": "2026-04-29T01:03:37.392Z",
    "A": 47,
    "A_amount": 5590,
    "B": 39,
    "B_amount": 4770
  },
  {
    "timestamp": "2026-04-29T07:03:43.775Z",
    "A": 49,
    "A_amount": 5980,
    "B": 28,
    "B_amount": 3590
  },
  {
    "timestamp": "2026-04-30T01:03:52.057Z",
    "A": 52,
    "A_amount": 6110,
    "B": 30,
    "B_amount": 3870
  },
  {
    "timestamp": "2026-04-30T07:03:57.617Z",
    "A": 58,
    "A_amount": 6870,
    "B": 18,
    "B_amount": 2450
  },
  {
    "timestamp": "2026-05-01T01:04:09.366Z",
    "A": 57,
    "A_amount": 6710,
    "B": 21,
    "B_amount": 2800
  },
  {
    "timestamp": "2026-05-01T07:04:15.628Z",
    "A": 57,
    "A_amount": 6710,
    "B": 21,
    "B_amount": 2800
  }
];
