
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "13",
    "已進件待核准金額": "2910",
    "已准待撥件數": "10",
    "已准待撥": "1250",
    "已准待對保件數": "5",
    "已准待對保金額": "530",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "720"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1390",
    "已准待撥件數": "8",
    "已准待撥": "1280",
    "已准待對保件數": "3",
    "已准待對保金額": "490",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "790"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "300",
    "已准待撥件數": "7",
    "已准待撥": "1030",
    "已准待對保件數": "2",
    "已准待對保金額": "350",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "680"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "6",
    "已准待撥": "660",
    "已准待對保件數": "3",
    "已准待對保金額": "230",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "430"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "6",
    "已進件待核准金額": "2050",
    "已准待撥件數": "7",
    "已准待撥": "950",
    "已准待對保件數": "2",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "9",
    "已准待撥": "1500",
    "已准待對保件數": "8",
    "已准待對保金額": "1450",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "50"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "8",
    "已准待撥": "810",
    "已准待對保件數": "4",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "490"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "6",
    "已進件待核准金額": "1450",
    "已准待撥件數": "1",
    "已准待撥": "150",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "7",
    "已准待撥": "840",
    "已准待對保件數": "3",
    "已准待對保金額": "350",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "490"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "7",
    "已進件待核准金額": "1775",
    "已准待撥件數": "9",
    "已准待撥": "1390",
    "已准待對保件數": "6",
    "已准待對保金額": "980",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "410"
  },
  {
    "經辦": "總和",
    "已進件待核准": "44",
    "已進件待核准金額": "11005",
    "已准待撥件數": "72",
    "已准待撥": "9860",
    "已准待對保件數": "37",
    "已准待對保金額": "5170",
    "已對保待撥件數的SUM": "34",
    "已對保待撥金額的SUM": "4710"
  }
];
const historyData = [
  {
    "timestamp": "2026-09-24T07:02:14.345Z",
    "A": 30,
    "A_amount": 4850,
    "B": 25,
    "B_amount": 3570
  },
  {
    "timestamp": "2026-09-25T01:02:55.320Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-25T07:03:12.913Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-26T01:03:43.252Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-26T07:04:00.036Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-27T01:04:40.044Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-27T07:05:20.741Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-28T01:05:48.966Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-28T07:06:30.819Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-29T01:07:02.241Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-29T07:00:43.897Z",
    "A": 34,
    "A_amount": 5470,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-09-30T01:01:16.421Z",
    "A": 36,
    "A_amount": 5690,
    "B": 26,
    "B_amount": 3790
  },
  {
    "timestamp": "2026-09-30T07:01:51.501Z",
    "A": 42,
    "A_amount": 6820,
    "B": 9,
    "B_amount": 1300
  },
  {
    "timestamp": "2026-10-01T01:02:22.160Z",
    "A": 46,
    "A_amount": 7430,
    "B": 11,
    "B_amount": 1600
  },
  {
    "timestamp": "2026-10-01T07:02:51.363Z",
    "A": 47,
    "A_amount": 7450,
    "B": 13,
    "B_amount": 1890
  },
  {
    "timestamp": "2026-10-02T01:03:22.892Z",
    "A": 55,
    "A_amount": 8580,
    "B": 13,
    "B_amount": 1890
  },
  {
    "timestamp": "2026-10-02T07:17:20.168Z",
    "A": 34,
    "A_amount": 5010,
    "B": 17,
    "B_amount": 2310
  },
  {
    "timestamp": "2026-10-05T02:12:29.676Z",
    "A": 30,
    "A_amount": 4540,
    "B": 23,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-10-05T07:10:30.242Z",
    "A": 34,
    "A_amount": 5150,
    "B": 27,
    "B_amount": 3740
  },
  {
    "timestamp": "2026-10-06T01:03:53.561Z",
    "A": 36,
    "A_amount": 5240,
    "B": 29,
    "B_amount": 4150
  },
  {
    "timestamp": "2026-10-06T07:04:25.168Z",
    "A": 38,
    "A_amount": 5400,
    "B": 25,
    "B_amount": 3510
  },
  {
    "timestamp": "2026-10-07T01:04:57.450Z",
    "A": 40,
    "A_amount": 5630,
    "B": 28,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-10-07T07:05:27.278Z",
    "A": 44,
    "A_amount": 6080,
    "B": 22,
    "B_amount": 2840
  },
  {
    "timestamp": "2026-10-08T01:05:58.318Z",
    "A": 36,
    "A_amount": 4690,
    "B": 31,
    "B_amount": 4080
  },
  {
    "timestamp": "2026-10-08T07:06:28.249Z",
    "A": 41,
    "A_amount": 5680,
    "B": 29,
    "B_amount": 3970
  },
  {
    "timestamp": "2026-10-09T01:07:08.071Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-09T07:07:47.858Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-10T01:08:15.231Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-10T07:08:43.751Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  },
  {
    "timestamp": "2026-10-11T01:09:22.972Z",
    "A": 37,
    "A_amount": 5170,
    "B": 34,
    "B_amount": 4710
  }
];
