
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "8",
    "已進件待核准金額": "1590",
    "已准待撥件數": "9",
    "已准待撥": "1870",
    "已准待對保件數": "6",
    "已准待對保金額": "1280",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "590"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "4",
    "已進件待核准金額": "900",
    "已准待撥件數": "14",
    "已准待撥": "2220",
    "已准待對保件數": "8",
    "已准待對保金額": "1300",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "920"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "250",
    "已准待撥件數": "8",
    "已准待撥": "920",
    "已准待對保件數": "4",
    "已准待對保金額": "370",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "550"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "2",
    "已准待撥": "400",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "3",
    "已進件待核准金額": "1050",
    "已准待撥件數": "12",
    "已准待撥": "1470",
    "已准待對保件數": "8",
    "已准待對保金額": "990",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "480"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "250",
    "已准待撥件數": "10",
    "已准待撥": "1300",
    "已准待對保件數": "8",
    "已准待對保金額": "970",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "5",
    "已准待撥": "680",
    "已准待對保件數": "1",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "550",
    "已准待撥件數": "6",
    "已准待撥": "810",
    "已准待對保件數": "6",
    "已准待對保金額": "810",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "8",
    "已准待撥": "1480",
    "已准待對保件數": "5",
    "已准待對保金額": "1030",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1200",
    "已准待撥件數": "11",
    "已准待撥": "1535",
    "已准待對保件數": "7",
    "已准待對保金額": "1045",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "490"
  },
  {
    "經辦": "總和",
    "已進件待核准": "27",
    "已進件待核准金額": "6620",
    "已准待撥件數": "85",
    "已准待撥": "12685",
    "已准待對保件數": "53",
    "已准待對保金額": "8095",
    "已對保待撥件數的SUM": "32",
    "已對保待撥金額的SUM": "4590"
  }
];
const historyData = [
  {
    "timestamp": "2026-05-20T01:02:45.193Z",
    "A": 43,
    "A_amount": 6310,
    "B": 57,
    "B_amount": 7780
  },
  {
    "timestamp": "2026-05-20T07:02:52.368Z",
    "A": 46,
    "A_amount": 6920,
    "B": 52,
    "B_amount": 6760
  },
  {
    "timestamp": "2026-05-21T01:03:00.967Z",
    "A": 42,
    "A_amount": 6610,
    "B": 58,
    "B_amount": 7390
  },
  {
    "timestamp": "2026-05-21T07:39:16.624Z",
    "A": 37,
    "A_amount": 5660,
    "B": 43,
    "B_amount": 6380
  },
  {
    "timestamp": "2026-05-22T01:05:52.460Z",
    "A": 36,
    "A_amount": 5520,
    "B": 47,
    "B_amount": 6980
  },
  {
    "timestamp": "2026-05-22T07:05:58.936Z",
    "A": 43,
    "A_amount": 6420,
    "B": 29,
    "B_amount": 4500
  },
  {
    "timestamp": "2026-05-23T01:06:15.477Z",
    "A": 42,
    "A_amount": 6150,
    "B": 32,
    "B_amount": 4660
  },
  {
    "timestamp": "2026-05-23T07:06:32.368Z",
    "A": 42,
    "A_amount": 6150,
    "B": 32,
    "B_amount": 4660
  },
  {
    "timestamp": "2026-05-24T01:06:37.964Z",
    "A": 42,
    "A_amount": 6150,
    "B": 32,
    "B_amount": 4660
  },
  {
    "timestamp": "2026-05-24T07:06:42.772Z",
    "A": 42,
    "A_amount": 6150,
    "B": 32,
    "B_amount": 4660
  },
  {
    "timestamp": "2026-05-25T01:06:49.002Z",
    "A": 41,
    "A_amount": 6070,
    "B": 33,
    "B_amount": 4740
  },
  {
    "timestamp": "2026-05-25T07:00:07.546Z",
    "A": 42,
    "A_amount": 6690,
    "B": 31,
    "B_amount": 4430
  },
  {
    "timestamp": "2026-05-26T01:00:13.218Z",
    "A": 38,
    "A_amount": 5850,
    "B": 37,
    "B_amount": 5490
  },
  {
    "timestamp": "2026-05-26T07:00:19.126Z",
    "A": 42,
    "A_amount": 8940,
    "B": 27,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-05-27T01:00:26.391Z",
    "A": 41,
    "A_amount": 6590,
    "B": 31,
    "B_amount": 4300
  },
  {
    "timestamp": "2026-05-28T02:24:06.345Z",
    "A": 50,
    "A_amount": 7740,
    "B": 29,
    "B_amount": 3800
  },
  {
    "timestamp": "2026-05-28T07:00:20.212Z",
    "A": 53,
    "A_amount": 8200,
    "B": 23,
    "B_amount": 3100
  },
  {
    "timestamp": "2026-05-29T01:00:27.114Z",
    "A": 59,
    "A_amount": 9150,
    "B": 21,
    "B_amount": 2970
  },
  {
    "timestamp": "2026-05-29T07:00:34.196Z",
    "A": 46,
    "A_amount": 6950,
    "B": 20,
    "B_amount": 2940
  },
  {
    "timestamp": "2026-05-30T01:00:52.248Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-30T07:01:09.288Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-31T01:01:15.578Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-31T07:01:34.645Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-06-01T01:01:41.742Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-06-01T07:01:47.558Z",
    "A": 50,
    "A_amount": 7495,
    "B": 26,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-06-02T01:01:52.556Z",
    "A": 43,
    "A_amount": 6385,
    "B": 34,
    "B_amount": 5320
  },
  {
    "timestamp": "2026-06-02T07:01:59.106Z",
    "A": 51,
    "A_amount": 7485,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-06-03T01:02:06.925Z",
    "A": 52,
    "A_amount": 7895,
    "B": 34,
    "B_amount": 4570
  },
  {
    "timestamp": "2026-06-03T07:02:14.011Z",
    "A": 56,
    "A_amount": 8565,
    "B": 27,
    "B_amount": 3720
  },
  {
    "timestamp": "2026-06-04T01:02:21.904Z",
    "A": 53,
    "A_amount": 8095,
    "B": 32,
    "B_amount": 4590
  }
];
