
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "4",
    "已進件待核准金額": "670",
    "已准待撥件數": "7",
    "已准待撥": "930",
    "已准待對保件數": "3",
    "已准待對保金額": "550",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1150",
    "已准待撥件數": "12",
    "已准待撥": "2030",
    "已准待對保件數": "7",
    "已准待對保金額": "1230",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "800"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "180",
    "已准待撥件數": "11",
    "已准待撥": "1170",
    "已准待對保件數": "6",
    "已准待對保金額": "510",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "660"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "8",
    "已准待撥": "1460",
    "已准待對保件數": "6",
    "已准待對保金額": "1280",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "180"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "1",
    "已進件待核准金額": "250",
    "已准待撥件數": "9",
    "已准待撥": "1240",
    "已准待對保件數": "3",
    "已准待對保金額": "250",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "990"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "2",
    "已進件待核准金額": "250",
    "已准待撥件數": "5",
    "已准待撥": "590",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "440"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "8",
    "已准待撥": "940",
    "已准待對保件數": "5",
    "已准待對保金額": "630",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "310"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "3",
    "已准待撥": "560",
    "已准待對保件數": "2",
    "已准待對保金額": "460",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "100"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "5",
    "已進件待核准金額": "660",
    "已准待撥件數": "3",
    "已准待撥": "330",
    "已准待對保件數": "3",
    "已准待對保金額": "330",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1210",
    "已准待撥件數": "14",
    "已准待撥": "1680",
    "已准待對保件數": "9",
    "已准待對保金額": "1380",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "總和",
    "已進件待核准": "29",
    "已進件待核准金額": "6000",
    "已准待撥件數": "80",
    "已准待撥": "10930",
    "已准待對保件數": "45",
    "已准待對保金額": "6770",
    "已對保待撥件數的SUM": "35",
    "已對保待撥金額的SUM": "4160"
  }
];
const historyData = [
  {
    "timestamp": "2026-03-10T21:24:01.767Z",
    "A": 25,
    "A_amount": 500,
    "B": 20,
    "B_amount": 300
  },
  {
    "timestamp": "2026-03-11T01:21:24.190Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:27:16.958Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:34:41.003Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:36:27.109Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T02:06:29.182Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T07:44:48.084Z",
    "A": 39,
    "A_amount": 6215,
    "B": 28,
    "B_amount": 3930
  },
  {
    "timestamp": "2026-03-12T01:08:14.755Z",
    "A": 39,
    "A_amount": 6070,
    "B": 32,
    "B_amount": 4515
  },
  {
    "timestamp": "2026-03-12T07:08:19.451Z",
    "A": 40,
    "A_amount": 6060,
    "B": 32,
    "B_amount": 4505
  },
  {
    "timestamp": "2026-03-13T01:08:25.586Z",
    "A": 42,
    "A_amount": 6220,
    "B": 37,
    "B_amount": 4895
  },
  {
    "timestamp": "2026-03-13T07:08:33.405Z",
    "A": 49,
    "A_amount": 7390,
    "B": 30,
    "B_amount": 4065
  },
  {
    "timestamp": "2026-03-16T01:02:23.407Z",
    "A": 43,
    "A_amount": 6300,
    "B": 38,
    "B_amount": 5275
  },
  {
    "timestamp": "2026-03-16T07:02:28.318Z",
    "A": 40,
    "A_amount": 6140,
    "B": 35,
    "B_amount": 4425
  },
  {
    "timestamp": "2026-03-17T01:02:33.429Z",
    "A": 39,
    "A_amount": 5990,
    "B": 40,
    "B_amount": 4955
  },
  {
    "timestamp": "2026-03-17T07:02:38.680Z",
    "A": 45,
    "A_amount": 6770,
    "B": 35,
    "B_amount": 4160
  }
];
