
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "5",
    "已進件待核准金額": "970",
    "已准待撥件數": "9",
    "已准待撥": "1380",
    "已准待對保件數": "4",
    "已准待對保金額": "620",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "760"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1200",
    "已准待撥件數": "12",
    "已准待撥": "1810",
    "已准待對保件數": "6",
    "已准待對保金額": "910",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "900"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "280",
    "已准待撥件數": "6",
    "已准待撥": "710",
    "已准待對保件數": "3",
    "已准待對保金額": "450",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "260"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "400",
    "已准待撥件數": "9",
    "已准待撥": "1670",
    "已准待對保件數": "4",
    "已准待對保金額": "800",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "870"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "3",
    "已進件待核准金額": "500",
    "已准待撥件數": "6",
    "已准待撥": "940",
    "已准待對保件數": "3",
    "已准待對保金額": "220",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "720"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "2",
    "已進件待核准金額": "350",
    "已准待撥件數": "4",
    "已准待撥": "520",
    "已准待對保件數": "2",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "3",
    "已進件待核准金額": "510",
    "已准待撥件數": "9",
    "已准待撥": "1500",
    "已准待對保件數": "4",
    "已准待對保金額": "770",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "730"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "100",
    "已准待對保件數": "1",
    "已准待對保金額": "100",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "6",
    "已准待撥": "800",
    "已准待對保件數": "2",
    "已准待對保金額": "360",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "440"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "480",
    "已准待撥件數": "5",
    "已准待撥": "350",
    "已准待對保件數": "1",
    "已准待對保金額": "80",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "2",
    "已進件待核准金額": "900",
    "已准待撥件數": "11",
    "已准待撥": "1240",
    "已准待對保件數": "6",
    "已准待對保金額": "760",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "480"
  },
  {
    "經辦": "總和",
    "已進件待核准": "30",
    "已進件待核准金額": "6340",
    "已准待撥件數": "78",
    "已准待撥": "11020",
    "已准待對保件數": "36",
    "已准待對保金額": "5390",
    "已對保待撥件數的SUM": "41",
    "已對保待撥金額的SUM": "5760"
  }
];
const historyData = [
  {
    "timestamp": "2026-03-10T21:24:01.767Z",
    "A": 25,
    "A_amount": 500,
    "B": 20,
    "B_amount": 300
  },
  {
    "timestamp": "2026-03-11T01:21:24.190Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:27:16.958Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:34:41.003Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:36:27.109Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T02:06:29.182Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T07:44:48.084Z",
    "A": 39,
    "A_amount": 6215,
    "B": 28,
    "B_amount": 3930
  },
  {
    "timestamp": "2026-03-12T01:08:14.755Z",
    "A": 39,
    "A_amount": 6070,
    "B": 32,
    "B_amount": 4515
  },
  {
    "timestamp": "2026-03-12T07:08:19.451Z",
    "A": 40,
    "A_amount": 6060,
    "B": 32,
    "B_amount": 4505
  },
  {
    "timestamp": "2026-03-13T01:08:25.586Z",
    "A": 42,
    "A_amount": 6220,
    "B": 37,
    "B_amount": 4895
  },
  {
    "timestamp": "2026-03-13T07:08:33.405Z",
    "A": 49,
    "A_amount": 7390,
    "B": 30,
    "B_amount": 4065
  },
  {
    "timestamp": "2026-03-16T01:02:23.407Z",
    "A": 43,
    "A_amount": 6300,
    "B": 38,
    "B_amount": 5275
  },
  {
    "timestamp": "2026-03-16T07:02:28.318Z",
    "A": 40,
    "A_amount": 6140,
    "B": 35,
    "B_amount": 4425
  },
  {
    "timestamp": "2026-03-17T01:02:33.429Z",
    "A": 39,
    "A_amount": 5990,
    "B": 40,
    "B_amount": 4955
  },
  {
    "timestamp": "2026-03-17T07:02:38.680Z",
    "A": 45,
    "A_amount": 6770,
    "B": 35,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-03-18T01:03:31.874Z",
    "A": 48,
    "A_amount": 7270,
    "B": 38,
    "B_amount": 4410
  },
  {
    "timestamp": "2026-03-19T07:11:01.086Z",
    "A": 47,
    "A_amount": 7310,
    "B": 34,
    "B_amount": 4170
  },
  {
    "timestamp": "2026-03-20T07:04:50.936Z",
    "A": 57,
    "A_amount": 8560,
    "B": 30,
    "B_amount": 3880
  },
  {
    "timestamp": "2026-03-23T01:01:47.111Z",
    "A": 54,
    "A_amount": 8070,
    "B": 38,
    "B_amount": 5220
  },
  {
    "timestamp": "2026-03-23T07:01:53.709Z",
    "A": 36,
    "A_amount": 5390,
    "B": 41,
    "B_amount": 5760
  }
];
