
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "14",
    "已進件待核准金額": "2970",
    "已准待撥件數": "6",
    "已准待撥": "750",
    "已准待對保件數": "5",
    "已准待對保金額": "530",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "220"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "8",
    "已進件待核准金額": "1950",
    "已准待撥件數": "11",
    "已准待撥": "2080",
    "已准待對保件數": "7",
    "已准待對保金額": "1280",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "800"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "7",
    "已准待撥": "1320",
    "已准待對保件數": "5",
    "已准待對保金額": "800",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "520"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "4",
    "已進件待核准金額": "1050",
    "已准待撥件數": "9",
    "已准待撥": "1520",
    "已准待對保件數": "4",
    "已准待對保金額": "890",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "630"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "4",
    "已進件待核准金額": "1550",
    "已准待撥件數": "4",
    "已准待撥": "530",
    "已准待對保件數": "1",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "500",
    "已准待撥件數": "5",
    "已准待撥": "580",
    "已准待對保件數": "2",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "380",
    "已准待撥件數": "6",
    "已准待撥": "900",
    "已准待對保件數": "4",
    "已准待對保金額": "680",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "220"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "950",
    "已准待撥件數": "5",
    "已准待撥": "760",
    "已准待對保件數": "2",
    "已准待對保金額": "380",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "4",
    "已准待撥": "470",
    "已准待對保件數": "3",
    "已准待對保金額": "410",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "60"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1330",
    "已准待撥件數": "5",
    "已准待撥": "570",
    "已准待對保件數": "3",
    "已准待對保金額": "320",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "總和",
    "已進件待核准": "43",
    "已進件待核准金額": "11080",
    "已准待撥件數": "62",
    "已准待撥": "9480",
    "已准待對保件數": "36",
    "已准待對保金額": "5690",
    "已對保待撥件數的SUM": "26",
    "已對保待撥金額的SUM": "3790"
  }
];
const historyData = [
  {
    "timestamp": "2026-09-11T01:00:27.863Z",
    "A": 25,
    "A_amount": 3640,
    "B": 33,
    "B_amount": 4320
  },
  {
    "timestamp": "2026-09-11T07:00:54.826Z",
    "A": 32,
    "A_amount": 4600,
    "B": 27,
    "B_amount": 3430
  },
  {
    "timestamp": "2026-09-16T07:00:29.601Z",
    "A": 35,
    "A_amount": 4910,
    "B": 27,
    "B_amount": 3560
  },
  {
    "timestamp": "2026-09-17T01:01:02.343Z",
    "A": 32,
    "A_amount": 4550,
    "B": 32,
    "B_amount": 3960
  },
  {
    "timestamp": "2026-09-17T07:01:35.920Z",
    "A": 36,
    "A_amount": 5390,
    "B": 25,
    "B_amount": 2850
  },
  {
    "timestamp": "2026-09-18T01:02:10.494Z",
    "A": 38,
    "A_amount": 5630,
    "B": 28,
    "B_amount": 3200
  },
  {
    "timestamp": "2026-09-18T07:02:41.825Z",
    "A": 44,
    "A_amount": 6390,
    "B": 23,
    "B_amount": 2420
  },
  {
    "timestamp": "2026-09-19T01:03:11.570Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-19T07:03:39.961Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-20T01:04:22.556Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-20T07:05:03.504Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-21T01:05:37.350Z",
    "A": 34,
    "A_amount": 5350,
    "B": 36,
    "B_amount": 3680
  },
  {
    "timestamp": "2026-09-21T07:02:34.560Z",
    "A": 41,
    "A_amount": 6460,
    "B": 31,
    "B_amount": 3180
  },
  {
    "timestamp": "2026-09-22T01:01:13.030Z",
    "A": 39,
    "A_amount": 6080,
    "B": 35,
    "B_amount": 3880
  },
  {
    "timestamp": "2026-09-22T07:01:45.242Z",
    "A": 40,
    "A_amount": 5890,
    "B": 27,
    "B_amount": 3290
  },
  {
    "timestamp": "2026-09-23T01:00:31.577Z",
    "A": 30,
    "A_amount": 4750,
    "B": 35,
    "B_amount": 4340
  },
  {
    "timestamp": "2026-09-23T07:01:10.642Z",
    "A": 30,
    "A_amount": 4680,
    "B": 26,
    "B_amount": 3840
  },
  {
    "timestamp": "2026-09-24T01:01:44.564Z",
    "A": 29,
    "A_amount": 4540,
    "B": 28,
    "B_amount": 4060
  },
  {
    "timestamp": "2026-09-24T07:02:14.345Z",
    "A": 30,
    "A_amount": 4850,
    "B": 25,
    "B_amount": 3570
  },
  {
    "timestamp": "2026-09-25T01:02:55.320Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-25T07:03:12.913Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-26T01:03:43.252Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-26T07:04:00.036Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-27T01:04:40.044Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-27T07:05:20.741Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-28T01:05:48.966Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-28T07:06:30.819Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-29T01:07:02.241Z",
    "A": 29,
    "A_amount": 4970,
    "B": 29,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-09-29T07:00:43.897Z",
    "A": 34,
    "A_amount": 5470,
    "B": 23,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-09-30T01:01:16.421Z",
    "A": 36,
    "A_amount": 5690,
    "B": 26,
    "B_amount": 3790
  }
];
