
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1200",
    "已准待撥件數": "10",
    "已准待撥": "1820",
    "已准待對保件數": "6",
    "已准待對保金額": "1230",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "590"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1190",
    "已准待撥件數": "10",
    "已准待撥": "1000",
    "已准待對保件數": "4",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "700"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "600",
    "已准待撥件數": "12",
    "已准待撥": "1780",
    "已准待對保件數": "8",
    "已准待對保金額": "1510",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "270"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "14",
    "已准待撥": "2010",
    "已准待對保件數": "8",
    "已准待對保金額": "1180",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "830"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "750",
    "已准待撥件數": "12",
    "已准待撥": "1790",
    "已准待對保件數": "7",
    "已准待對保金額": "980",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "810"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "7",
    "已准待撥": "950",
    "已准待對保件數": "6",
    "已准待對保金額": "890",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "60"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "450",
    "已准待撥件數": "8",
    "已准待撥": "1460",
    "已准待對保件數": "4",
    "已准待對保金額": "740",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "720"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "860",
    "已准待撥件數": "12",
    "已准待撥": "1720",
    "已准待對保件數": "6",
    "已准待對保金額": "900",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "820"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "4",
    "已進件待核准金額": "1000",
    "已准待撥件數": "5",
    "已准待撥": "530",
    "已准待對保件數": "3",
    "已准待對保金額": "240",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "290"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1200",
    "已准待撥件數": "12",
    "已准待撥": "1520",
    "已准待對保件數": "5",
    "已准待對保金額": "620",
    "已對保待撥件數的SUM": "7",
    "已對保待撥金額的SUM": "900"
  },
  {
    "經辦": "總和",
    "已進件待核准": "32",
    "已進件待核准金額": "7850",
    "已准待撥件數": "102",
    "已准待撥": "14580",
    "已准待對保件數": "57",
    "已准待對保金額": "8590",
    "已對保待撥件數的SUM": "45",
    "已對保待撥金額的SUM": "5990"
  }
];
const historyData = [
  {
    "timestamp": "2026-06-05T01:02:33.572Z",
    "A": 53,
    "A_amount": 7865,
    "B": 38,
    "B_amount": 5530
  },
  {
    "timestamp": "2026-06-05T07:02:39.562Z",
    "A": 60,
    "A_amount": 8715,
    "B": 30,
    "B_amount": 4840
  },
  {
    "timestamp": "2026-06-06T01:02:59.598Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-06T07:03:16.998Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-07T01:03:34.423Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-07T07:03:53.252Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-08T01:04:00.713Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-08T07:04:06.699Z",
    "A": 53,
    "A_amount": 7945,
    "B": 33,
    "B_amount": 4850
  },
  {
    "timestamp": "2026-06-09T01:04:13.861Z",
    "A": 40,
    "A_amount": 6055,
    "B": 39,
    "B_amount": 5990
  },
  {
    "timestamp": "2026-06-09T07:04:18.586Z",
    "A": 46,
    "A_amount": 6915,
    "B": 30,
    "B_amount": 4670
  },
  {
    "timestamp": "2026-06-10T01:04:25.000Z",
    "A": 44,
    "A_amount": 6655,
    "B": 38,
    "B_amount": 5540
  },
  {
    "timestamp": "2026-06-10T07:04:30.553Z",
    "A": 51,
    "A_amount": 7565,
    "B": 29,
    "B_amount": 4270
  },
  {
    "timestamp": "2026-06-15T07:08:46.735Z",
    "A": 61,
    "A_amount": 9845,
    "B": 18,
    "B_amount": 2530
  },
  {
    "timestamp": "2026-06-16T01:00:07.255Z",
    "A": 56,
    "A_amount": 9065,
    "B": 24,
    "B_amount": 3450
  },
  {
    "timestamp": "2026-06-16T07:00:13.533Z",
    "A": 55,
    "A_amount": 8405,
    "B": 24,
    "B_amount": 3690
  },
  {
    "timestamp": "2026-06-17T01:00:19.966Z",
    "A": 53,
    "A_amount": 8235,
    "B": 29,
    "B_amount": 4370
  },
  {
    "timestamp": "2026-06-17T07:00:24.523Z",
    "A": 59,
    "A_amount": 8970,
    "B": 22,
    "B_amount": 3430
  },
  {
    "timestamp": "2026-06-18T01:00:30.803Z",
    "A": 54,
    "A_amount": 8360,
    "B": 34,
    "B_amount": 5150
  },
  {
    "timestamp": "2026-06-18T07:00:35.668Z",
    "A": 52,
    "A_amount": 8010,
    "B": 35,
    "B_amount": 5110
  },
  {
    "timestamp": "2026-06-19T01:00:54.329Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-19T07:00:59.606Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-20T01:01:09.010Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-20T07:01:25.552Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-21T01:01:31.442Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-21T07:01:40.062Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-22T01:01:48.246Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-22T07:01:54.277Z",
    "A": 55,
    "A_amount": 8470,
    "B": 35,
    "B_amount": 5090
  },
  {
    "timestamp": "2026-06-23T01:02:02.586Z",
    "A": 54,
    "A_amount": 8370,
    "B": 45,
    "B_amount": 6240
  },
  {
    "timestamp": "2026-06-23T07:02:10.683Z",
    "A": 61,
    "A_amount": 9060,
    "B": 36,
    "B_amount": 4720
  },
  {
    "timestamp": "2026-06-24T01:02:18.367Z",
    "A": 57,
    "A_amount": 8590,
    "B": 45,
    "B_amount": 5990
  }
];
