
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "8",
    "已進件待核准金額": "1490",
    "已准待撥件數": "11",
    "已准待撥": "1790",
    "已准待對保件數": "6",
    "已准待對保金額": "1190",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "600"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1200",
    "已准待撥件數": "12",
    "已准待撥": "2010",
    "已准待對保件數": "4",
    "已准待對保金額": "560",
    "已對保待撥件數的SUM": "8",
    "已對保待撥金額的SUM": "1420"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "470",
    "已准待撥件數": "9",
    "已准待撥": "980",
    "已准待對保件數": "4",
    "已准待對保金額": "360",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "620"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "5",
    "已准待撥": "640",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "520"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "490",
    "已准待撥件數": "11",
    "已准待撥": "1800",
    "已准待對保件數": "4",
    "已准待對保金額": "470",
    "已對保待撥件數的SUM": "7",
    "已對保待撥金額的SUM": "1330"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "250",
    "已准待撥件數": "7",
    "已准待撥": "970",
    "已准待對保件數": "6",
    "已准待對保金額": "820",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "3",
    "已准待撥": "290",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "290"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "2",
    "已准待撥": "320",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "320"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "600",
    "已准待撥件數": "5",
    "已准待撥": "680",
    "已准待對保件數": "4",
    "已准待對保金額": "600",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "80"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "8",
    "已准待撥": "1300",
    "已准待對保件數": "5",
    "已准待對保金額": "880",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "420"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1350",
    "已准待撥件數": "8",
    "已准待撥": "1260",
    "已准待對保件數": "3",
    "已准待對保金額": "630",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "630"
  },
  {
    "經辦": "總和",
    "已進件待核准": "29",
    "已進件待核准金額": "6680",
    "已准待撥件數": "81",
    "已准待撥": "12040",
    "已准待對保件數": "37",
    "已准待對保金額": "5660",
    "已對保待撥件數的SUM": "43",
    "已對保待撥金額的SUM": "6380"
  }
];
const historyData = [
  {
    "timestamp": "2026-05-07T01:00:56.581Z",
    "A": null,
    "A_amount": null,
    "B": null,
    "B_amount": null
  },
  {
    "timestamp": "2026-05-07T07:01:01.623Z",
    "A": 48,
    "A_amount": 6890,
    "B": 32,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-05-08T01:01:06.653Z",
    "A": 42,
    "A_amount": 6130,
    "B": 41,
    "B_amount": 5020
  },
  {
    "timestamp": "2026-05-08T07:01:13.318Z",
    "A": 46,
    "A_amount": 6770,
    "B": 31,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-05-09T01:01:30.542Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-09T07:01:47.231Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-10T01:02:04.205Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-10T07:02:20.064Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-11T01:02:25.674Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-11T07:02:31.563Z",
    "A": 47,
    "A_amount": 6560,
    "B": 27,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-05-12T01:02:36.577Z",
    "A": 44,
    "A_amount": 6390,
    "B": 34,
    "B_amount": 4840
  },
  {
    "timestamp": "2026-05-12T07:02:42.655Z",
    "A": 48,
    "A_amount": 7055,
    "B": 32,
    "B_amount": 4550
  },
  {
    "timestamp": "2026-05-13T01:02:48.634Z",
    "A": 46,
    "A_amount": 6595,
    "B": 37,
    "B_amount": 5310
  },
  {
    "timestamp": "2026-05-13T07:00:21.108Z",
    "A": 51,
    "A_amount": 7675,
    "B": 33,
    "B_amount": 4730
  },
  {
    "timestamp": "2026-05-14T01:01:02.647Z",
    "A": 50,
    "A_amount": 7595,
    "B": 37,
    "B_amount": 5190
  },
  {
    "timestamp": "2026-05-14T07:01:14.728Z",
    "A": 58,
    "A_amount": 8715,
    "B": 31,
    "B_amount": 4330
  },
  {
    "timestamp": "2026-05-15T01:01:19.989Z",
    "A": 54,
    "A_amount": 8185,
    "B": 36,
    "B_amount": 5160
  },
  {
    "timestamp": "2026-05-15T07:01:26.765Z",
    "A": 59,
    "A_amount": 8715,
    "B": 32,
    "B_amount": 4440
  },
  {
    "timestamp": "2026-05-16T01:01:32.523Z",
    "A": 64,
    "A_amount": 9635,
    "B": 36,
    "B_amount": 4790
  },
  {
    "timestamp": "2026-05-16T07:01:38.166Z",
    "A": 64,
    "A_amount": 9635,
    "B": 36,
    "B_amount": 4790
  },
  {
    "timestamp": "2026-05-17T01:01:54.560Z",
    "A": 64,
    "A_amount": 9635,
    "B": 36,
    "B_amount": 4790
  },
  {
    "timestamp": "2026-05-17T07:02:12.684Z",
    "A": 64,
    "A_amount": 9635,
    "B": 36,
    "B_amount": 4790
  },
  {
    "timestamp": "2026-05-18T01:02:19.041Z",
    "A": 63,
    "A_amount": 9435,
    "B": 37,
    "B_amount": 4990
  },
  {
    "timestamp": "2026-05-18T07:02:23.690Z",
    "A": 62,
    "A_amount": 9295,
    "B": 34,
    "B_amount": 4810
  },
  {
    "timestamp": "2026-05-19T01:02:29.945Z",
    "A": 41,
    "A_amount": 6120,
    "B": 55,
    "B_amount": 7190
  },
  {
    "timestamp": "2026-05-19T07:02:37.483Z",
    "A": 52,
    "A_amount": 7490,
    "B": 47,
    "B_amount": 6330
  },
  {
    "timestamp": "2026-05-20T01:02:45.193Z",
    "A": 43,
    "A_amount": 6310,
    "B": 57,
    "B_amount": 7780
  },
  {
    "timestamp": "2026-05-20T07:02:52.368Z",
    "A": 46,
    "A_amount": 6920,
    "B": 52,
    "B_amount": 6760
  },
  {
    "timestamp": "2026-05-21T01:03:00.967Z",
    "A": 42,
    "A_amount": 6610,
    "B": 58,
    "B_amount": 7390
  },
  {
    "timestamp": "2026-05-21T07:39:16.624Z",
    "A": 37,
    "A_amount": 5660,
    "B": 43,
    "B_amount": 6380
  }
];
