
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "7",
    "已進件待核准金額": "1290",
    "已准待撥件數": "5",
    "已准待撥": "960",
    "已准待對保件數": "3",
    "已准待對保金額": "740",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "220"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1190",
    "已准待撥件數": "10",
    "已准待撥": "1020",
    "已准待對保件數": "4",
    "已准待對保金額": "240",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "780"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "160",
    "已准待撥件數": "8",
    "已准待撥": "1350",
    "已准待對保件數": "2",
    "已准待對保金額": "390",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "960"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "12",
    "已准待撥": "2150",
    "已准待對保件數": "8",
    "已准待對保金額": "1540",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "610"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "3",
    "已進件待核准金額": "850",
    "已准待撥件數": "9",
    "已准待撥": "1100",
    "已准待對保件數": "6",
    "已准待對保金額": "700",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "70",
    "已准待撥件數": "5",
    "已准待撥": "690",
    "已准待對保件數": "3",
    "已准待對保金額": "440",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "3",
    "已准待撥": "490",
    "已准待對保件數": "3",
    "已准待對保金額": "490",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "2",
    "已進件待核准金額": "450",
    "已准待撥件數": "6",
    "已准待撥": "630",
    "已准待對保件數": "4",
    "已准待對保金額": "380",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "6",
    "已准待撥": "720",
    "已准待對保件數": "3",
    "已准待對保金額": "380",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "340"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1200",
    "已准待撥件數": "4",
    "已准待撥": "495",
    "已准待對保件數": "1",
    "已准待對保金額": "185",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "310"
  },
  {
    "經辦": "總和",
    "已進件待核准": "28",
    "已進件待核准金額": "6640",
    "已准待撥件數": "68",
    "已准待撥": "9605",
    "已准待對保件數": "37",
    "已准待對保金額": "5485",
    "已對保待撥件數的SUM": "31",
    "已對保待撥金額的SUM": "4120"
  }
];
const historyData = [
  {
    "timestamp": "2026-06-10T01:04:25.000Z",
    "A": 44,
    "A_amount": 6655,
    "B": 38,
    "B_amount": 5540
  },
  {
    "timestamp": "2026-06-10T07:04:30.553Z",
    "A": 51,
    "A_amount": 7565,
    "B": 29,
    "B_amount": 4270
  },
  {
    "timestamp": "2026-06-15T07:08:46.735Z",
    "A": 61,
    "A_amount": 9845,
    "B": 18,
    "B_amount": 2530
  },
  {
    "timestamp": "2026-06-16T01:00:07.255Z",
    "A": 56,
    "A_amount": 9065,
    "B": 24,
    "B_amount": 3450
  },
  {
    "timestamp": "2026-06-16T07:00:13.533Z",
    "A": 55,
    "A_amount": 8405,
    "B": 24,
    "B_amount": 3690
  },
  {
    "timestamp": "2026-06-17T01:00:19.966Z",
    "A": 53,
    "A_amount": 8235,
    "B": 29,
    "B_amount": 4370
  },
  {
    "timestamp": "2026-06-17T07:00:24.523Z",
    "A": 59,
    "A_amount": 8970,
    "B": 22,
    "B_amount": 3430
  },
  {
    "timestamp": "2026-06-18T01:00:30.803Z",
    "A": 54,
    "A_amount": 8360,
    "B": 34,
    "B_amount": 5150
  },
  {
    "timestamp": "2026-06-18T07:00:35.668Z",
    "A": 52,
    "A_amount": 8010,
    "B": 35,
    "B_amount": 5110
  },
  {
    "timestamp": "2026-06-19T01:00:54.329Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-19T07:00:59.606Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-20T01:01:09.010Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-20T07:01:25.552Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-21T01:01:31.442Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-21T07:01:40.062Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-22T01:01:48.246Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-22T07:01:54.277Z",
    "A": 55,
    "A_amount": 8470,
    "B": 35,
    "B_amount": 5090
  },
  {
    "timestamp": "2026-06-23T01:02:02.586Z",
    "A": 54,
    "A_amount": 8370,
    "B": 45,
    "B_amount": 6240
  },
  {
    "timestamp": "2026-06-23T07:02:10.683Z",
    "A": 61,
    "A_amount": 9060,
    "B": 36,
    "B_amount": 4720
  },
  {
    "timestamp": "2026-06-24T01:02:18.367Z",
    "A": 57,
    "A_amount": 8590,
    "B": 45,
    "B_amount": 5990
  },
  {
    "timestamp": "2026-06-24T07:02:26.895Z",
    "A": 56,
    "A_amount": 8455,
    "B": 37,
    "B_amount": 4840
  },
  {
    "timestamp": "2026-06-25T01:01:59.572Z",
    "A": 48,
    "A_amount": 6945,
    "B": 34,
    "B_amount": 4190
  },
  {
    "timestamp": "2026-06-25T07:02:09.394Z",
    "A": 54,
    "A_amount": 7745,
    "B": 26,
    "B_amount": 3400
  },
  {
    "timestamp": "2026-06-26T01:02:16.675Z",
    "A": 42,
    "A_amount": 6155,
    "B": 40,
    "B_amount": 5270
  },
  {
    "timestamp": "2026-06-26T07:02:23.303Z",
    "A": 43,
    "A_amount": 6305,
    "B": 25,
    "B_amount": 3300
  },
  {
    "timestamp": "2026-06-27T01:02:41.687Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-27T07:03:00.413Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-28T01:03:20.322Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-28T07:03:38.357Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-29T01:03:45.314Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  }
];
