
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "10",
    "已進件待核准金額": "2160",
    "已准待撥件數": "8",
    "已准待撥": "1210",
    "已准待對保件數": "5",
    "已准待對保金額": "760",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "450"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "8",
    "已進件待核准金額": "1510",
    "已准待撥件數": "6",
    "已准待撥": "790",
    "已准待對保件數": "5",
    "已准待對保金額": "690",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "100"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "4",
    "已進件待核准金額": "400",
    "已准待撥件數": "10",
    "已准待撥": "1450",
    "已准待對保件數": "5",
    "已准待對保金額": "860",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "590"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "6",
    "已准待撥": "750",
    "已准待對保件數": "3",
    "已准待對保金額": "500",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "3",
    "已進件待核准金額": "820",
    "已准待撥件數": "9",
    "已准待撥": "930",
    "已准待對保件數": "7",
    "已准待對保金額": "650",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "280"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "4",
    "已准待撥": "540",
    "已准待對保件數": "1",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "340"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "8",
    "已准待撥": "1270",
    "已准待對保件數": "6",
    "已准待對保金額": "940",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "300",
    "已准待對保件數": "1",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "1150",
    "已准待撥件數": "12",
    "已准待撥": "1670",
    "已准待對保件數": "5",
    "已准待對保金額": "670",
    "已對保待撥件數的SUM": "7",
    "已對保待撥金額的SUM": "1000"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "6",
    "已准待撥": "850",
    "已准待對保件數": "4",
    "已准待對保金額": "620",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "230"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1320",
    "已准待撥件數": "8",
    "已准待撥": "1200",
    "已准待對保件數": "5",
    "已准待對保金額": "770",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "430"
  },
  {
    "經辦": "總和",
    "已進件待核准": "38",
    "已進件待核准金額": "8640",
    "已准待撥件數": "78",
    "已准待撥": "10960",
    "已准待對保件數": "47",
    "已准待對保金額": "6960",
    "已對保待撥件數的SUM": "31",
    "已對保待撥金額的SUM": "4000"
  }
];
const historyData = [
  {
    "timestamp": "2026-07-21T07:03:43.891Z",
    "A": 57,
    "A_amount": 8400,
    "B": 28,
    "B_amount": 3510
  },
  {
    "timestamp": "2026-07-22T01:03:53.529Z",
    "A": 49,
    "A_amount": 7170,
    "B": 39,
    "B_amount": 5070
  },
  {
    "timestamp": "2026-07-22T07:04:01.098Z",
    "A": 59,
    "A_amount": 8380,
    "B": 29,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-07-23T01:04:11.015Z",
    "A": 56,
    "A_amount": 7970,
    "B": 34,
    "B_amount": 4520
  },
  {
    "timestamp": "2026-07-23T07:04:18.627Z",
    "A": 60,
    "A_amount": 8730,
    "B": 26,
    "B_amount": 3760
  },
  {
    "timestamp": "2026-07-24T01:04:25.683Z",
    "A": 55,
    "A_amount": 8150,
    "B": 35,
    "B_amount": 5110
  },
  {
    "timestamp": "2026-07-24T07:04:32.199Z",
    "A": 58,
    "A_amount": 8650,
    "B": 26,
    "B_amount": 3690
  },
  {
    "timestamp": "2026-07-25T01:04:41.050Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-25T07:04:58.877Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-26T01:05:09.353Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-26T07:05:26.720Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-27T01:05:36.535Z",
    "A": 51,
    "A_amount": 7610,
    "B": 34,
    "B_amount": 4780
  },
  {
    "timestamp": "2026-07-27T07:05:42.336Z",
    "A": 54,
    "A_amount": 7870,
    "B": 26,
    "B_amount": 3620
  },
  {
    "timestamp": "2026-07-28T01:05:49.604Z",
    "A": 57,
    "A_amount": 8390,
    "B": 33,
    "B_amount": 4600
  },
  {
    "timestamp": "2026-07-28T07:05:55.402Z",
    "A": 61,
    "A_amount": 8610,
    "B": 35,
    "B_amount": 5120
  },
  {
    "timestamp": "2026-07-29T01:06:06.524Z",
    "A": 33,
    "A_amount": 5260,
    "B": 39,
    "B_amount": 5540
  },
  {
    "timestamp": "2026-07-30T07:03:40.227Z",
    "A": 43,
    "A_amount": 6420,
    "B": 30,
    "B_amount": 4290
  },
  {
    "timestamp": "2026-07-31T01:03:48.538Z",
    "A": 49,
    "A_amount": 6930,
    "B": 30,
    "B_amount": 4290
  },
  {
    "timestamp": "2026-07-31T07:03:55.137Z",
    "A": 45,
    "A_amount": 6750,
    "B": 21,
    "B_amount": 2605
  },
  {
    "timestamp": "2026-08-01T01:04:13.801Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-01T07:04:32.401Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-02T01:04:51.170Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-02T07:05:11.391Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-03T01:05:19.433Z",
    "A": 46,
    "A_amount": 6890,
    "B": 22,
    "B_amount": 2735
  },
  {
    "timestamp": "2026-08-03T07:01:42.298Z",
    "A": 45,
    "A_amount": 6780,
    "B": 23,
    "B_amount": 2945
  },
  {
    "timestamp": "2026-08-04T01:00:05.712Z",
    "A": 44,
    "A_amount": 6390,
    "B": 31,
    "B_amount": 4065
  },
  {
    "timestamp": "2026-08-04T07:00:15.862Z",
    "A": 43,
    "A_amount": 6410,
    "B": 29,
    "B_amount": 3830
  },
  {
    "timestamp": "2026-08-05T01:00:23.014Z",
    "A": 40,
    "A_amount": 6220,
    "B": 36,
    "B_amount": 4630
  },
  {
    "timestamp": "2026-08-05T07:00:30.751Z",
    "A": 42,
    "A_amount": 6600,
    "B": 31,
    "B_amount": 4000
  },
  {
    "timestamp": "2026-08-06T01:00:38.848Z",
    "A": 47,
    "A_amount": 6960,
    "B": 31,
    "B_amount": 4000
  }
];
