
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "6",
    "已進件待核准金額": "1040",
    "已准待撥件數": "11",
    "已准待撥": "1860",
    "已准待對保件數": "8",
    "已准待對保金額": "1440",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "420"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "6",
    "已進件待核准金額": "1110",
    "已准待撥件數": "8",
    "已准待撥": "1100",
    "已准待對保件數": "3",
    "已准待對保金額": "360",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "740"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "1",
    "已進件待核准金額": "100",
    "已准待撥件數": "7",
    "已准待撥": "790",
    "已准待對保件數": "4",
    "已准待對保金額": "380",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "410"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "7",
    "已准待撥": "920",
    "已准待對保件數": "4",
    "已准待對保金額": "420",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "680",
    "已准待撥件數": "10",
    "已准待撥": "1540",
    "已准待對保件數": "7",
    "已准待對保金額": "990",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "550"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "250",
    "已准待撥件數": "10",
    "已准待撥": "1700",
    "已准待對保件數": "5",
    "已准待對保金額": "790",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "910"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "6",
    "已准待撥": "1050",
    "已准待對保件數": "4",
    "已准待對保金額": "850",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "150",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "2",
    "已進件待核准金額": "450",
    "已准待撥件數": "10",
    "已准待撥": "1180",
    "已准待對保件數": "9",
    "已准待對保金額": "1100",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "80"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "650",
    "已准待撥件數": "2",
    "已准待撥": "280",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "280"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "4",
    "已進件待核准金額": "1500",
    "已准待撥件數": "8",
    "已准待撥": "1265",
    "已准待對保件數": "6",
    "已准待對保金額": "1085",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "180"
  },
  {
    "經辦": "總和",
    "已進件待核准": "28",
    "已進件待核准金額": "6610",
    "已准待撥件數": "80",
    "已准待撥": "11835",
    "已准待對保件數": "51",
    "已准待對保金額": "7565",
    "已對保待撥件數的SUM": "29",
    "已對保待撥金額的SUM": "4270"
  }
];
const historyData = [
  {
    "timestamp": "2026-05-26T07:00:19.126Z",
    "A": 42,
    "A_amount": 8940,
    "B": 27,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-05-27T01:00:26.391Z",
    "A": 41,
    "A_amount": 6590,
    "B": 31,
    "B_amount": 4300
  },
  {
    "timestamp": "2026-05-28T02:24:06.345Z",
    "A": 50,
    "A_amount": 7740,
    "B": 29,
    "B_amount": 3800
  },
  {
    "timestamp": "2026-05-28T07:00:20.212Z",
    "A": 53,
    "A_amount": 8200,
    "B": 23,
    "B_amount": 3100
  },
  {
    "timestamp": "2026-05-29T01:00:27.114Z",
    "A": 59,
    "A_amount": 9150,
    "B": 21,
    "B_amount": 2970
  },
  {
    "timestamp": "2026-05-29T07:00:34.196Z",
    "A": 46,
    "A_amount": 6950,
    "B": 20,
    "B_amount": 2940
  },
  {
    "timestamp": "2026-05-30T01:00:52.248Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-30T07:01:09.288Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-31T01:01:15.578Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-05-31T07:01:34.645Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-06-01T01:01:41.742Z",
    "A": 43,
    "A_amount": 6300,
    "B": 29,
    "B_amount": 4385
  },
  {
    "timestamp": "2026-06-01T07:01:47.558Z",
    "A": 50,
    "A_amount": 7495,
    "B": 26,
    "B_amount": 4050
  },
  {
    "timestamp": "2026-06-02T01:01:52.556Z",
    "A": 43,
    "A_amount": 6385,
    "B": 34,
    "B_amount": 5320
  },
  {
    "timestamp": "2026-06-02T07:01:59.106Z",
    "A": 51,
    "A_amount": 7485,
    "B": 28,
    "B_amount": 3980
  },
  {
    "timestamp": "2026-06-03T01:02:06.925Z",
    "A": 52,
    "A_amount": 7895,
    "B": 34,
    "B_amount": 4570
  },
  {
    "timestamp": "2026-06-03T07:02:14.011Z",
    "A": 56,
    "A_amount": 8565,
    "B": 27,
    "B_amount": 3720
  },
  {
    "timestamp": "2026-06-04T01:02:21.904Z",
    "A": 53,
    "A_amount": 8095,
    "B": 32,
    "B_amount": 4590
  },
  {
    "timestamp": "2026-06-04T07:02:28.586Z",
    "A": 56,
    "A_amount": 8375,
    "B": 29,
    "B_amount": 4220
  },
  {
    "timestamp": "2026-06-05T01:02:33.572Z",
    "A": 53,
    "A_amount": 7865,
    "B": 38,
    "B_amount": 5530
  },
  {
    "timestamp": "2026-06-05T07:02:39.562Z",
    "A": 60,
    "A_amount": 8715,
    "B": 30,
    "B_amount": 4840
  },
  {
    "timestamp": "2026-06-06T01:02:59.598Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-06T07:03:16.998Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-07T01:03:34.423Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-07T07:03:53.252Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-08T01:04:00.713Z",
    "A": 63,
    "A_amount": 9275,
    "B": 35,
    "B_amount": 5370
  },
  {
    "timestamp": "2026-06-08T07:04:06.699Z",
    "A": 53,
    "A_amount": 7945,
    "B": 33,
    "B_amount": 4850
  },
  {
    "timestamp": "2026-06-09T01:04:13.861Z",
    "A": 40,
    "A_amount": 6055,
    "B": 39,
    "B_amount": 5990
  },
  {
    "timestamp": "2026-06-09T07:04:18.586Z",
    "A": 46,
    "A_amount": 6915,
    "B": 30,
    "B_amount": 4670
  },
  {
    "timestamp": "2026-06-10T01:04:25.000Z",
    "A": 44,
    "A_amount": 6655,
    "B": 38,
    "B_amount": 5540
  },
  {
    "timestamp": "2026-06-10T07:04:30.553Z",
    "A": 51,
    "A_amount": 7565,
    "B": 29,
    "B_amount": 4270
  }
];
