
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "6",
    "已進件待核准金額": "890",
    "已准待撥件數": "7",
    "已准待撥": "1060",
    "已准待對保件數": "5",
    "已准待對保金額": "710",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1070",
    "已准待撥件數": "9",
    "已准待撥": "1600",
    "已准待對保件數": "5",
    "已准待對保金額": "830",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "770"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "240",
    "已准待撥件數": "12",
    "已准待撥": "1385",
    "已准待對保件數": "6",
    "已准待對保金額": "780",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "605"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "9",
    "已准待撥": "1460",
    "已准待對保件數": "5",
    "已准待對保金額": "1080",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "380"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "370",
    "已准待撥件數": "11",
    "已准待撥": "1810",
    "已准待對保件數": "5",
    "已准待對保金額": "710",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "1100"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "200",
    "已准待撥件數": "5",
    "已准待撥": "650",
    "已准待對保件數": "1",
    "已准待對保金額": "150",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "500"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "1",
    "已進件待核准金額": "230",
    "已准待撥件數": "5",
    "已准待撥": "680",
    "已准待對保件數": "4",
    "已准待對保金額": "530",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "150"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "3",
    "已准待撥": "520",
    "已准待對保件數": "1",
    "已准待對保金額": "300",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "220"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "4",
    "已進件待核准金額": "810",
    "已准待撥件數": "3",
    "已准待撥": "250",
    "已准待對保件數": "3",
    "已准待對保金額": "250",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "5",
    "已進件待核准金額": "980",
    "已准待撥件數": "8",
    "已准待撥": "1150",
    "已准待對保件數": "5",
    "已准待對保金額": "720",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "430"
  },
  {
    "經辦": "總和",
    "已進件待核准": "32",
    "已進件待核准金額": "6290",
    "已准待撥件數": "72",
    "已准待撥": "10565",
    "已准待對保件數": "40",
    "已准待對保金額": "6060",
    "已對保待撥件數的SUM": "32",
    "已對保待撥金額的SUM": "4505"
  }
];
const historyData = [
  {
    "timestamp": "2026-03-10T21:24:01.767Z",
    "A": 25,
    "A_amount": 500,
    "B": 20,
    "B_amount": 300
  },
  {
    "timestamp": "2026-03-11T01:21:24.190Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:27:16.958Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:34:41.003Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T01:36:27.109Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T02:06:29.182Z",
    "A": 38,
    "A_amount": 5680,
    "B": 28,
    "B_amount": 3820
  },
  {
    "timestamp": "2026-03-11T07:44:48.084Z",
    "A": 39,
    "A_amount": 6215,
    "B": 28,
    "B_amount": 3930
  },
  {
    "timestamp": "2026-03-12T01:08:14.755Z",
    "A": 39,
    "A_amount": 6070,
    "B": 32,
    "B_amount": 4515
  },
  {
    "timestamp": "2026-03-12T07:08:19.451Z",
    "A": 40,
    "A_amount": 6060,
    "B": 32,
    "B_amount": 4505
  }
];
