
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "8",
    "已進件待核准金額": "1710",
    "已准待撥件數": "7",
    "已准待撥": "1150",
    "已准待對保件數": "5",
    "已准待對保金額": "930",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "220"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "7",
    "已進件待核准金額": "1120",
    "已准待撥件數": "12",
    "已准待撥": "1810",
    "已准待對保件數": "8",
    "已准待對保金額": "1050",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "760"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "280",
    "已准待撥件數": "8",
    "已准待撥": "920",
    "已准待對保件數": "2",
    "已准待對保金額": "270",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "650"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "11",
    "已准待撥": "1260",
    "已准待對保件數": "5",
    "已准待對保金額": "600",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "660"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "200",
    "已准待撥件數": "9",
    "已准待撥": "1030",
    "已准待對保件數": "7",
    "已准待對保金額": "870",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "160"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "10",
    "已准待撥": "1800",
    "已准待對保件數": "7",
    "已准待對保金額": "1060",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "740"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "480",
    "已准待撥件數": "2",
    "已准待撥": "330",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "200",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "3",
    "已進件待核准金額": "750",
    "已准待撥件數": "5",
    "已准待撥": "750",
    "已准待對保件數": "2",
    "已准待對保金額": "350",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "400"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "7",
    "已准待撥": "810",
    "已准待對保件數": "5",
    "已准待對保金額": "630",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "180"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "5",
    "已進件待核准金額": "1600",
    "已准待撥件數": "8",
    "已准待撥": "1040",
    "已准待對保件數": "4",
    "已准待對保金額": "650",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "390"
  },
  {
    "經辦": "總和",
    "已進件待核准": "31",
    "已進件待核准金額": "6740",
    "已准待撥件數": "80",
    "已准待撥": "11100",
    "已准待對保件數": "45",
    "已准待對保金額": "6410",
    "已對保待撥件數的SUM": "35",
    "已對保待撥金額的SUM": "4690"
  }
];
const historyData = [
  {
    "timestamp": "2026-04-23T07:01:54.943Z",
    "A": 45,
    "A_amount": 5440,
    "B": 36,
    "B_amount": 4745
  },
  {
    "timestamp": "2026-04-24T01:02:01.525Z",
    "A": 43,
    "A_amount": 5250,
    "B": 43,
    "B_amount": 5485
  },
  {
    "timestamp": "2026-04-24T07:02:08.993Z",
    "A": 56,
    "A_amount": 6550,
    "B": 36,
    "B_amount": 4345
  },
  {
    "timestamp": "2026-04-25T01:02:26.018Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-25T07:02:31.439Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-26T01:02:47.688Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-26T07:03:05.613Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-27T01:03:11.767Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-27T07:03:17.915Z",
    "A": 50,
    "A_amount": 6230,
    "B": 46,
    "B_amount": 5285
  },
  {
    "timestamp": "2026-04-28T01:03:24.769Z",
    "A": 47,
    "A_amount": 5830,
    "B": 43,
    "B_amount": 4920
  },
  {
    "timestamp": "2026-04-28T07:03:30.540Z",
    "A": 50,
    "A_amount": 6360,
    "B": 31,
    "B_amount": 3390
  },
  {
    "timestamp": "2026-04-29T01:03:37.392Z",
    "A": 47,
    "A_amount": 5590,
    "B": 39,
    "B_amount": 4770
  },
  {
    "timestamp": "2026-04-29T07:03:43.775Z",
    "A": 49,
    "A_amount": 5980,
    "B": 28,
    "B_amount": 3590
  },
  {
    "timestamp": "2026-04-30T01:03:52.057Z",
    "A": 52,
    "A_amount": 6110,
    "B": 30,
    "B_amount": 3870
  },
  {
    "timestamp": "2026-04-30T07:03:57.617Z",
    "A": 58,
    "A_amount": 6870,
    "B": 18,
    "B_amount": 2450
  },
  {
    "timestamp": "2026-05-01T01:04:09.366Z",
    "A": 57,
    "A_amount": 6710,
    "B": 21,
    "B_amount": 2800
  },
  {
    "timestamp": "2026-05-01T07:04:15.628Z",
    "A": 57,
    "A_amount": 6710,
    "B": 21,
    "B_amount": 2800
  },
  {
    "timestamp": "2026-05-04T01:00:22.891Z",
    "A": 57,
    "A_amount": 6710,
    "B": 21,
    "B_amount": 2800
  },
  {
    "timestamp": "2026-05-04T07:00:28.605Z",
    "A": 57,
    "A_amount": 6590,
    "B": 26,
    "B_amount": 3530
  },
  {
    "timestamp": "2026-05-05T01:00:35.557Z",
    "A": 57,
    "A_amount": 7090,
    "B": 33,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-05-05T07:00:41.422Z",
    "A": 55,
    "A_amount": 6830,
    "B": 32,
    "B_amount": 3900
  },
  {
    "timestamp": "2026-05-06T01:00:47.083Z",
    "A": null,
    "A_amount": null,
    "B": null,
    "B_amount": null
  },
  {
    "timestamp": "2026-05-06T07:00:52.154Z",
    "A": null,
    "A_amount": null,
    "B": null,
    "B_amount": null
  },
  {
    "timestamp": "2026-05-07T01:00:56.581Z",
    "A": null,
    "A_amount": null,
    "B": null,
    "B_amount": null
  },
  {
    "timestamp": "2026-05-07T07:01:01.623Z",
    "A": 48,
    "A_amount": 6890,
    "B": 32,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-05-08T01:01:06.653Z",
    "A": 42,
    "A_amount": 6130,
    "B": 41,
    "B_amount": 5020
  },
  {
    "timestamp": "2026-05-08T07:01:13.318Z",
    "A": 46,
    "A_amount": 6770,
    "B": 31,
    "B_amount": 3940
  },
  {
    "timestamp": "2026-05-09T01:01:30.542Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-09T07:01:47.231Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  },
  {
    "timestamp": "2026-05-10T01:02:04.205Z",
    "A": 45,
    "A_amount": 6410,
    "B": 35,
    "B_amount": 4690
  }
];
