
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "6",
    "已進件待核准金額": "1000",
    "已准待撥件數": "7",
    "已准待撥": "730",
    "已准待對保件數": "4",
    "已准待對保金額": "450",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "280"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1200",
    "已准待撥件數": "11",
    "已准待撥": "1280",
    "已准待對保件數": "5",
    "已准待對保金額": "640",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "640"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "2",
    "已進件待核准金額": "280",
    "已准待撥件數": "12",
    "已准待撥": "1430",
    "已准待對保件數": "5",
    "已准待對保金額": "610",
    "已對保待撥件數的SUM": "7",
    "已對保待撥金額的SUM": "820"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "450",
    "已准待撥件數": "16",
    "已准待撥": "1820",
    "已准待對保件數": "7",
    "已准待對保金額": "860",
    "已對保待撥件數的SUM": "9",
    "已對保待撥金額的SUM": "960"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "2",
    "已進件待核准金額": "300",
    "已准待撥件數": "7",
    "已准待撥": "610",
    "已准待對保件數": "5",
    "已准待對保金額": "420",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "190"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "300",
    "已准待撥件數": "7",
    "已准待撥": "930",
    "已准待對保件數": "4",
    "已准待對保金額": "630",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "300"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "280",
    "已准待撥件數": "8",
    "已准待撥": "1370",
    "已准待對保件數": "4",
    "已准待對保金額": "620",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "750"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "1",
    "已准待撥": "200",
    "已准待對保件數": "1",
    "已准待對保金額": "200",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "4",
    "已進件待核准金額": "1050",
    "已准待撥件數": "5",
    "已准待撥": "450",
    "已准待對保件數": "1",
    "已准待對保金額": "100",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "350"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "3",
    "已進件待核准金額": "900",
    "已准待撥件數": "9",
    "已准待撥": "1105",
    "已准待對保件數": "4",
    "已准待對保金額": "380",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "725"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "5",
    "已進件待核准金額": "1650",
    "已准待撥件數": "10",
    "已准待撥": "1270",
    "已准待對保件數": "7",
    "已准待對保金額": "1020",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "250"
  },
  {
    "經辦": "總和",
    "已進件待核准": "32",
    "已進件待核准金額": "7410",
    "已准待撥件數": "93",
    "已准待撥": "11195",
    "已准待對保件數": "47",
    "已准待對保金額": "5930",
    "已對保待撥件數的SUM": "46",
    "已對保待撥金額的SUM": "5265"
  }
];
const historyData = [
  {
    "timestamp": "2026-04-01T07:00:27.528Z",
    "A": 49,
    "A_amount": 7200,
    "B": 22,
    "B_amount": 2655
  },
  {
    "timestamp": "2026-04-02T01:00:33.203Z",
    "A": 46,
    "A_amount": 6670,
    "B": 28,
    "B_amount": 3825
  },
  {
    "timestamp": "2026-04-02T07:00:38.406Z",
    "A": 47,
    "A_amount": 6660,
    "B": 25,
    "B_amount": 3990
  },
  {
    "timestamp": "2026-04-07T01:08:48.932Z",
    "A": 46,
    "A_amount": 6420,
    "B": 31,
    "B_amount": 5080
  },
  {
    "timestamp": "2026-04-13T04:07:43.193Z",
    "A": 52,
    "A_amount": 6850,
    "B": 26,
    "B_amount": 3400
  },
  {
    "timestamp": "2026-04-13T04:09:38.669Z",
    "A": 52,
    "A_amount": 6850,
    "B": 26,
    "B_amount": 3400
  },
  {
    "timestamp": "2026-04-13T07:03:13.444Z",
    "A": 53,
    "A_amount": 7170,
    "B": 27,
    "B_amount": 3470
  },
  {
    "timestamp": "2026-04-14T01:03:18.910Z",
    "A": 57,
    "A_amount": 7650,
    "B": 30,
    "B_amount": 3900
  },
  {
    "timestamp": "2026-04-14T07:02:08.874Z",
    "A": 59,
    "A_amount": 7860,
    "B": 31,
    "B_amount": 3555
  },
  {
    "timestamp": "2026-04-15T09:15:53.645Z",
    "A": 44,
    "A_amount": 5350,
    "B": 37,
    "B_amount": 4615
  },
  {
    "timestamp": "2026-04-15T09:16:22.483Z",
    "A": 44,
    "A_amount": 5350,
    "B": 37,
    "B_amount": 4615
  },
  {
    "timestamp": "2026-04-16T03:10:17.898Z",
    "A": 42,
    "A_amount": 5250,
    "B": 39,
    "B_amount": 4935
  },
  {
    "timestamp": "2026-04-17T02:00:39.437Z",
    "A": 39,
    "A_amount": 4780,
    "B": 40,
    "B_amount": 5400
  },
  {
    "timestamp": "2026-04-17T07:00:22.558Z",
    "A": 40,
    "A_amount": 4840,
    "B": 38,
    "B_amount": 5050
  },
  {
    "timestamp": "2026-04-18T01:00:41.234Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-18T07:00:57.667Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-19T01:01:02.400Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-19T07:01:07.652Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-20T01:01:14.550Z",
    "A": 40,
    "A_amount": 4930,
    "B": 42,
    "B_amount": 5740
  },
  {
    "timestamp": "2026-04-20T07:01:19.496Z",
    "A": 47,
    "A_amount": 5870,
    "B": 30,
    "B_amount": 3640
  },
  {
    "timestamp": "2026-04-21T01:01:26.696Z",
    "A": 44,
    "A_amount": 5570,
    "B": 34,
    "B_amount": 4160
  },
  {
    "timestamp": "2026-04-21T07:01:31.959Z",
    "A": 47,
    "A_amount": 6010,
    "B": 27,
    "B_amount": 3660
  },
  {
    "timestamp": "2026-04-22T01:01:37.865Z",
    "A": 43,
    "A_amount": 5230,
    "B": 35,
    "B_amount": 4695
  },
  {
    "timestamp": "2026-04-22T07:01:43.888Z",
    "A": 48,
    "A_amount": 5680,
    "B": 37,
    "B_amount": 4965
  },
  {
    "timestamp": "2026-04-23T01:01:48.843Z",
    "A": 48,
    "A_amount": 5920,
    "B": 38,
    "B_amount": 4985
  },
  {
    "timestamp": "2026-04-23T07:01:54.943Z",
    "A": 45,
    "A_amount": 5440,
    "B": 36,
    "B_amount": 4745
  },
  {
    "timestamp": "2026-04-24T01:02:01.525Z",
    "A": 43,
    "A_amount": 5250,
    "B": 43,
    "B_amount": 5485
  },
  {
    "timestamp": "2026-04-24T07:02:08.993Z",
    "A": 56,
    "A_amount": 6550,
    "B": 36,
    "B_amount": 4345
  },
  {
    "timestamp": "2026-04-25T01:02:26.018Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  },
  {
    "timestamp": "2026-04-25T07:02:31.439Z",
    "A": 47,
    "A_amount": 5930,
    "B": 46,
    "B_amount": 5265
  }
];
