
const dashboardData = [
  {
    "經辦": "小甄",
    "已進件待核准": "11",
    "已進件待核准金額": "1728",
    "已准待撥件數": "9",
    "已准待撥": "1620",
    "已准待對保件數": "6",
    "已准待對保金額": "1090",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "530"
  },
  {
    "經辦": "玉卿",
    "已進件待核准": "5",
    "已進件待核准金額": "1190",
    "已准待撥件數": "12",
    "已准待撥": "1640",
    "已准待對保件數": "6",
    "已准待對保金額": "810",
    "已對保待撥件數的SUM": "6",
    "已對保待撥金額的SUM": "830"
  },
  {
    "經辦": "玉莉",
    "已進件待核准": "3",
    "已進件待核准金額": "460",
    "已准待撥件數": "4",
    "已准待撥": "460",
    "已准待對保件數": "2",
    "已准待對保金額": "260",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "200"
  },
  {
    "經辦": "依璇",
    "已進件待核准": "2",
    "已進件待核准金額": "600",
    "已准待撥件數": "15",
    "已准待撥": "2585",
    "已准待對保件數": "10",
    "已准待對保金額": "2010",
    "已對保待撥件數的SUM": "5",
    "已對保待撥金額的SUM": "575"
  },
  {
    "經辦": "孟萱",
    "已進件待核准": "3",
    "已進件待核准金額": "1000",
    "已准待撥件數": "10",
    "已准待撥": "1325",
    "已准待對保件數": "7",
    "已准待對保金額": "940",
    "已對保待撥件數的SUM": "3",
    "已對保待撥金額的SUM": "385"
  },
  {
    "經辦": "倩汶",
    "已進件待核准": "1",
    "已進件待核准金額": "200",
    "已准待撥件數": "4",
    "已准待撥": "590",
    "已准待對保件數": "2",
    "已准待對保金額": "260",
    "已對保待撥件數的SUM": "2",
    "已對保待撥金額的SUM": "330"
  },
  {
    "經辦": "琬婷",
    "已進件待核准": "2",
    "已進件待核准金額": "330",
    "已准待撥件數": "4",
    "已准待撥": "590",
    "已准待對保件數": "3",
    "已准待對保金額": "490",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "100"
  },
  {
    "經辦": "貴哥",
    "已進件待核准": "0",
    "已進件待核准金額": "0",
    "已准待撥件數": "0",
    "已准待撥": "0",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "0",
    "已對保待撥金額的SUM": "0"
  },
  {
    "經辦": "緒瀅",
    "已進件待核准": "5",
    "已進件待核准金額": "1280",
    "已准待撥件數": "3",
    "已准待撥": "330",
    "已准待對保件數": "2",
    "已准待對保金額": "230",
    "已對保待撥件數的SUM": "1",
    "已對保待撥金額的SUM": "100"
  },
  {
    "經辦": "瑩茹",
    "已進件待核准": "2",
    "已進件待核准金額": "450",
    "已准待撥件數": "7",
    "已准待撥": "1220",
    "已准待對保件數": "3",
    "已准待對保金額": "470",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "750"
  },
  {
    "經辦": "錦光",
    "已進件待核准": "3",
    "已進件待核准金額": "1200",
    "已准待撥件數": "4",
    "已准待撥": "620",
    "已准待對保件數": "0",
    "已准待對保金額": "0",
    "已對保待撥件數的SUM": "4",
    "已對保待撥金額的SUM": "620"
  },
  {
    "經辦": "總和",
    "已進件待核准": "37",
    "已進件待核准金額": "8438",
    "已准待撥件數": "72",
    "已准待撥": "10980",
    "已准待對保件數": "41",
    "已准待對保金額": "6560",
    "已對保待撥件數的SUM": "31",
    "已對保待撥金額的SUM": "4420"
  }
];
const historyData = [
  {
    "timestamp": "2026-06-19T01:00:54.329Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-19T07:00:59.606Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-20T01:01:09.010Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-20T07:01:25.552Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-21T01:01:31.442Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-21T07:01:40.062Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-22T01:01:48.246Z",
    "A": 50,
    "A_amount": 7880,
    "B": 38,
    "B_amount": 5200
  },
  {
    "timestamp": "2026-06-22T07:01:54.277Z",
    "A": 55,
    "A_amount": 8470,
    "B": 35,
    "B_amount": 5090
  },
  {
    "timestamp": "2026-06-23T01:02:02.586Z",
    "A": 54,
    "A_amount": 8370,
    "B": 45,
    "B_amount": 6240
  },
  {
    "timestamp": "2026-06-23T07:02:10.683Z",
    "A": 61,
    "A_amount": 9060,
    "B": 36,
    "B_amount": 4720
  },
  {
    "timestamp": "2026-06-24T01:02:18.367Z",
    "A": 57,
    "A_amount": 8590,
    "B": 45,
    "B_amount": 5990
  },
  {
    "timestamp": "2026-06-24T07:02:26.895Z",
    "A": 56,
    "A_amount": 8455,
    "B": 37,
    "B_amount": 4840
  },
  {
    "timestamp": "2026-06-25T01:01:59.572Z",
    "A": 48,
    "A_amount": 6945,
    "B": 34,
    "B_amount": 4190
  },
  {
    "timestamp": "2026-06-25T07:02:09.394Z",
    "A": 54,
    "A_amount": 7745,
    "B": 26,
    "B_amount": 3400
  },
  {
    "timestamp": "2026-06-26T01:02:16.675Z",
    "A": 42,
    "A_amount": 6155,
    "B": 40,
    "B_amount": 5270
  },
  {
    "timestamp": "2026-06-26T07:02:23.303Z",
    "A": 43,
    "A_amount": 6305,
    "B": 25,
    "B_amount": 3300
  },
  {
    "timestamp": "2026-06-27T01:02:41.687Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-27T07:03:00.413Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-28T01:03:20.322Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-28T07:03:38.357Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-29T01:03:45.314Z",
    "A": 37,
    "A_amount": 5485,
    "B": 31,
    "B_amount": 4120
  },
  {
    "timestamp": "2026-06-29T07:03:51.353Z",
    "A": 35,
    "A_amount": 4945,
    "B": 25,
    "B_amount": 3670
  },
  {
    "timestamp": "2026-06-30T01:03:59.162Z",
    "A": 39,
    "A_amount": 5305,
    "B": 23,
    "B_amount": 3270
  },
  {
    "timestamp": "2026-06-30T07:04:05.541Z",
    "A": 38,
    "A_amount": 5365,
    "B": 17,
    "B_amount": 2290
  },
  {
    "timestamp": "2026-07-01T01:04:14.589Z",
    "A": 33,
    "A_amount": 4920,
    "B": 24,
    "B_amount": 3005
  },
  {
    "timestamp": "2026-07-01T07:04:20.561Z",
    "A": 36,
    "A_amount": 5370,
    "B": 22,
    "B_amount": 2850
  },
  {
    "timestamp": "2026-07-02T01:04:30.778Z",
    "A": 32,
    "A_amount": 4760,
    "B": 28,
    "B_amount": 3610
  },
  {
    "timestamp": "2026-07-02T07:04:35.900Z",
    "A": 38,
    "A_amount": 5580,
    "B": 19,
    "B_amount": 2440
  },
  {
    "timestamp": "2026-07-06T07:00:08.964Z",
    "A": 43,
    "A_amount": 6720,
    "B": 26,
    "B_amount": 3710
  },
  {
    "timestamp": "2026-07-07T01:00:18.419Z",
    "A": 41,
    "A_amount": 6560,
    "B": 31,
    "B_amount": 4420
  }
];
